[
  {
    "url": "https://www.maxshimbaministries.org/2025/10/abraham-never-built-kabah.html",
    "title": "Abraham Never Built the Kaʿbah",
    "content_preview": "Abraham Never Built the Kaʿbah — A Scholarly ExaminationBy Dr. Maxwell Shimba — Shimba Theological InstituteAbstract (short).This article examines the widely held Islamic tradition that Abraham (Ibrāhīm) and his son Ismāʿīl built the Kaʿbah in Mecca, and it evaluates six assertions commonly made in Christian critiques: (1) Abraham never visited Mecca; (2) Abraham did not build the Black Stone nor did it fall from the sky in the manner commonly described in later tradition; (3) Abraham made altar",
    "full_content": "Abraham Never Built the Kaʿbah — A Scholarly ExaminationBy Dr. Maxwell Shimba — Shimba Theological InstituteAbstract (short).This article examines the widely held Islamic tradition that Abraham (Ibrāhīm) and his son Ismāʿīl built the Kaʿbah in Mecca, and it evaluates six assertions commonly made in Christian critiques: (1) Abraham never visited Mecca; (2) Abraham did not build the Black Stone nor did it fall from the sky in the manner commonly described in later tradition; (3) Abraham made altars opposite a sacred stone but not the Kaʿbah as known in Islamic tradition; (4) the “Valley of Baca” (Psa lm 84) is not identical with Bakka/Makkah; (5) the “pilgrimage” language in Psalm 84 is not a reference to Hajj at the Kaʿbah; and (6) the well where Hagar found water in Genesis is not necessarily the Zamzam of Mecca. The evidence shows that the Abraham–Kaʿbah connection is a powerful and ancienttraditionwithin Islam, but it is not independently attested by contemporary extra-Qurʾānic sources or archaeology in a way that would confirm the historicist claims made in later communal memory. Where the sources are ambiguous or interpretive, this paper exposes the contested nature of the identifications and recommends careful, cautious conclusions.IntroductionMuslim tradition presents the Kaʿbah as the primeval “House” associated with Adam and later rebuilt by Abraham and Ismāʿīl (Qurʾānic formulation: “when Abraham and Ismail raised the foundations of the House…”). This narrative is doctrinally central within Islam and embedded in ritual memory (tawāf, Hajj rites, the place of Maqām Ibrāhīm, Zamzam, the Black Stone). Yet from the perspective of historical-critical inquiry, the claim that Abraham physically visited Mecca and (re)constructed the Kaʿbah in the Hejaz requires external corroboration — textual, epigraphic, or archaeological — which is thin or absent. The following sections analyse the evidence and alternative readings.1. Tradition versus independent historical evidenceClaim.Abraham never visited Mecca (no independent historical evidence he did).Evidence & argument.The Qurʾān and Islamic tradition clearly attribute the raising/rebuilding of the Kaʿbah to Abraham and Ismāʿīl; however, secular historical and archaeological surveys note the paucity of contemporaneous (e.g., Near Eastern, Byzantine, or South Arabian) records that tie Abraham — a patriarchal figure of the second/third millennium BCE in Biblical chronology — to the Hejaz sanctuary. Modern reference works summarise both the Islamic tradition and the relative lack of independent evidence for a pre-Islamic Kaʿbah founded by Abraham in the exact form described by later Muslim exegesis.Encyclopedia Britannica+1Conclusion:The Abrahamic origin of the Kaʿbah is a theological/traditional claim with strong internal attestation in Islamic literature; it lacks external, datable archaeological corroboration that would demonstrate a historical, physical act by Abraham in Mecca.2. The Black Stone: tradition, later legend, and uncertain originClaim.Abraham never built the Black Stone from the sky; origin stories vary and are not historically verifiable.Evidence & argument.Islamic tradition recounts several origins for the Black Stone (al-Hajar al-Aswad): meteorite, relic from Adam, an angel turned to stone, etc. Medieval and later writers record these traditions, and modern commentators add geological speculation (some propose meteoritic origin). However, the stone has never been subjected to definitive modern scientific analysis (for obvious religious and political reasons), and scholarly treatments emphasise that accounts of celestial origin are traditions, not scientific proof.Wikipedia+1Conclusion:The Black Stone’s “from the sky” narrative belongs to devotional tradition and later apologetic exegesis; it cannot be treated as a historically established fact without independent physical analysis and corroboration.3. Abraham’s altars and the possibility of ritual sites distinct from the KaʿbahClaim.Abraham built altars to offer sacrifices opposite a stone, but this should not be conflated automatically with the later Kaʿbah structure in Mecca.Evidence & argument.Islamic exegetical tradition sometimes locates early patriarchal sanctities (altars, stations of prayer) within a broader sacred geography attributed to Abraham. Early texts and later tafsīr narrate that Abraham found the Black Stone and (re)established a sanctuary; yet these retellings function to sacralise the Meccan shrine and properly integrate it into Abrahamic lineage. From the historian’s viewpoint, such narrative moves are common in religious traditions that link local shrines to revered ancestors. Comparative scholarship treats such reports as theological legitimations rather than independent chronicles of construction works.Encyclopedia Britannica+1Conclusion:References to altars and sacrifices associated with Abraham are important for devotional history but do not demonstrate a straightforward archaeological claim that ties Abraham physically to the extant Kaʿbah complex.4. The Valley of Baca (Baka/Bakkah) — biblical text and identificationsClaim.The valley of Baca in Psalm 84 is not (demonstrably) the Valley of Mecca/Bakkah.Evidence & argument.Psalm 84 (a pilgrimage psalm) uses the Hebrew termBaca(בכא/“baká( )”/“weeping” or “balsam”), typically understood in Jewish and Christian exegesis as a local valley in or near ancient Israel (possible identifications include the Valley of Rephaim or others). Islamic interpreters read the QurʾānicBakkah(Q 3:96) as Mecca and some Muslim exegetes connect Psalmic language to Mecca retrospectively. Secular and revisionist scholars (e.g., Tom Holland; and various source-critical authors) point out that the HebrewBakhaand ArabicBakkahare separate lexical items and that identification of the Psalm’s valley with Mecca is not linguistically or historically compelled. The scholarly literature therefore treats the identification as speculative, often motivated by theological correlation rather than direct evidence.Bible Hub+1Conclusion:Psalm 84’s “Valley of Baca” is best read in its immediate canonical and Israelite setting; linking it to Mecca requires assumptions that go beyond the biblical text and into comparative theological reading.5. Psalm 84 and the idea of “pilgrimage” — not HajjClaim.The pilgrimage language in Psalm 84 is not description of the Islamic Hajj to the Kaʿbah.Evidence & argument.Psalm 84 is part of the Israelite pilgrimage/temple psalmody tradition (pilgrimage to Zion, the Temple). Its language — “blessed are those who dwell in your house… they journey from strength to strength” — is framed by Israelite cultic practice and geography (Jerusalem/Zion). While some modern readers attempt to read Psalm 84 typologically vis-à-vis later pilgrimage forms (including Hajj), the historical context and the Israelite cultic horizon make a direct identification with Hajj or the Kaʿbah anachronistic.Explore the Bible+1Conclusion:The Psalm is best explained within Israelite cultic-pilgrimage imagination; equating it to Hajj represents a theological reading, not an exegesis grounded in the Psalm’s own historical setting.6. Hagar, Ishmael, and the water: Zamzam vs. Genesis wellsClaim.The water associated with Hagar in Genesis is not necessarily the Zamzam well of Mecca.Evidence & argument.Genesis 21:14–21 recounts Hagar and Ishmael in the wilderness, God opening a well (Hebrewmiqweh/ma‘in), and their survival. Islamic tradition locates a parallel event at Mecca (Zamzam), and later Islamic historiography identifies the site and ritualises Safa–Marwah and the well. The narratives have similar motifs (divine water for the abandoned child), but the Genesis narrative is set in the Negev/Beersheba or surrounding region (patriarchal south of Canaan), and there is no explicit biblical geography of Mecca. The tradition that equates the Genesis well with Zamzam is thus an inter-religious identification that post-dates the biblical text and belongs to the Islamic sacred-historical mapping of Abrahamic memory onto the Hejaz.Wikipedia+1Conclusion:The shared motifs do not by themselves prove identity of locations; the Genesis text does not mention Mecca or Zamzam.7. Summary and balanced assessmentStrong internal tradition.Islamic texts (Qurʾān and hadīth corpus; classical tafsīr) and continuous devotional practice robustly affirm Abraham’s role vis-à-vis the Kaʿbah, the Black Stone, Zamzam, and the sanctity of Makkah/Bakkah. This is the baseline of Muslim belief and community memory.Encyclopedia Britannica+1Lack of independent, contemporary corroboration.From a historical-critical vantage point, there is no external contemporaneous record (Near Eastern inscriptions, Byzantine or South Arabian records) that corroborates in detail an act of Abrahamian construction in the Hejaz; archaeological evidence for a continuous, datable structure back to the patriarchal era is not available. Scholarly literature accordingly distinguishes tradition from verifiable history.Oxford Bibliographies+1Textual-linguistic caution.The HebrewBaca/Bakhaand ArabicBakkahare similar-looking to modern readers but have distinct philological histories; mapping Psalmic valleys to Mecca requires methodological caution and additional positive evidence.Wikipedia+1Tradition as identity-forming narrative.The Abraham–Kaʿbah tradition is a powerful identity and legitimating narrative. Its religious force is real even where extra-Islamic historical verification is not forthcoming. Recognising this helps explain why the tradition persists and is authoritative for Muslims even in the absence of corroborating archaeological data.Annex — Selected verses and texts (for reference)QurʾānSurah 3 (Āl-ʿImrān) : 96— “Verily, the first House (of worship) appointed for mankind was that at Bakkah (Makkah), full of blessing, and a guidance for mankind.” (common translations).My IslamQurʾān 2:127— “And when Abraham and Ishmael were raising the foundations of the House…” (translations vary: “raised the foundations” / “set up the House”).Encyclopedia BritannicaHebrew Bible / Old TestamentPsalm 84:5–6— “Blessed are those whose strength is in you, in whose heart are the highways to Zion. As they go through the Valley of Baca, they make it a place of springs; the early rain also covers it with pools.” (many vernacular translations available).Bible HubGenesis 21:14–19— (Narrative of Hagar and Ishmael; God provides a well; Ishmael’s survival; God hears the boy from the distance.)Bible Hub(The full canonical texts above are available in standard editions — e.g., Quran translations and the Hebrew Bible / English Bible editions cited in the bibliography.)Selected bibliography (works cited and recommended)Encyclopaedia Britannica, article “Kaaba” and “Black Stone of Mecca.” (See: overview of tradition and scholarly notes on the Kaʿbah and Black Stone).Encyclopedia Britannica+1“Bakkah” and “Bakkah / Baca” entries (Wikipedia; summary discussion of traditions and modern scholarly debates including Tom Holland and Patricia Crone’s revisionist suggestions).Wikipedia+1Zamzam Well — encyclopedic summary (Wikipedia: summary of Islamic traditions about Zamzam and later historical notes).WikipediaHolland, Tom.In the Shadow of the Sword— discussion of early Islamic geography and critical views on traditional locations (see scholarly debate on Bakkah/Mecca identifications).WikipediaOxford Bibliographies / Oxford handbooks on Islamic studies — entry “Kaʿba” and related literature reviews (useful for historiographic overview).Oxford BibliographiesBible translations and textual resources: BibleHub (Psalm 84, Genesis 21), for multiple modern translations and textual variants.Bible HubHistorical surveys and popular scholarly summaries on pre-Islamic Arabia and the Kaʿbah (Smarthistory, Khan Academy, MuslimHeritage publications) for accessible background.Smarthistory+2Khan Academy+2Final remarks (tone of scholarly civility)If the goal is to persuade Muslim readers, scholars of religion and inter-faith dialogue recommend an approach that recognises the theological centrality of the Abrahamic accountfor believerswhile carefully differentiating faith-claims from externally verifiable historical claims. The evidence above shows that: (a) the Abraham–Kaʿbah tradition is authoritative within Islamic historiography and ritual; (b) it is not matched by contemporaneous extra-Qurʾānic documentation or unambiguous archaeological proof; and (c) several identifications (Valley of Baca → Mecca; Genesis well → Zamzam) are interpretive overlays rather than necessary textual conclusions. For readers committed to historical-critical method, the prudent position is: treat these astradition-ladenclaims, strong within their religious contexts, but historicallycontestedwhen tested by external historical criteria.",
    "publish_date": "October 06, 2025",
    "publish_date_parsed": "2025-10-06T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 1733,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:59.288249"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/10/how-can-ishmaels-african-lineage-be.html",
    "title": "How can Ishmael’s African lineage be reconciled with the claim that Muhammad was purely Arab?",
    "content_preview": "A Scholarly Debate on Ishmael’s Lineage and the Ethnic Origins of MuhammadBy Dr. Maxwell Shimba, Shimba Theological InstituteIntroductionThe Islamic tradition holds that the Prophet Muhammad is a direct descendant of Ishmael, the son of Abraham and Hagar. This genealogical claim is foundational to Islamic identity, as it connects Muhammad—and therefore Islam—to the Abrahamic covenantal line. However, when examined through both scriptural and historical lenses, this claim raises several inconsist",
    "full_content": "A Scholarly Debate on Ishmael’s Lineage and the Ethnic Origins of MuhammadBy Dr. Maxwell Shimba, Shimba Theological InstituteIntroductionThe Islamic tradition holds that the Prophet Muhammad is a direct descendant of Ishmael, the son of Abraham and Hagar. This genealogical claim is foundational to Islamic identity, as it connects Muhammad—and therefore Islam—to the Abrahamic covenantal line. However, when examined through both scriptural and historical lenses, this claim raises several inconsistencies. A critical question arises:if Ishmael’s mother was Egyptian and his wife was also Egyptian, does this not imply that his descendants—if traceable—would be African rather than Arabian?This academic inquiry aims to provoke a theological and historical debate by juxtaposing the biblical narrative with Islamic claims. The purpose is not to diminish faith but to invite reasoned dialogue rooted in textual integrity and historical truth.1. The Biblical Account: Ishmael’s African ConnectionAccording toGenesis 16:1–12andGenesis 21:9–21, Hagar, the mother of Ishmael, was an Egyptian handmaiden of Sarah. Later, asGenesis 21:21records, Hagar took a wife for Ishmaelfrom the land of Egypt. This means Ishmael was the child of an Egyptian mother and married an Egyptian woman—making both his maternal and marital lines African in origin.Rabbinic commentary inGenesis Rabbah 53:15reinforces this by citing the proverb:“Throw a stick into the air, and it will always fall on its end.”In context, this saying means that Hagar, being Egyptian, naturally chose an Egyptian wife for her son.Thus, if Ishmael’s lineage continued biologically,his offspring would have carried Egyptian (African) blood.2. The Islamic Claim: Muhammad as a Descendant of IshmaelIslamic tradition asserts that Muhammad descended from Ishmael through his sonKedar(Qidar). This claim, however, lacks direct historical documentation before Islam emerged in the 7th century CE. There existsno continuous genealogical recordlinking Ishmael to Muhammad. The genealogy is largely retrospective—constructed after Muhammad’s lifetime to affirm his prophetic legitimacy within the Abrahamic line.Critical Questions:Where is the documented genealogical chain from Ishmael to Muhammad found before the 7th century?How can Ishmael’s African lineage be reconciled with the claim that Muhammad was purely Arab?If Arabs claim descent from Ishmael, does this not also imply that they share African ancestry through Hagar?Why do many Muslims reject any notion that Muhammad could have had African blood when their own tradition connects Ishmael to Egypt?3. Historical and Ethnological AnalysisThe termEgyptianin the biblical sense refers to people ofNorth African descent, part of the Hamitic line (Genesis 10:6). Therefore, Ishmael’s genealogy is partly Hamitic through Hagar and his Egyptian wife, and partly Semitic through Abraham. Any claim of pure Semitic descent through Ishmael ignores this dual heritage.Furthermore, ancient Arab tribes such as theQedariteswere nomadic groups in northwestern Arabia, but their ethnic composition was not uniform. Archaeological and linguistic evidence suggests significant African influence and intermarriage in those regions.If we accept the Islamic claim that Muhammad descended from Ishmael,logic dictates that Muhammad’s ancestry was at least partially African.Yet, this conclusion is often rejected in Islamic discourse, revealing a contradiction between faith-based genealogy and ethnological reality.4. The Debate: A Call for ConsistencyMuslims must face one of two possibilities:If Muhammad is indeed a descendant of Ishmael, then by scriptural and historical reasoning, he carried African (Egyptian) blood.If Muhammad was not African, then the claim that he descended from Ishmael collapses, since Ishmael’s lineage is inextricably tied to Egypt.Therefore, the question remains:“Can Islam uphold Muhammad’s Ishmaelite heritage without acknowledging his African ancestry?”If not, then perhaps the genealogical claim itself was theological rather than historical—a symbolic link to Abraham to grant Muhammad prophetic legitimacy.5. Scholarly ConclusionThis debate exposes a fundamental tension in Islamic historiography: the desire to connect Muhammad to Abraham through Ishmael, while distancing him from Africa through Hagar.But the biblical record is unambiguous—Hagar and Ishmael’s line began in Egypt.Hence, the argument concludes:Either Muhammad was an African by descent through Ishmael,Or he hadno genealogical connection to Ishmael at all.Until verifiable historical evidence bridges this 2,500-year genealogical gap, the claim remainsa theological assertion rather than a historical fact.Final Provocative Question:If Islam insists on an Abrahamic lineage through Ishmael, will it also embrace the African heritage inherent in that lineage—or continue to deny it in pursuit of an Arabized identity?By Dr. Maxwell ShimbaShimba Theological Institute",
    "publish_date": "October 06, 2025",
    "publish_date_parsed": "2025-10-06T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 678,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:59.216505"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/10/muhammad-is-worshipped-by-beasts-and.html",
    "title": "MUHAMMAD IS WORSHIPPED BY BEASTS AND TREES: A CRITICAL ANALYSIS OF AÏSHA’S TESTIMONY",
    "content_preview": "MUHAMMAD IS WORSHIPPED BY BEASTS AND TREES: A CRITICAL ANALYSIS OF AÏSHA’S TESTIMONYBy Dr. Maxwell ShimbaShimba Theological InstituteAbstractThis paper examines a controversial Hadith narrated by Aisha, the wife of Prophet Muhammad, as recorded inJamiʿ al-Tirmidhi Hadith 3270. The narration reports that animals and trees prostrated before Muhammad, implying an act of worship. The Companions, amazed by this act, suggested that they too should prostrate before him. This Hadith raises deep theologi",
    "full_content": "MUHAMMAD IS WORSHIPPED BY BEASTS AND TREES: A CRITICAL ANALYSIS OF AÏSHA’S TESTIMONYBy Dr. Maxwell ShimbaShimba Theological InstituteAbstractThis paper examines a controversial Hadith narrated by Aisha, the wife of Prophet Muhammad, as recorded inJamiʿ al-Tirmidhi Hadith 3270. The narration reports that animals and trees prostrated before Muhammad, implying an act of worship. The Companions, amazed by this act, suggested that they too should prostrate before him. This Hadith raises deep theological questions about the nature of worship, the distinction between servitude to God and reverence for a human, and the boundaries of Islamic monotheism (tawḥīd). The paper seeks to evaluate the theological, logical, and Qur’anic inconsistencies that emerge from this narration.The Quoted HadithAl-Tirmidhi, Hadith 3270— Narrated by Aisha:\"Once when Allah's Messenger (peace be upon him) was with a number of the Emigrants and Helpers, a camel came and prostrated itself before him. Thereupon his Companions said, ‘Messenger of Allah, beasts and trees prostrate themselves before you, but we have the greatest right to do so.’ He replied, ‘Worship your Lord and honor your brother. If I were to order anyone to prostrate himself before another, I should order a woman to prostrate herself before her husband. If he were to order her to convey stones from a yellow mountain to a black one, or from a black mountain to a white one, it would be incumbent on her to do so.’\"(Transmitted by Ahmad and al-Tirmidhi)Theological and Logical InquiryAisha’s narration introduces profound theological implications that challenge Islamic monotheism (Tawḥīd al-ʿUlūhiyyah). The fact that animals and trees allegedlyprostrated before Muhammadimplies an act of reverence reserved for divine beings. In Islam,sujūd(prostration) is a distinct form of worship that belongs exclusively to Allah (Surah 41:37; 22:18). Thus, if non-human creation performed this before Muhammad, several critical questions arise:Did the animals and trees commit shirk (idolatry)?According toSurah al-Anbiyāʾ 21:98–99,“Indeed, you and what you worship besides Allah are the fuel of Hell. You will surely enter it. If those had truly been gods, they would not have entered it, but all will abide therein forever.”This verse condemns all beings that are worshipped besides Allah. If animals and trees prostrated before Muhammad, does this not make him the object of their worship?Why did Allah allow this to occur?If Muhammad is truly a mere messenger (rasūl), how does divine permission extend to acts of prostration toward him by creation? Is this not in contradiction withSurah 41:37which states,“Do not prostrate to the sun or to the moon, but prostrate to Allah who created them.”Was Aisha mistaken or fabricating?As the Prophet’s wife, Aisha’s report holds significant authority in Islamic tradition. However, if the Hadith implies the Prophet accepted worship (even passively), it undermines the Qur’anic command inSurah 18:110:“Say, I am only a human being like you, to whom it has been revealed that your God is one God.”If Aisha’s account is authentic, then it portrays Muhammad in a position of divinity rather than prophethood.Exegetical Tension: Worship vs. HonorThe Prophet’s response—“Worship your Lord and honor your brother”—appears to distance himself from direct worship. Yet, the narrative fails to address why the camel and trees were permitted to perform prostration. The Companions’ statement,“Beasts and trees prostrate before you, but we have the greatest right to do so,”reveals that even early Muslims perceived this as an act ofveneration, if not worship.This suggests an early tendency towardprophetic exaltation, later seen inShama’il al-Muhammadiyyahand Sufi traditions where Muhammad is described as the “Light of Creation” (Nūr Muḥammadī). The narrative, therefore, exposes an evolving theology that blurs the line between devotion to Allah and reverence for His messenger.Philosophical and Theological ImplicationsFrom a theological standpoint, the Hadith leads to a paradox:If the beasts and trees truly worshipped Muhammad,shirkwas committed.If they did not, the Hadith contradicts its own narrative, rendering itmythological or metaphorical.Either outcome undermines the integrity of Hadith transmission or Islamic theology of pure monotheism.Furthermore, this account echoesancient pagan reverencewhere nature worshipped semi-divine heroes and kings—suggesting the possiblesyncretic incorporationof earlier cultural myths into Hadith literature.ConclusionThe Hadith of Aisha (al-Tirmidhi 3270) remains a profound theological problem within Islamic orthodoxy. It implies that Muhammad received a form of worship from creation, contradicting the Qur’an’s uncompromising monotheism. Whether this account is allegorical or literal, it exposes atension between prophetic humanity and divine exaltationin early Islamic narratives. The narration attributed to Aisha thus becomes a critical text for examiningthe evolution of Muhammad’s deificationin post-Qur’anic traditions.BibliographyAl-Tirmidhi, Abu Isa Muhammad ibn Isa.Jamiʿ al-Tirmidhi, Hadith 3270.Ahmad ibn Hanbal.Musnad Ahmad, Vol. 6, Hadith No. 25512.The Qur’an, Surah 18:110; 21:98–99; 22:18; 41:37.Ibn Kathir, Ismail.Tafsir al-Qur’an al-Azim.Dar al-Fikr, Beirut, 1998.Al-Bukhari, Muhammad ibn Ismail.Sahih al-Bukhari.Crone, Patricia.Meccan Trade and the Rise of Islam.Princeton University Press, 1987.Wansbrough, John.Quranic Studies: Sources and Methods of Scriptural Interpretation.Oxford University Press, 1977.Shimba, Maxwell.Theological Paradoxes in Islamic Texts: A Comparative Inquiry.Shimba Theological Institute Press, 2025.",
    "publish_date": "October 06, 2025",
    "publish_date_parsed": "2025-10-06T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 789,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:59.024580"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/10/divine-uncertainty-in-quran-4728.html",
    "title": "Divine Uncertainty in Qur’an 47:28: A Theological Inquiry into Allah’s “Installation”",
    "content_preview": "Divine Uncertainty in Qur’an 47:28: A Theological Inquiry into Allah’s “Installation”By Dr. Maxwell Shimba, Shimba Theological InstituteAbstractThis article investigates the peculiar expression inQur’an 47:28, where Allah is portrayed as “installing” or “setting” (imlāʾ) something within the disbelievers, which raises profound questions about divine certainty, omniscience, and intentionality in the Qur’anic text. The study employs comparative theological analysis, hermeneutical exegesis, and lin",
    "full_content": "Divine Uncertainty in Qur’an 47:28: A Theological Inquiry into Allah’s “Installation”By Dr. Maxwell Shimba, Shimba Theological InstituteAbstractThis article investigates the peculiar expression inQur’an 47:28, where Allah is portrayed as “installing” or “setting” (imlāʾ) something within the disbelievers, which raises profound questions about divine certainty, omniscience, and intentionality in the Qur’anic text. The study employs comparative theological analysis, hermeneutical exegesis, and linguistic critique to uncover whether the verse implies divine uncertainty or a reactive, rather than sovereign, mode of action in Allah’s dealings with human beings.1. Introduction: The Problem of Divine Intention in Qur’an 47:28Qur’an 47:28 states:“That is because they followed what angered Allah and disliked what pleased Him, so He made their deeds fruitless.”(Qur’an 47:28, Sahih International)However, several classical and modern translations also render key verbs in ways that suggestinstallation,deliberate placement, orallowance— terms which carry semantic connotations of gradual process, testing, or even hesitation. The Arabic phrasefa-ahbaṭa a‘mālahum(“so He made their deeds fruitless”) and related interpretive commentaries imply an intervention that occursafter observation, not by predetermined decree.This raises critical theological questions:If Allah’s omniscience is perfect, why must He “install” or “set” reactions after observing human choices?Does this imply that Allah’s judgment is contingent upon unfolding events?How can an all-knowing deity “test” what He already knows with absolute certainty?2. Linguistic and Exegetical Analysis of “Installation” (إملاء)The Arabic termimlāʾ(from the rootm-l-y) occurs in several Qur’anic passages (e.g., 3:178; 7:183), often translated as “granting respite,” “installing,” or “allowing delay.” This verb is sometimes used to describe Allah’s extended patience toward sinners before punishment.Yet, the morphology of the word suggestsprocessrather thanfinality. It depicts a deity who acts through stages, waiting, observing, and then implementing outcomes based on human response.In classicaltafsīrworks (e.g.,Tafsir al-Tabari,Tafsir al-Qurtubi), scholars attempted to reconcile this with Allah’s omniscience by claiming thatimlāʾrefers to divine testing (ibtilāʾ). However, testing presupposes uncertainty about the test’s result — a philosophical contradiction to omniscience.This invites deeper inquiry:Why does Allah “grant time” or “install” disbelief rather than instantaneously decreeing it?Doesimlāʾreflect a temporal learning process within Allah’s actions?Can a timeless being operate within temporal delay?3. Theological Implications: Is Allah Reactive or Proactive?The Qur’an often portrays Allah asreactingto human behavior: rewarding faith, cursing disbelief, or altering decrees based on obedience (Qur’an 13:39; 8:53). InQur’an 47:28, this reactive tendency is evident — Allah responds to their dislike of what pleases Him by nullifying their deeds.In contrast, the Biblical God declares,“I am the Lord, I change not”(Malachi 3:6) and“Known unto God are all His works from the beginning of the world”(Acts 15:18). The Biblical framework depicts omniscience as an eternal constancy, not adaptive reaction.Hence, the question arises:Does the Qur’an’s Allah act sequentially, responding to events as they occur?If so, can divine knowledge in Islam be truly eternal and unchanging?Does Allah’s “installation” of delay suggest dependence on human decision-making to complete His will?4. The Problem of Divine Psychology: Is Allah Testing Himself?If Allah’s “installation” implies that He must observe before judging, this introduces a divine cognitive process resemblinghuman reasoning. This anthropomorphic depiction contradicts the classical Islamic doctrine oftanzīh(absolute transcendence), which asserts that Allah is beyond time, space, and human emotion.Yet, Qur’an 47:28 and related verses describe Allah as being angered, pleased, or testing believers. Such human-like emotions raise theological tension:Can an immutable being become “angry” or “pleased”?Is Allah’s decision-making process an evolving response rather than a predetermined decree?If Allah installs disbelief or guidance progressively, is He learning from human actions?5. Comparative Reflection: Divine Certainty in the Bible vs. Qur’anIn the Hebrew and Christian Scriptures, God’s foreknowledge precedes creation itself (Isaiah 46:10; Romans 8:29). There is no notion of divine installation or delay because God’s decrees are absolute, not observational.By contrast, the Qur’anic Allah’s behavior appears inconsistent with omniscient sovereignty. He “tests” to know (Qur’an 47:31), “changes” decrees (Qur’an 13:39), and “installs” or “grants time” (Qur’an 47:28; 3:178).Thus, the philosophical debate centers on whether the Qur’anic portrayal of Allah reflectsepistemic limitation— an unfolding divine consciousness tied to time and human action — or whether these are merely metaphors misunderstood by interpreters.6. Conclusion: A Call for Re-examining Qur’anic TheismQur’an 47:28 exposes deep theological ambiguity. The “installation” language challenges the coherence of Allah’s omniscience, sovereignty, and immutability. The Qur’an’s God appears to operate within temporal frameworks, responding to human choices rather than governing from eternal certainty.This invites broader philosophical and theological questions:If Allah must install, test, or wait, can He be truly omniscient?Is the Qur’an’s deity engaged in temporal trial and error?Does this reveal an evolving concept of God in early Islamic theology?Or does it point to a fundamentally human authorship behind the Qur’an, reflecting psychological projection rather than divine omniscience?ReferencesThe Qur’an, Surah 47:28, 3:178, 7:183, 13:39, 8:53, 47:31.Al-Tabari,Jāmiʿ al-Bayān ʿan Taʾwīl Āy al-Qurʾān.Al-Qurtubi,Al-Jāmiʿ li-Aḥkām al-Qurʾān.Ibn Kathir,Tafsir al-Qur’an al-ʿAzim.Cragg, Kenneth.The Event of the Qur’an: Islam in Its Scripture. Oxford University Press, 1971.Parrinder, Geoffrey.Jesus in the Qur’an. Sheldon Press, 1965.The Holy Bible (KJV): Malachi 3:6; Acts 15:18; Isaiah 46:10; Romans 8:29.",
    "publish_date": "October 06, 2025",
    "publish_date_parsed": "2025-10-06T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "allah",
    "word_count": 805,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:58.895106"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/allah-aliteremsha-aya-na-kueleza-kuwa.html",
    "title": "ALLAH ALITEREMSHA AYA NA KUELEZA KUWA SINAGOGI SIO MISIKITI",
    "content_preview": "Jumamosi, Septemba 24, 2016​ALLAH ALITEREMSHA AYA NA KUELEZA KUWA SINAGOGI SIO MISIKITIHili ni jambo la kushangaza na pigo kubwa kwa Uislamu wote duniani. Ndiyo maana nalisema wazi kuwa hii nimsumari wa mwisho kwenye jeneza la Uislamu.KatikaSuratul Hajj, Aya ya 40, Qur’an yenyewe inatamka kwa uwazi kuhusu aina mbalimbali za majengo ya ibada. Imeorodhesha “nyumba za watawa,” “makanisa,” “masinagogi,” na “misikiti.” Swali la msingi na la kufikirisha ni hili:Kama kweli Sinagogi ni sawa na Misikiti,",
    "full_content": "Jumamosi, Septemba 24, 2016​ALLAH ALITEREMSHA AYA NA KUELEZA KUWA SINAGOGI SIO MISIKITIHili ni jambo la kushangaza na pigo kubwa kwa Uislamu wote duniani. Ndiyo maana nalisema wazi kuwa hii nimsumari wa mwisho kwenye jeneza la Uislamu.KatikaSuratul Hajj, Aya ya 40, Qur’an yenyewe inatamka kwa uwazi kuhusu aina mbalimbali za majengo ya ibada. Imeorodhesha “nyumba za watawa,” “makanisa,” “masinagogi,” na “misikiti.” Swali la msingi na la kufikirisha ni hili:Kama kweli Sinagogi ni sawa na Misikiti, kwa nini Qur’an inavitofautisha kwa majina na kuyaweka kama taasisi tofauti?Aya inasema:“Wale ambao wametolewa majumbani mwao pasipo haki, ila kwa kuwa wanasema: Mola wetu Mlezi ni Mwenyezi Mungu! Na lau kuwa Mwenyezi Mungu hawakingi watu kwa watu, basi hapana shaka zingelivunjwa nyumba za wat’awa, na makanisa, na masinagogi, na misikiti, ambamo ndani yake jina la Mwenyezi Mungu linatajwa kwa wingi. Na bila shaka Mwenyezi Mungu humsaidia yule anayemsaidia Yeye. Hakika Mwenyezi Mungu ni Mwenye Nguvu, Mtukufu.”(Suratul Hajj: 40)Tafakari kwa makini maneno haya:Nyumba za watawa– Hizi ni sehemu ambazo watawa wa Kikristo walijitenga kwa maombi na ibada.Makanisa– Majengo ya Wakristo yaliyotengwa mahsusi kwa ajili ya ibada ya Mungu.Masinagogi– Nyumba za ibada za Wayahudi, ambako Torati ilisomwa na jina la Mungu wa Israeli likatajwa.Misikiti– Hapa ndipo Waislamu walipokusanyika kwa ibada zao.Kwa nini Qur’an isiunganishe yote haya kama kitu kimoja kama kweli ni ibada ya Mungu mmoja? Ikiwa Sinagogi na Msikiti ni kitu kimoja, basi uorodheshaji huu ungekuwa wa kurudia rudia tu, jambo ambalo lingeharibu hata ufasaha wa maandiko.Hii inafunua mambo makubwa mawili:Kwanza, Qur’an inakiri kwa uwazi kwamba kabla ya Muhammad, tayari kulikuwepo na nyumba nyingi za ibada zinazotofautiana – Wayahudi na Wakristo walishamjua Mungu na walishamwabudu kwa karne nyingi kupitia Sinagogi na Makanisa.Pili, aya hii inaweka wazi kwamba Misikiti ni taasisi mpya iliyoibuka tu baada ya Muhammad. Hii inaondoa madai ya Waislamu kwamba Uislamu ulikuwepo tangu zama za Nabii Ibrahim au kwamba dini zote za awali zilikuwa na “Uislamu.” Kama ingekuwa hivyo, basi Sinagogi zingetajwa kama Misikiti na Makanisa yangetambuliwa pia kama Misikiti.Kwa hiyo, Qur’an inajichanganya yenyewe. Inapojaribu kuhalalisha nafasi ya Uislamu, kwa bahati mbaya inakiri bila kujua kwamba dini za awali – Uyahudi na Ukristo – zilikuwa na utambulisho wao wa kipekee na wa kweli wa ibada.Ukweli huu unathibitisha hoja yangu ya msingi:Uislamu ni mfumo ulioanzishwa na Muhammad karne ya 7 BK, na haukuwapo kabla yake.Ni dini ya kubuni yenye mkanganyiko, iliyoundwa ili kupinga na kuiga mafundisho ya Biblia.Kwa hiyo, swali kwa kila Msomaji Mwislamu ni hili:Kwa nini Qur’an yako inatofautisha kati ya Sinagogi na Misikiti?Ikiwa dini yako ndiyo dini ya kweli tangu mwanzo, kwa nini Qur’an iseme wazi kwamba Sinagogi na Makanisa yalikuwepo, yakitajwa jina la Mungu kwa wingi?Kwa nini Allah awape heshima Wayahudi na Wakristo kwa kutaja majengo yao ya ibada, kama kweli dini zao ni “zilizopotoshwa”?Ukitazama kwa macho ya uhalisia, hoja hizi zinabomoa kabisa msingi wa Uislamu.Ndio maana mimi,Max Shimba, mtumwa wa Yesu Kristo, nasema kwa ujasiri:Hakuna jina jingine limepewa wanadamu tupate wokovu, isipokuwa jina la Yesu Kristo.(Matendo 4:12).Hitimisho​Aya ya Qur’an katikaSuratul Hajj 40inafichua ukweli mzito usioweza kufichwa: kwamba dini ya Uislamu haikuwa na mizizi kabla ya Muhammad. Qur’an yenyewe inakiri kwa uwazi kwamba kabla ya kuzaliwa kwa Uislamu kulikuwepo na jamii zilizomtumikia Mungu kupitia nyumba zao za ibada – Sinagogi kwa Wayahudi, na Makanisa kwa Wakristo. Kwa kulitaja jambo hili, Qur’an imethibitisha kwamba kumjua Mungu si jambo lililozaliwa katika karne ya saba, bali lilianza maelfu ya miaka kabla ya Muhammad kupitia Agano la Kale na likakamilishwa kwa Kristo katika Agano Jipya.Kwa mantiki ya kifalsafa, hili linaibua maswali magumu kwa Uislamu:Kama dini ya kweli ni moja tu, kwa nini Qur’an itaje Sinagogi, Makanisa na Misikiti kama majengo tofauti?Ikiwa Uislamu ulikuwepo tangu zama za Ibrahim, kwa nini Sinagogi na Makanisa havikuitwa Misikiti?Kwa nini Qur’an ipe heshima majengo ya ibada ya Wayahudi na Wakristo, wakati Waislamu hufundishwa mara nyingi kwamba dini hizi zimepotoshwa?Kihistoria, Sinagogi zilianza karne nyingi kabla ya Kristo, baada ya Wayahudi kuhamishwa Babeli. Hapo ndipo walipojenga utamaduni wa kukusanyika, kusoma Torati, na kumtaja Mungu wa Israeli. Vivyo hivyo, Makanisa ya Kikristo yalizaliwa baada ya ufufuo wa Yesu Kristo, yakieneza injili na mafundisho ya upendo na wokovu. Kwa hiyo, Qur’an inapovihesabu majengo haya kama sehemu ambapo jina la Mungu linatajwa kwa wingi, inakiri moja kwa moja kwamba dini za Kiyahudi na Kikristo zilikuwa na uhalali na ushawishi mkubwa kabla ya Uislamu.Kimaandiko, Biblia yenyewe imethibitisha kwa karne nyingi kabla ya Muhammad kwamba wokovu ni kwa kupitia Yesu Kristo pekee. Mtume Petro alisema wazi:“Wala hakuna wokovu katika mwingine awaye yote; kwa maana hapana jina jingine chini ya mbingu walilopewa wanadamu, tupate wokovu kwalo, isipokuwa jina la Yesu Kristo.”(Matendo ya Mitume 4:12).Kwa hiyo, Qur’an inapojaribu kuhalalisha Misikiti kama sehemu ya ibada ya Mungu, inajichanganya kwa sababu inatambua kwamba Sinagogi na Makanisa pia ni sehemu ambapo jina la Mungu linasemwa. Hii inathibitisha kwamba Mungu wa kweli amejifunua tayari kupitia historia ya Uyahudi na umwilisho wa Yesu Kristo, na wala si kupitia mafundisho mapya ya Muhammad.Kwa mtazamo wa kiroho, hili linapaswa kumfanya kila Mwislamu afikirie kwa makini: Je, kweli dini yako inatoka kwa Mungu, au ni mfumo uliojengwa baadaye ili kuiga yale yaliyokuwepo? Je, kweli unaweza kujiokoa kwa kushikamana na dini iliyojaa mkanganyiko wa maandiko, au kwa kumpokea Yesu Kristo ambaye ndiye njia, kweli na uzima? (Yohana 14:6).Ukweli unabaki pale pale:Uislamu ni dini ya baadaye, iliyoanzishwa na Muhammad, na haina mizizi ya kweli katika historia ya wokovu. Njia ya kweli, iliyowekwa tangu Agano la Kale na kukamilishwa katika Agano Jipya, ni Yesu Kristo pekee.Kwa hiyo, msomaji mpendwa, chaguo liko mikononi mwako. Unaweza kuendelea kushikamana na dini ya wanadamu, au ukaamua kumfuata Yesu Kristo, ambaye ndiye nuru ya ulimwengu na mwokozi wa roho zako.Mimi niMax Shimba, mtumwa wa Yesu Kristo.",
    "publish_date": "September 30, 2025",
    "publish_date_parsed": "2025-09-30T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 929,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:59.371538"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/muhammad-gets-mounted-by-men.html",
    "title": "Muhammad Gets Mounted by Men!",
    "content_preview": "Muhammad Gets Mounted by Men!According to asahih(sound, authentic) narration, a group of tall, scrawny men mounted and rode Muhammad all night long, which caused him tremendous pain and exhaustion:﻿إن عبدالله قال إستبعثني رسول الله ﷺ قال فانطلقنا حتى أتيت مكان كذا وكذا فخطَّ لي خطة فقال لي كن بين ظهرَي هذه لا تخرج منها فإنك إن خرجت هلكتَ قال فكنت فيها قال فمضى رسول الله ﷺ خَذَفة أو أبعد شيئاً أو كما قال ثم إنه ذكر هنيناً كأنهم الزُطّ قال عفان أو كما قال عفان إن شاء الله ليس عليهم ثياب ولا أرى سو",
    "full_content": "Muhammad Gets Mounted by Men!According to asahih(sound, authentic) narration, a group of tall, scrawny men mounted and rode Muhammad all night long, which caused him tremendous pain and exhaustion:﻿إن عبدالله قال إستبعثني رسول الله ﷺ قال فانطلقنا حتى أتيت مكان كذا وكذا فخطَّ لي خطة فقال لي كن بين ظهرَي هذه لا تخرج منها فإنك إن خرجت هلكتَ قال فكنت فيها قال فمضى رسول الله ﷺ خَذَفة أو أبعد شيئاً أو كما قال ثم إنه ذكر هنيناً كأنهم الزُطّ قال عفان أو كما قال عفان إن شاء الله ليس عليهم ثياب ولا أرى سوءاتهم طوالاً قليل لحمهم قال فأتوا فجعلوا يركبون رسول الله ﷺ قال وجعل نبي الله ﷺ يقرأ عليهم قال وجعلوا يأتوني فيخيِّلون أو يميلون حولي ويعترضون لي قال عبدالله فاُرعبتُ منهم رُعباً شديداً قال فجلست أو كما قال قال فلما إنشقَّ عمود الصبح جعلوا يذهبون أو كما قال قال ثم إن رسول الله ﷺ جاء ثقيلاً وَجِعاً أو يكاد أن يكون وجعاً مما ركِبوه قال إني لأجدني ثقيلاً أو كما قال فوضع رسول الله ﷺ رأسه في حجري أو كما قال قال ثم إن هنيناً أتوا عليهم ثياب بيض طوال أو كما قال وقد أغفى رسول الله ﷺ قال عبدالله فارعبت منهم أشد مما اُرعبت المرة الاولىقال عارم في حديثه فقال بعضهم لبعض لقد اُعطي هذا العبد خيراً أو كما قالوا إن عينيه نائمتان أو قال عينيه أو كما قالوا وقلبه يقظان ثم قال قال عارم وعفان قال بعضهم لبعض هلم فلنضرب له مثلاً أو كما قالوا قال بعضهم لبعض اضربوا له مثلاً ونؤوِّل نحن أو نضرب نحن وتؤوِّلون أنتم فقال بعضهم لبعض مثله كمثل سيد ابتنى بنياناً حصيناً ثم أرسل إلى الناس بطعام أو كما قال فمن لم يأت طعامه أو قال لم يتبعه عذّبه عذاباً شديداً أو كما قالوا قال الآخرون أما السيد فهو رب العالمين وأما البنيان فهو الاسلام والطعام الجنة وهو الداعي فمن اتّبعه كان في الجنة قال عارم في حديثه أو كما قال ومن لم يتبعه عُذِّب أو كما قال ثم إن رسول الله ﷺ إستيقظ فقال ما رأيت يا إبن أم عبد فقال عندالله رأيت كذا وكذا فقال نبي الله ﷺ ما خُفي عليّ مما قالوا شيء قال نبي الله ﷺ هم نفر من الملائكة أو قال هم من الملائكة أو كما شاء اللهإسنادهصحيحالمسند للامام أحمد , مسند عبدالله بن مسعود رضي الله تعالى عنهAbdullah [ibn Mas’ud] related: The Messenger of Allah sent for me, so we set out until I reached such-and-such a place, and He traced a line for me and told me: Stay between the two edges of this – don’t go outside of it; if you go outside of it, it’s over for you. Abdullah said: And so I stayed there. Then the Messenger of Allah went off a stone’s throw away or a little farther (or something like that). Then he [Abdullah] mentioned a group of male members [haneen, i.e. men] who looked like Zutt people. ‘Affan narrated (or something like what ‘Affan said, Allah willing):They didn’t have any clothes on, and I didn’t see their genitals, and they were tall and scrawny. He [Abdullah] said:And they came and started to ride [yarkaboun] the Messenger of Allah, and the Prophet of Allah began to recite to them. And they started to move closer and lean around me, and get in my way,and I became intensely terrified of them, so I sat down (or something like that). And when the morning light broke, they began to go away (or something like that).Then the Messenger of Allah came back exhausted and in pain, or practically in pain, from how they had ridden him; He said:Indeed I am exhausted (or something like that). Then the Messenger of Allah put his head in my lap (or something like that). And the men came with tall white garments on, but the Messenger of Allah had fallen asleep. And I became more intensely terrified of them than I was the first time.‘Arim said in his hadith: Then some of them said to the others: This man has been given good things (or something like that) – indeed his eyes sleep – or they said: His eye (or something like that) – but his heart is awake. ‘Arim and ‘Affan narrated: Some of them said to the others: Come, let us make a riddle about him (or something like that). And some of them said to the others: Make a riddle about him, and we will solve it – or: We will make a riddle, and you all can solve it. Then some of them said to the others: He is like a master, who built a well-fortified building, then sent out food to people (or something like that) and whoever does not take his food – or he said: Whoever does not follow him – He punishes him severely (or something like that). And the others replied: Indeed the master is the Lord of the Worlds, and indeed the building is Islam, and the food isJannah, and this is he who bids people to come; and whoever follows after him will be inJannah. ‘Arim said in his hadith (or something like it) – and whoever does not follow after him will be punished (or something like that). Then the Messenger of Allah woke up and said: What did you see, oh Ibn Umm ‘Abd? And Abdullah said: I saw this and that. And the Prophet of Allah said: Nothing of what they said has been hidden from me? The Prophet of Allah said: They were a group of angels – or He said: They were angels. (Or whatever Allah wills.) (SOUND CHAIN OF NARRATION)Musnad Ahmad, Section: Narrations from Abdullah ibn Mas’ud(https://sunnah2.com/262; emphasis mine)We leave it to the readers to decide what these men were actually doing to Muhammad all night long which left him in extreme pain.",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 955,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.473867"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/muhammads-talking-animal-farm.html",
    "title": "MUHAMMAD’S TALKING ANIMAL FARM",
    "content_preview": "MUHAMMAD’S TALKING ANIMAL FARMAccording to the most reliable collection of sunni hadiths, Muhammad believed that animals like cows and wolves could actually speak like humans do!60 Prophets(54) Chapter:Narrated Abu Huraira:Once Allah’s Messenger offered the morning prayer and then faced the people and said, “While a man was driving a cow, he suddenly rode over it and beat it.The cow said, ‘We have not been created for this, but we have been created for sloughing.’ On that the people said astonis",
    "full_content": "MUHAMMAD’S TALKING ANIMAL FARMAccording to the most reliable collection of sunni hadiths, Muhammad believed that animals like cows and wolves could actually speak like humans do!60 Prophets(54) Chapter:Narrated Abu Huraira:Once Allah’s Messenger offered the morning prayer and then faced the people and said, “While a man was driving a cow, he suddenly rode over it and beat it.The cow said, ‘We have not been created for this, but we have been created for sloughing.’ On that the people said astonishingly, “Glorified be Allah!A cow speaks!” The Prophet said, “I believe this, and Abu Bakr and `Umar too, believe it, although neither of them was present there.” While a person was amongst his sheep, a wolf attacked and took one of the sheep. The man chased the wolf till he saved it from the wolf,where upon the wolf said, ‘You have saved it from me; but who will guard it on the day of the wild beasts when there will be no shepherd to guard them except me (because of riots and afflictions)?” The people said surprisingly, “Glorified be Allah!A wolf speaks!” The Prophet said, “But I believe this, and Abu Bakr and `Umar too, believe this, although neither of them was present there.” (See the Foot-note of page No. 10 Vol.5)Reference: Sahih al-Bukhari 3471In-book reference: Book 60, Hadith 138USC-MSA web (English) reference: Vol. 4, Book 55, Hadith 677 (sunnah.comhttps://sunnah.com/bukhari:3471)",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 229,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.423074"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/muhammads-talking-donkey.html",
    "title": "MUHAMMAD’S TALKING DONKEY",
    "content_preview": "MUHAMMAD’S TALKING ASSAccording to one of the most authentic collections of Shia hadiths, Muhammad had a talking ass who narrated a tradition from a long chain of talking asses. All emphasis is mine.Ḥadīth #9: 6279ـ مُحَمَّدُ بْنُ الْحُسَيْنِ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ الله  قَالَ لَمَّا حَضَرَتْ رَسُولَ الله ﷺ الْوَفَاةُ دَعَا الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ وَأَمِيرَ ",
    "full_content": "MUHAMMAD’S TALKING ASSAccording to one of the most authentic collections of Shia hadiths, Muhammad had a talking ass who narrated a tradition from a long chain of talking asses. All emphasis is mine.Ḥadīth #9: 6279ـ مُحَمَّدُ بْنُ الْحُسَيْنِ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ شَبَابٍ الصَّيْرَفِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ الله  قَالَ لَمَّا حَضَرَتْ رَسُولَ الله ﷺ الْوَفَاةُ دَعَا الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ وَأَمِيرَ الْمُؤْمِنِينَ  فَقَالَ لِلْعَبَّاسِ يَا عَمَّ مُحَمَّدٍ تَأْخُذُ تُرَاثَ مُحَمَّدٍ وَتَقْضِي دَيْنَهُ وَتُنْجِزُ عِدَاتِهِ فَرَدَّ عَلَيْهِ فَقَالَ يَا رَسُولَ الله بِأَبِي أَنْتَ وَأُمِّي إِنِّي شَيْخٌ كَثِيرُ الْعِيَالِ قَلِيلُ الْمَالِ مَنْ يُطِيقُكَ وَأَنْتَ تُبَارِي الرِّيحَ قَالَ فَأَطْرَقَ ﷺ هُنَيْئَةً ثُمَّ قَالَ يَا عَبَّاسُ أَ تَأْخُذُ تُرَاثَ مُحَمَّدٍ وَتُنْجِزُ عِدَاتِهِ وَتَقْضِي دَيْنَهُ فَقَالَ بِأَبِي أَنْتَ وَأُمِّي شَيْخٌ كَثِيرُ الْعِيَالِ قَلِيلُ الْمَالِ وَأَنْتَ تُبَارِي الرِّيحَ قَالَ أَمَا إِنِّي سَأُعْطِيهَا مَنْ يَأْخُذُهَا بِحَقِّهَا ثُمَّ قَالَ يَا عَلِيُّ يَا أَخَا مُحَمَّدٍ أَ تُنْجِزُ عِدَاتِ مُحَمَّدٍ وَتَقْضِي دَيْنَهُ وَتَقْبِضُ تُرَاثَهُ فَقَالَ نَعَمْ بِأَبِي أَنْتَ وَأُمِّي ذَاكَ عَلَيَّ وَلِي قَالَ فَنَظَرْتُ إِلَيْهِ حَتَّى نَزَعَ خَاتَمَهُ مِنْ إِصْبَعِهِ فَقَالَ تَخَتَّمْ بِهَذَا فِي حَيَاتِي قَالَ فَنَظَرْتُ إِلَى الْخَاتَمِ حِينَ وَضَعْتُهُ فِي إِصْبَعِي فَتَمَنَّيْتُ مِنْ جَمِيعِ مَا تَرَكَ الْخَاتَمَ ثُمَّ صَاحَ يَا بِلالُ عَلَيَّ بِالْمِغْفَرِ وَالدِّرْعِ وَالرَّايَةِ وَالْقَمِيصِ وَذِي الْفَقَارِ وَالسَّحَابِ وَالْبُرْدِ وَالابْرَقَةِ وَالْقَضِيبِ قَالَ فَوَ الله مَا رَأَيْتُهَا غَيْرَ سَاعَتِي تِلْكَ يَعْنِي الابْرَقَةَ فَجِي‏ءَ بِشِقَّةٍ كَادَتْ تَخْطَفُ الابْصَارَ فَإِذَا هِيَ مِنْ أَبْرُقِ الْجَنَّةِ فَقَالَ يَا عَلِيُّ إِنَّ جَبْرَئِيلَ أَتَانِي بِهَا وَقَالَ يَا مُحَمَّدُ اجْعَلْهَا فِي حَلْقَةِ الدِّرْعِ وَاسْتَذْفِرْ بِهَا مَكَانَ الْمِنْطَقَةِ ثُمَّ دَعَا بِزَوْجَيْ نِعَالٍ عَرَبِيَّيْنِ جَمِيعاً أَحَدُهُمَا مَخْصُوفٌ وَالاخَرُ غَيْرُ مَخْصُوفٍ وَالْقَمِيصَيْنِ الْقَمِيصِ الَّذِي أُسْرِيَ بِهِ فِيهِ وَالْقَمِيصِ الَّذِي خَرَجَ فِيهِ يَوْمَ أُحُدٍ وَالْقَلانِسِ الثَّلاثِ قَلَنْسُوَةِ السَّفَرِ وَقَلَنْسُوَةِ الْعِيدَيْنِ وَالْجُمَعِ وَقَلَنْسُوَةٍ كَانَ يَلْبَسُهَا وَيَقْعُدُ مَعَ أَصْحَابِهِ ثُمَّ قَالَ يَا بِلالُ عَلَيَّ بِالْبَغْلَتَيْنِ الشَّهْبَاءِ وَالدُّلْدُلِ وَالنَّاقَتَيْنِ الْعَضْبَاءِ وَالْقَصْوَاءِ وَالْفَرَسَيْنِ الْجَنَاحِ كَانَتْ تُوقَفُ بِبَابِ الْمَسْجِدِ لِحَوَائِجِ رَسُولِ الله ﷺ يَبْعَثُ الرَّجُلَ فِي حَاجَتِهِ فَيَرْكَبُهُ فَيَرْكُضُهُ فِي حَاجَةِ رَسُولِ الله ﷺ وَحَيْزُومٍ وَهُوَ الَّذِي كَانَ يَقُولُ أَقْدِمْ حَيْزُومُ وَالْحِمَارِ عُفَيْرٍ فَقَالَ اقْبِضْهَا فِي حَيَاتِي فَذَكَرَ أَمِيرُ الْمُؤْمِنِينَ  أَنَّ أَوَّلَ شَيْ‏ءٍ مِنَ الدَّوَابِّ تُوُفِّيَ عُفَيْرٌ سَاعَةَ قُبِضَ رَسُولُ الله ﷺ قَطَعَ خِطَامَهُ ثُمَّ مَرَّ يَرْكُضُ حَتَّى أَتَى بِئْرَ بَنِي خَطْمَةَ بِقُبَا فَرَمَى بِنَفْسِهِ فِيهَا فَكَانَتْ قَبْرَهُ وَرُوِيَ أَنَّ أَمِيرَ الْمُؤْمِنِينَ  قَالَ إِنَّ ذَلِكَ الْحِمَارَ كَلَّمَ رَسُولَ الله ﷺ فَقَالَ بِأَبِي أَنْتَ وَأُمِّي إِنَّ أَبِي حَدَّثَنِي عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِيهِ أَنَّهُ كَانَ مَعَ نُوحٍ فِي السَّفِينَةِ فَقَامَ إِلَيْهِ نُوحٌ فَمَسَحَ عَلَى كَفَلِهِ ثُمَّ قَالَ يَخْرُجُ مِنْ صُلْبِ هَذَا الْحِمَارِ حِمَارٌ يَرْكَبُهُ سَيِّدُ النَّبِيِّينَ وَخَاتَمُهُمْ فَالْحَمْدُ لله الَّذِي جَعَلَنِي ذَلِكَ الْحِمَارَ.9. Muhammad ibn al-Husayn and Ali ibn Muhammad from Sahl ibn Ziyad from Muhammad ibn al-Walid Shabab al-Sayrafi from Aban ibn ‘Uthman from Abi ‘Abdillah  who has said the following “When the Messenger of Allah was about to die, he called to him al-‘Abbas Bbn ‘Abd al-Muttalib and Amir al-Mu’minin . He said to al-‘Abbas, “O uncle of Muhammad, will you inherit the legacy of Muhammad, pay his debts and fulfill his promises and commitments?” He responded, “O the Messenger of Allah, may Allah take my soul and the souls of my parents in service for your cause, I am an old man with a large number of dependents, with very little belongings while in generosity compete the winds.” He (the Messenger of Allah) said, “I will give them away to whoever would want them along with its rights and responsibilities.” Then he (s.a.) said, “O Ali, brother of Muhammad, will you pay off the liabilities of Muhammad, pay off his debt and take possession of his legacy?” He said, “Yes, May Allah take my soul and the soul of my parents in service for your cause, it is my responsibility and in my favor” He has said, “I looked at him and saw him take off even his ring from his finger and said to me: Wear this ring in my lifetime.” He (Ali) has said, “I looked at the ring when I wore it on my finger and wished to have it out of all his properties.” He then called upon Bilal loudly, “Bring me my helmet, the coat of arms, the flag, the Shirt, the Dhulfaqar (famous sword), al-Sahab, (the Turban) al-Burd, (the cloth), al-Abraqa, (the belt) and the staff.”Ali has said, “I had never before seen that belt. When it was brought its shine would almost take away one’s sight. It was of the belts of paradise.” He (the Messenger of Allah) then said, “O Ali, Jibril brought this for me and said, “O Muhammad, place it in the ring of the coat of arms and use it as a belt around your midsection. Then he asked that the two pairs of Arabian shoves be brought to him along with the shirt. One of them was already stitched and the other was not yet stitched. It was the shirt with which he take for the ’Isra’ (the night journey), the shirt while wearing it he came out on the day of ’Uhud. Three caps were brought, the cap used while on a journey, the cap used on the ‘Id days and the cap used on Fridays. Also the cap that was used during his meeting with his companions was brought to him.” Then he (the Messenger of Allah) said, “O Bilal, bring to us the two mules, the gray one and Dul dul and the two camels, al-Ghadba’ and al-Qaswa’ and the two horses.” Al-Janah would be kept near the door of the Mosque in case the Messenger of Allah needed it. Whenever he would need anything he would let a man ride on it to go for the task and the horse would run for the needs of the Messenger of Allah. Also Hayzum was brought to him, the donkey called ‘Ufayr were brought to him. He then said, “Take possession of these in my lifetime.” Amir al-Mu’minin has said, “The first one of the animals died was‘Ufayr who died at within the same hour that the Messenger of Allah died. He broke off his bound until he began to run until he came to the well of Bani Khatma in Qibaand threw himself into it and it became his grave.” It is narrated that Amir al-Mu’minin has said, “That donkey spoke to the Messenger of Allah saying: May Allah take my soul and the soul of my parents in service for your cause,my father related to me from his father from his grandfather from his father who lived with Noah in the Ark. Once Noah came to himand whipped him on his backand said: “From the descendents of this donkey there will a donkey on whose back the master and the last of the prophets will ride.” I thank Allah who has made me that donkey.Sahih al-Kafi Shaykh Baqir al-BehbudiMirʾāt al-ʿUqūl fī Sharḥ Akhbār Āl al-Rasūl (3/44) Allamah Baqir al-Majlisi (Al-Kāfi – Volume 1,Book 4, Chapter #38,The Armaments and Sacred Items belonging to the Holy Prophet that transferred to the Imam)",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 1146,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.375933"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/abu-talib-breastfeeds-muhammad.html",
    "title": "ABU TALIB BREASTFEEDS MUHAMMAD",
    "content_preview": "ABU TALIB BREASTFEEDS MUHAMMADThe following tradition is taken from one of the most authoritative collection of hadiths for Shia Muslims:Ḥadīth #27: 120727ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ سَعْدِ بْنِ عَبْدِ الله عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَلِيِّ بْنِ الْمُعَلَّى عَنْ أَخِيهِ مُحَمَّدٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله  قَالَ لَمَّا وُلِدَ النَّبِيُّ ﷺ مَكَثَ أَيَّاماً لَيْسَ لَهُ لَبَنٌ فَأَلْقَاهُ ",
    "full_content": "ABU TALIB BREASTFEEDS MUHAMMADThe following tradition is taken from one of the most authoritative collection of hadiths for Shia Muslims:Ḥadīth #27: 120727ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ سَعْدِ بْنِ عَبْدِ الله عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَلِيِّ بْنِ الْمُعَلَّى عَنْ أَخِيهِ مُحَمَّدٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله  قَالَ لَمَّا وُلِدَ النَّبِيُّ ﷺ مَكَثَ أَيَّاماً لَيْسَ لَهُ لَبَنٌ فَأَلْقَاهُ أَبُو طَالِبٍ عَلَى ثَدْيِ نَفْسِهِ فَأَنْزَلَ الله فِيهِ لَبَناً فَرَضَعَ مِنْهُ أَيَّاماً حَتَّى وَقَعَ أَبُو طَالِبٍ عَلَى حَلِيمَةَ السَّعْدِيَّةِ فَدَفَعَهُ إِلَيْهَا.27. Muhammad ibn Yahya has narrated from Sa‘d ibn ‘Abdillah from Ibrahim ibn Muhammad al-Thaqafi from Ali ibn al-Mu‘alla from his brother Muhammad from Durusta ibn Abu Mansur from Ali ibn Abu Hamza from Abu Basir from Abu ‘Abdallah who said: “When the Holy Prophet was born, he remained for days without milk. Abu Talib himself breastfed him and Allah sent milk through his nipples. He continued to be breasted by him for several days until Abu Talib found Halima al-Sa‘diyyah, so he gave him to her.”Sahih al-Kafi Shaykh Baqir al-BehbudiMirʾāt al-ʿUqūl fī Sharḥ Akhbār Āl al-Rasūl (5/252) Allamah Baqir al-Majlisi (Al-Kāfi – Volume 1,Book 4, Chapter #111,The Birth of The Holy Prophet and His Demise)",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muslim",
    "word_count": 206,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.329525"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/five-step-outline-proving-muhammad-is.html",
    "title": "Five Step Outline Proving Muhammad is Worshiped as a God",
    "content_preview": "Five Step Outline Proving Muhammad is Worshiped as a GodIn this relatively short post I am going present the evidence proving that Muhammad turned himself into another deity alongside his false god.1. Muhammad said.الدُّعَاءُ هُوَ الْعِبَادَةُ“Du’a(invocation)huwa(is)al-Ibadah(THEworship, e.g., the very heart/ essence of worship).”Ahmad, Abu Dawud, At-Tirmidhi, Ibn Majah, Al-`Hakimand others, collected this narration, which Al-`Hakim, Adh-Dhahabi and Al-Albani graded asSahih(sound, reliable, aut",
    "full_content": "Five Step Outline Proving Muhammad is Worshiped as a GodIn this relatively short post I am going present the evidence proving that Muhammad turned himself into another deity alongside his false god.1. Muhammad said.الدُّعَاءُ هُوَ الْعِبَادَةُ“Du’a(invocation)huwa(is)al-Ibadah(THEworship, e.g., the very heart/ essence of worship).”Ahmad, Abu Dawud, At-Tirmidhi, Ibn Majah, Al-`Hakimand others, collected this narration, which Al-`Hakim, Adh-Dhahabi and Al-Albani graded asSahih(sound, reliable, authentic).2. Worshipping others besides Allah isShirk(ascribing the unique characteristics and functions of Allah to a creature).Worship Allah and join none with Him in worship (Wa’abudoo Allaha wala tushrikoo), and do good to parents, kinsfolk, orphans,Al-Masakin(the poor), the neighbour who is near of kin, the neighbour who is a stranger, the companion by your side, the wayfarer (you meet), and those (slaves) whom your right hands possess. Verily, Allah does not like such as are proud and boastful; S. 4:36Verily,Allah forgives not that partners should be set up with him in worship, but He forgives except that (anything else) to whom He pleases, and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin. S. 4:48 – Cf. 4:116; 2:223.  Invoking others besides Allah involvesUluhiyyah/Ibadah(worship/service).And invoke (tad’u) not any otherilah(god) along with Allah,La ilaha illa Huwa(none has the right to be worshipped but He). Everything will perish save His Face. His is the Decision, and to Him you (all) shall be returned. S. 28:884. According to certain Sahih reports, Muhammad exhorted his followers to invoke/supplicate (du’a) him, which they did even after his death.3578.‘Uthman bin Hunaif narrated that a blind man came to the Prophet and said to him: “Supplicate to Allah to heal me.” He said: “If you wish, I will supplicate for you, and if you wish, you can be patient, for that is better for you.” He said: “Then supplicate to him.” He said: “So he ordered him to performWudu’and to make hisWudu’complete, and to supplicate with this supplication: ‘O Allah, I ask You and turn towards You by Your Prophet Muhammad, the Prophet of Mercy. Indeed, I have turned to my Lord, BY MEANS OF YOU, concerning this need of mine, so that it can be resolved, So Allah so accept HIS INTERCESSION for me (Allahumma Inni As’aluka WA MUHAMMADIN Nabi-Ir-Rahmati Tawajjahtu Bika Ila Rabbi Fi Hajati Hadhihi Lituqda Li, Allahumma FASHAFFI‘HU Fiya).’”(SAHIH)[He said]: ThisHadithisHasan SAHIH Gharib, we do not know of it except through this route, as a narration of Abu Ja‘far, and he is someone other than Al-Khatmi, [and Uthman bin Hunaif is the brother of Sahl bin Hunaif] (English Translation of Jami‘ At-Tirmidhi: Compiled by Imam Hafiz Abu ‘Eisa Mohammad Ibn ‘Eisa At-Tirmidhi, translated by Abu Khaliyl (USA), ahadith edited and referenced by Hafiz Tahir Zubair ‘Ali Za’i [Darussalam Publishers & Distributors, First Edition: November 2007], Volume 6, From Hadith No. 3291 to 3956, Various Narrations On The Chapters Of Supplications, Chapter 118, p. 283http://sunnah.com/tirmidhi/48/209; capital and underline emphasis mine)Here is a different version of this same hadith:1385.It was narrated from ‘Uthman bin Hunaif that a blind man came to the Prophet and said to him: “Pray to Allah to heal me.” He said: “If you wish to store your reward for the Hereafter, that is better, or if you wish, I will supplicate for you.” He said: “Supplicate.” He said: “So he told him to perform ablution and do it well, and to pray twoRak’ah, and to say this supplication: “Allahumma inni as’aluka wa atawajjahu ilaika BI-MUHAMMADIN NABIYYIR-RAHMA.YA MUHAMMADU inni qad tawajjahtu bika ila rabbi fi hajati hadhihi Lituqda. Allahumma FASHAFFI‘HU fiya(O Allah, I ask of You and I turn my face towards You BY VIRTUE OF THE INTERCESSION OF MUHAMMAD THE PROPHET OF MERCY. O MUHAMMAD, I have turned to my Lord BY VIRTUE OF YOUR INTERCESSION concerning this need of mine, so that it may be met. O Allah, accept HIS INTERCESSION concerning me)”.(SAHIH)(English Translation of Sunan Ibn Majah: Compiled by Imam Muhammad Bin Yazeed Ibn Majah Al-Qazwini, Ahadith edited and referenced by Hafiz Abu Tahir Zubair ‘Ali Za’i, translated by Nasiruddin al-Khattab (Canada), final review by Abu Khaliyl (USA) [Darussalam Publications and Distributors, First Edition: June 2007], Volume 2, From Hadith no. 803 to 1782, 5. The Chapters Of Establishing The Prayer And TheSunnahRegarding Them, Chapter 189. What Was Narrated Concerning Prayer At Times Of Need, pp. 329-330http://sunnah.com/urn/1287330; capital emphasis mine)THE HADITH OF THE MAN IN NEEDMoreover, Tabarani, in his “al-Mu’jam al saghir,” reports a hadith from ‘Uthman ibn Hunayf that a man repeatedly visited Uthman ibn Affan concerning something he needed, but Uthman paid no attention to him or his need. The man met Ibn Hunayf and complained to him about the matter – this being after the death (wisal) of the Prophet and after the caliphates of Abu Bakr and Umar – so Uthman ibn Hunayf, who was one of the Companions who collected hadiths and was learned in the religion of Allah, said: “Go to the place of ablution and perform ablution (wudu), then come to the mosque, perform two rak’as of prayer therein, and say:‘O Allah, I ask You and turn to Youthrough our Prophet Muhammad, the Prophet of mercy; O MUHAMMAD (Ya Muhammad), I turn through you to my Lord, that He may fulfill my need,’ and mention your need. Then come so that I can go with you [to the caliph Uthman].” So the man left and did as he had been told, then went to the door of Uthman ibn Affan, and the doorman came, took him by the hand, brought him to Uthman ibn Affan, and seated him next to him on a cushion. ‘Uthman asked, “What do you need?” and the man mentioned what he wanted, and Uthman accomplished it for him, then he said, “I hadn’t remembered your need until just now,” adding, “Whenever you need something, just mention it.” Then, the man departed, met Uthman ibn Hunayf, and said to him, “May Allah reward you! He didn’t see to my need or pay any attention to me until you spoke with him.” Uthman ibn Hunayf replied, “By Allah, I didn’t speak to him, but I have seen a blind man come to the Messenger of Allah and complain to him of the loss of his eyesight. The Prophet said, “Can you not bear it?’ and the man replied, ‘O Messenger of Allah, I do not have anyone to lead me around, and it is a great hardship for me.’ The Prophet told him, ‘Go to the place of ablution and perform ablution (wudu), then pray two rak’as of prayer and make the supplications.’” Ibn Hunayf went on, “By Allah, we didn’t part company or speak long before the man returned to us as if nothing had ever been wrong with him.”This is an explicit, unequivocal text from a prophetic Companion proving the legal validity of tawassul through the dead.The account has been classified as rigously authenticated (SAHIH) by Baihaqi, Mundhiri, and Haythami. (Nuh Ha Mim Keller,Tawassul: Supplicating Allah through an Intermediary(From Reliance of the Traveller)http://seekershub.org/ans-blog/2011/07/02/tawassul-supplicating-allah-through-an-intermediary/; bold and capital emphasis mine)5. Muhammad, therefore, turned himself into another god besides Allah by causing his followers to makedu’ato him, which is the heart of worship.",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 1189,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.282707"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/grave-worship-more-of-muhammads.html",
    "title": "Grave Worship: More of Muhammad’s Duplicity Exposed",
    "content_preview": "Grave Worship: More of Muhammad’s Duplicity ExposedMuhammad is reported to have cursed the Jews and Christians for turning the graves of the prophets and righteous persons as places of worship, and warned his followers from doing the same with his grave:Narrated ‘Aisha and ‘Abdullah bin ‘Abbas: When the last moment of the life of Allah’s Apostle came he started putting his ‘Khamisa’ on his face and when he felt hot and short of breath he took it off his face and said, “May Allah curse the Jews a",
    "full_content": "Grave Worship: More of Muhammad’s Duplicity ExposedMuhammad is reported to have cursed the Jews and Christians for turning the graves of the prophets and righteous persons as places of worship, and warned his followers from doing the same with his grave:Narrated ‘Aisha and ‘Abdullah bin ‘Abbas: When the last moment of the life of Allah’s Apostle came he started putting his ‘Khamisa’ on his face and when he felt hot and short of breath he took it off his face and said, “May Allah curse the Jews and Christiansfor they built the places of worship at the graves of their Prophets.” The Prophet was warning (Muslims) of what those had done. (Sahih al-Bukhari, Volume 1, Book 8, Number 427https://www.searchtruth.com/book_display.php?book=8&translator=1&start=0&number=426)‘A’isha reported: The Messenger of Allah said during his illness from which he never recovered:Allah cursed the Jews and the Christiansthat they took the graves of their prophets as mosques. She (‘A’isha) reported: Had it not been so, his (Prophet’s) grave would have been in an open place, but it could not be due to the fear that it may not be taken as a mosque. (Sahih Muslim, Book 004, Number 1079https://www.searchtruth.com/book_display.php?book=004&translator=2&start=0&number=1038)21 The Book of Funerals(106) Chapter: Taking Graves as MasjidsIt was narrated from Abu Hurairah that the Messenger of Allah said: “May Allah curse the Jews and Christianswho took the graves of their prophets as Masjids.” (Sahih)Chapter 107. It Is Disliked to Walk Between Grave Wearing Sibtiyah SandalsReference: Sunan an-Nasa’i 2047In-book reference: Book 21, Hadith 231English translation: Vol. 3, Book 21, Hadith 2049 (sunnah.comhttps://sunnah.com/nasai:2047)4 Prayer(8a) Chapter: Mosques and places of Prayer – Section 1A’isha told of God’s Messenger as saying in his illness from which he did not recover, “God curse the Jews and Christians!They have taken the graves of their prophets as mosques.” (Bukhari and Muslim.)Reference: Mishkat al-Masabih 712In-book reference: Book 4, Hadith 142 (sunnah.comhttps://sunnah.com/mishkat:712)4 Prayer(8c) Chapter: Mosques and places of Prayer – Section 3‘Ata’ b. Yasar reported God’s Messenger as saying, “O God, do not let my grave become an idol which is worshipped. God’s anger is severe against people who take the graves of their prophets as mosques.”Malik transmitted it in mursal form.Reference: Mishkat al-Masabih 750In-book reference: Book 4, Hadith 178 (sunnah.comhttps://sunnah.com/mishkat:750)4 Prayer(17b) Chapter: Blessing on the Prophet, and its Excellence – Section 2He reported that he had heard God’s Messenger say, “Do not turn your houses into graves,*and do not make my grave a place to gather as for visitation, but invoke blessings on me, for your blessing will reach me wherever you are.”*This is most probably a figurative expressive indicating that a house in which prayer is not offered is like a grave, as God is not worshipped there.Nasa’i transmitted it.Reference: Mishkat al-Masabih 926In-book reference: Book 4, Hadith 349 (sunnah.comhttps://sunnah.com/mishkat:926)Herein lies Muhammad’s duplicity and hypocrisy.According to the Quran, the supposed resting place of the fictional sleepers of the cave was allegedly turned into a masjid or a place of worship, seemingly with Allah’s express approval:Or, do you think that the Fellows of the Cave and the Inscription were of Our wonderful signs? When the youths sought refuge in the cave, they said: Our Lord! grant us mercy from Thee, and provide for us a right course in our affair. So We prevented them from hearing in the cave for a number of years. Then We raised them up that We might know which of the two parties was best able to compute the time for which they remained. We relate to you their story with the truth; surely they were youths who believed in their Lord and We increased them in guidance. And We strengthened their hearts with patience, when they stood up and said: Our Lord is the Lord of the heavens and the earth; we will by no means call upon any god besides Him, for then indeed we should have said an extravagant thing. These our people have taken gods besides Him; why do they not produce any clear authority in their support? Who is then more unjust than he who forges a lie against Allah? And when you forsake them and what they worship save Allah, betake yourselves for refuge to the cave; your Lord will extend to you largely of His mercy and provide for you a profitable course in your affair. And you might see the sun when it rose, decline from their cave towards the right hand, and when it set, leave them behind on the left while they were in a wide space thereof. This is of the signs of Allah; whomsoever Allah guides, he is the rightly guided one, and whomsoever He causes to err, you shall not find for him any friend to lead (him) aright. And you might think them awake while they were asleep and We turned them about to the right and to the left, while their dog (lay) outstretching its paws at the entrance; if you looked at them you would certainly turn back from them in flight, and you would certainly be filled with awe because of them. And thus did We rouse them that they might question each other. A speaker among them said: How long have you tarried? They said: We have tarried for a day or a part of a day. (Others) said: Your Lord knows best how long you have tarried. Now send one of you with this silver (coin) of yours to the city, then let him see which of them has purest food, so let him bring you provision from it, and let him behave with gentleness, and by no means make your case known to any one: For surely if they prevail against you they would stone you to death or force you back to their religion, and then you will never succeed. And thus did We make (men) to get knowledge of them that they might know that Allah’s promise is true and that as for the hour there is no doubt about it. When they disputed among themselves about their affair and said:Erect an edifice over them— their Lord best knows them. Those who prevailed in their affair said:We will certainly raise a masjid over them. (Some) say: (They are) three, the fourth of them being their dog; and (others) say: Five, the sixth of them being their dog, making conjectures at what is unknown; and (others yet) say: Seven, and the eighth of them is their dog. Say: My Lord best knows their number, none knows them but a few; therefore contend not in the matter of them but with an outward contention, and do not question concerning them any of them. S. 18:9-22 ShakirNote how the following version translates the relevant part:Thus did We make their case known to the people, that they might know that the promise of God is true, and that there can be no doubt about the Hour of Judgment. Behold, they dispute among themselves as to their affair. (Some) said, “Construct a building over them”: Their Lord knows best about them: those who prevailed over their affair said, “Let us surely build a place of worship over them (alayhim masjidan).” S. 18:21 Y. AliAnd here’s the explanation given by some of Islam’s greatest expositors:And so just as We aroused them it was that We disclosed them to their people and the believers that they that is their people might know that God’s promise of resurrection is true by virtue of the fact that One Who has the power to make them sleep for such a long period of time or sustain them in that state without nourishment also has the power to resurrect the dead; and that as for the Hour there is no doubt no uncertainty concerning it. Behold idh adverbially qualifies a‘tharnā ‘We disclosed’ they were disputing that is the believers and the disbelievers among themselves their affair the affair of the youths with regard to building something around them as a monument; so they the disbelievers said ‘Build over them that is around them a building to cover them up; their Lord knows them best.’ Those who prevailed regarding their affair the affair of the youths namely the believers ‘We will verily set up over them around them a place of worship’for prayers to be performed therein. And this indeed took place at the entrance of the cave. (Tafsir al-Jalalaynhttps://www.altafsir.com/Tafasir.asp?tMadhNo=0&tTafsirNo=74&tSoraNo=18&tAyahNo=21&tDisplay=yes&UserProfile=0&LanguageId=2; bold emphasis mine)(those who won their point said: “We verily, shall build a place of worship over them.”) Those who said this were the people of power and influence, but were they good people or notthere is some debate on this point, because the Prophet said…(Allah has cursed the Jews and the Christians who took the graves of their Prophets and righteous people as places of worship) Warning against what they did. We have reported about the Commander of the faithful `Umar bin Al-Khattab that when he found the grave of Danyal (Daniel) in Iraq during his period of rule, he gave orders that news of this grave should be withheld from the people, and that the inscription containing mention of battles etc., that they found there should be buried. (Tafsir Ibn Kathirhttps://www.alim.org/quran/tafsir/ibn-kathir/surah/18/21; bold emphasis mine)Ibn Kathir’s admission that there was some debate in respect to whether the people in this Islamic Rip Van Winkle story did something good by turning the resting place of these so-called sleepers into amasjidsince this contradicts Muhammad’s condemnation of such a practice illustrates the Muhammadan conundrum. It perfectly demonstrates Muhammad’s blatant inconsistency by providing further substantiation of how he would often do or say things in direct conflict with the Quran. After all, there is nothing in this fable suggesting that the Muslim deity disapproved of what the people did. It is merely the scholars’ realizing how their prophet’s sunna directly conflicts with the statements of his own book that led them to assume such in order to harmonize this blatant contradiction.It gets much worse.Muhammad made it obligatory for his followers to pray for him and even greet him in their prayers after his death:Abu Hurayra said that the Messenger of Allah said, “Whenever anyone greets me with peace, Allah will return my soul to me so that I can return the greeting.”Abu Bakr ibn Abi Shayba mentions that Abu Hurayra said that the Messenger of Allah said, “I WILL HEAR whoever blesses me at my grave. If someone is far away and blesses me, that is also conveyed to me.”…Ibn ‘Umar said, “Do a lot of prayer on your Prophet everyJumu’a. It is brought to him from you everyJumu’a.” One version has, “None of you blesses me but THAT HIS PRAYER IS SHOWN TO ME when he finishes it.”Al-Hasan ibn ‘Ali said that the Prophet said, “Bless me wherever you are. YOUR PRAYER will reach me.”One of them mentioned that the name of someone who blesses the Prophet IS SHOWN to the Prophet when he does it.Al-Hasan ibn ‘Ali said, “When you enter the mosque, greet the Prophet. The Messenger of Allah said, ‘Do not make my house a place of‘Idand do not make your houses graves. Bless me wherever you are. YOUR PRAYER will reach me wherever you are.’”…Sulayman ibn Suhyam said that he saw the Prophet in a dream and asked him, “Messenger ofAllah, do you recognise the greeting of those who come to you?” He replied, “YES, AND I ANSWER THEM.” (Qadi ‘Iyad Ibn Musa al-Yahsubi,Kitab Ash-shifa bi ta’rif huquq al-Mustafa (Healing by the recognition of the Rights of the Chosen One), translated by Aisha Abdarrahman Bewley English [Madinah Press, Inverness, Scotland, U.K., third reprint 1991, paperback], pp. 262-263; capital and underline emphasis mine)Notice how Muhammad himself classified the invocations and greetings that his followers were to offer to him assupplicationsandprayers. Muhammad is, therefore, personally responsible for the blatant idolatry that Muslims commit all over the world due to their invoking and speaking to a dead false prophet.And this notion of Muhammad being able to see the prayers of his followers even after his death is substantiated within the Quran itself:They will excuse themselves to you when you go back to them. Say: Urge no excuse, by no means will we believe you; indeed Allah has informed us of matters relating to you;and now Allah and His Apostle WILL SEE your doings (wa’sayara Allahu amalakum wa’rasooluhu), then you shall be brought back to the Knower of the unseen and the seen, then He will inform you of what you did. S. 9:94 ShakirThe word for “will see” (sayara) is a 3rd person masculine singular imperfect verb, and is in the subjunctive mood. The verse literally reads, “” Allah and his apostle,HEwill see.”Muhammad, therefore, made Allah’s seeing identical with his own sight, which in turn makes him omniscient and omnipresent like his god!To make matters much worse and more blasphemous than they already are, the Quran depicts Muhammad as being able to cleanse and purify his followers from their sins!Take alms out of their property,you would cleanse them and purify them thereby, and pray for them;surely your prayer is a relief to them; and Allah is Hearing, Knowing. S. 9:103 ShakirThat’s not all.Some of Islam’s most notable scholars have used Q. 4:64 to argue that Muslims can actually visit their dead prophet’s grave in order to personally ask him for his intercession. And this is exactly what Muhammadans have been doing since the demise of Muhammad:Although, this verse (64) was revealed in the background of a particular incident relating to hypocrites, yet its words yield a general ruling which stipulates that anyone who presents himself before the Holy Prophet and he prays for his forgiveness, he will be definitely forgiven. And ‘the presence before the Prophet,’ as it would have been during his blessed life in this mortal world, HOLDS THE SAME EFFECT EVEN TODAY as the visit to the sacred precincts of the Mosque of the Prophet and the act of ‘presenting’ oneself BEFORE THE BLESSED RESIDENT OF THE SANCTIFIED MAUSOLEUM FALLS WITHIN THE JURISDICTION OF THIS RULE.Sayyidna ‘Ali has said: “Three days after we all had finished with the burial of the Messenger of Allah a villager came and fell down close to the blessed grave. Weeping bitterly, he referred to this particular verse of the Qur’an AND ADDRESSING HIMSELF TO THE BLESSED GRAVE, he said: ‘Allah Almighty has promised in this verse that a sinner, if he presented himself before theRasulof Allah, and theRasulelects to pray for his forgiveness, then he will forgive him. Therefore, here I am, presenting myself BEFORE YOU so that I may be blessed with YOUR prayer for my forgiveness.’ People personally present there at that time say that, in response to the pleading of the villager, a voice coming out from the sanctified mausoleum rang around with the words… You have been forgiven.” (al-Bahr al-Muhit) (Mufti Shafi Usmani,Maariful Quran, Volume 2, p. 486https://www.kalamullah.com/Books/Maariful%20Quran/English-MaarifulQuran-MuftiShafiUsmaniRA-Vol-2-Page-451-505.pdf; capital emphasis mine)And:“Allah is instructing the sinners when they commit a sin to come to the messenger of Allah and ask forgiveness in his presence and then they ask him to request forgiveness. And certainly if they did that, Allah would relent towards them and have mercy on them, and for that reason He said “they would have found Allah Oft-Returning, Merciful.”And Shaykh Mansur as-Sabbagh recollected in his book “The Perfections” (ash-Shama’il) the well-known (famous) transmission from ‘Utbi:“I was sitting by the grave of the Prophetand a Bedouin came and said: ‘Peace be upon you O Prophet of Allah. I heard Allah say: “And if they had come to thee when they had wronged their souls, and asked forgiveness of Allah, and if the Messenger had also asked forgiveness for them, they would have surely found Allah Oft-Returning with compassion and Merciful.”And I came to you asking forgiveness for my sin, taking you as intercessor to my Lord.’“Then he started reciting verses: ‘O You best of those whose bones are buried in al-Qa’a from the sweet scents of those bones the whole area of al-Qa’a and Akamu became perfumed.My self I sacrifice to the grave that you live in it is purity and in it is incredible generosity.’“Then the Bedouin departed and sleep overcame me.And I saw the Prophet in my sleep and he said: ‘Ya ‘Utbi, follow the Bedouin and give him the glad tidings that Allah has forgiven him.’” (Ibn Kathir,Tafsir of Qur’an al-Adheem[Dar al-Fikr, Beirut, 1992/1412], Volume 1, p. 643)It is apparent why Muslim scholars permitted such an idolatrous and blasphemous practice,According to the verse in question, Muhammad’s intercession is essential and necessary to obtain forgiveness:And We did not send any apostle but that he should be obeyed by Allah’s permission; and had they, when they were unjust to themselves,come to youand asked forgiveness of Allahand the Apostle had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful. S. 4:64 ShakirSince the Quran is supposed to be a source of guidance for all peoples at all times, not just at the time of Muhammad, this mean that passages such as the foregoing must still be applicable for all generations of Muslims. However, Muhammad is dead and the applicability of these injunctions are dependent on his followers being able to access his presence in order to benefit from his intercession.This leaves Muslims with one of two choices.Either these texts which require making contact with Muhammad are obsolete now that he is dead, which in turn makes the Quran an incoherent and impractical “revelation” seeing that much of its contents have become useless and unnecessary after Muhammad’s death. Or Muslims are still required to act upon these verses by going to the grave of Muhammad in order to contact a dead man whom they think is somehow still alive in his tomb.As the readers can see, some Islamic scholars chose the second view, which resulted in their doing the very thing that Muhammad cursed the Jews and Christians for doing. I.e., as a direct result of the teachings of the Quran and sunnah, Muslims have turned their prophet’s grave into a place of worship where they come and pray to a dead man to help save them from their sins!As if this weren’t shocking enough, certain Muslims would even face Muhammad’s grave rather than the Kabah whenever they would supplicate!It is just as necessary to have esteem and respect for the Prophet AFTER HIS DEATH AS IT WERE WHEN HE WAS ALIVE. This means to show it whenever the Prophet, hishadithorsunnaare mentioned, when anyone hears his name or anything about his life or how his family and relatives behaved. It includes respect for the People of his House (ah al-bayt) and his Companions…Abu Humayd said, “Abu Ja’far, theAmir al-Mu’minin, had a dispute with Malik in the Prophet’s mosque. Malik said to him, ‘Amir al-Mu’minin, do not raise your voice in this mosque. Allah taught the people how to behave by saying, ‘Do not raise your voices above the Prophet’(49:2) He praises people with the words,“Those who lower their voices in the presence of the Messenger of Allah.”(49:3) He censures people, saying,“Those who call you…”Respect for him WHEN HE IS DEAD is the same as respect for him when he was alive.”“Abu Ja’far was humbled by this. He asked Malik, ‘Abu Abdullah, do you faceqiblawhen you supplicate or do you face the Messenger of Allah?’ He replied, ‘Why would you turn your face from him when he is YOUR MEANS and the means of your father, Adam, to Allah on the Day of Rising? I face him and ASK HIM to intercede and Allah will grant his intercession. Allah says,“If, when you wronged yourselves, they had come to you.”’” (4:64) (Qadi ‘Iyad, pp. 237-238; capital and underline emphasis mine)With the foregoing in view, could it be any more obvious that Muhammad was an inconsistent hypocrite and idol-maker that did the very thing he condemned others for doing, and who turned himself into a god by causing his followers to look to him as an object of their worship?",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 3321,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.230759"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/proof-that-muslims-are-muhammadans.html",
    "title": "PROOF THAT MUSLIMS ARE MUHAMMADANS",
    "content_preview": "PROOF THAT MUSLIMS ARE MUHAMMADANSIn this short post I am going present additional evidence that Islam is really Muhammadanism seeing that it has elevated Muhammad to godlike status, requiring its adherents to blindly follow him and love him unconditionally, just as much as they love the Muslim idol:Say: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight …are dearer",
    "full_content": "PROOF THAT MUSLIMS ARE MUHAMMADANSIn this short post I am going present additional evidence that Islam is really Muhammadanism seeing that it has elevated Muhammad to godlike status, requiring its adherents to blindly follow him and love him unconditionally, just as much as they love the Muslim idol:Say: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight …are dearer to you than AllahANDHis Messenger, and striving hard and fighting in His Causethen wait until Allah brings about His Decision (torment). And Allah guides not the people who areAl-Fasiqun(the rebellious, disobedient to Allah). S. 9:24 Hilali-KhanYou (O Muhammad) will not find any people who believe in Allah and the Last Day, making friendship with thosewho oppose AllahANDHis Messenger (Muhammad), even though they were their fathers, or their sons, or their brothers, or their kindred (people). For such He has written Faith in their hearts, and strengthened them withRuh(proofs, light and true guidance) from Himself. And We will admit them to Gardens (Paradise) under which rivers flow, to dwell therein (forever). Allah is pleased with them, and they with Him. They are the Party of Allah. Verily, it is the Party of Allah that will be the successful. S. 58:22 Hilali-KhanIslam further commands Muslims to perfectly submit to Muhammad to the same extent and degree that they are supposed to submit to Muhammad’s god:But no, by your Lord, they can have no Faith, until they make you (O Muhammad) judge in all disputes between them, and find in themselves no resistance against your decisions,and accept (them) with full submission. S. 4:65 Hilali-KhanThis is why obedience to Muhammad is the same as obeying Allah, and why a person must revert back to Muhammad’s decisions whenever scholars/leaders disagree:These are the limits (set by) Allah (or ordainments as regards laws of inheritance),and whosoever obeys AllahANDHis Messenger (Muhammad)will be admitted to Gardens under which rivers flow (in Paradise), to abide therein, and that will be the great success.And whosoever disobeys AllahANDHis Messenger (Muhammad), and transgresses His limits, He will cast him into the Fire, to abide therein; and he shall have a disgraceful torment. S. 4:13-14 Hilali-KhanO you who believe! Obey Allah and obey the Messenger (Muhammad), and those of you (Muslims) who are in authority. (And) if you differ in anything amongst yourselves,refer it to Allah and His Messenger, if you believe in Allah and in the Last Day. That is better and more suitable for final determination. S. 4:59 Hilali-KhanHe who obeys the Messenger (Muhammad),has indeed obeyed Allah, but he who turns away, then we have not sent you (O Muhammad) as a watcher over them. S. 4:80 Hilali-KhanIt is not for a believer, man or woman, when AllahANDHis Messenger have decreed a matterthat they should have any option in their decision. And whoever disobeys Allah and His Messenger, he has indeed strayed in a plain error. S. 33:36 Hilali-KhanIn fact, obedience to Muhammad is so crucial for Muslim salvation that Allah absolutely refuses to love anyone who doesn’t obey his “prophet,” since he only loves those who surrender to Muhammad’s will:Say (O Muhammad to mankind): “If you (really) love Allah then follow me(i.e. accept Islamic Monotheism, follow the Qur’an and the Sunnah),Allah will love you and forgive you of your sins. And Allah is Oft-Forgiving, Most Merciful.” Say (O Muhammad): “Obey Allah and the Messenger (Muhammad).” But if they turn away,then Allah does not like the disbelievers. S. 3:31-32 Hilali-KhanThe Muslim scripture makes it therefore explicitly clear that Muhammad has absolute, final authority and say-so over the lives of Muslims, since he pretty much owns them.Little wonder that Muslims are named “the followers of Muhammad” in the hadiths:Narrated Salim: I heard Um Ad-Darda’ saying, “Abu Ad-Darda’ entered the house in an angry mood. I said to him. ‘What makes you angry?’ He replied, ‘By Allah! I do not findthe followers of Muhammaddoing those good things (which they used to do before) except the offering of congregational prayer.” (This happened in the last days of Abu Ad-Darda’ during the rule of ‘Uthman). (Sahih al-Bukhari, Volume 1, Book 11, Number 622https://www.searchtruth.com/book_display.php?book=11&translator=1&start=0&number=622)Narrated ‘Aisha: Allah’s Apostle said, “Ofollowers of Muhammad! There is none, who has a greater sense ofGhira(self-respect) than Allah, so He has forbidden that His slave commits illegal sexual intercourse or His slave girl commits illegal sexual intercourse. Ofollowers of Muhammad! If you but knew what I know, you would laugh less and weep more!” (Sahih al-Bukhari, Volume 7, Book 62, Number 148https://www.searchtruth.com/book_display.php?book=62&translator=1&start=0&number=148)In light of the foregoing, I now furnish another explicit instance of Muslims deifying Muhammad by granting him the same devotion and service, which the Quran attributes to Allah.Note what these ahadith state in regards to Abu Bakr’s love and dedication to Muhammad:The Book of the Sunnah(11a) Chapter: The Virtue of Abu Bakr SiddiqIt was narrated that Abu Hurairah said:“The Messenger of Allah said: ‘The wealth of none of you has benefited me as much as the wealth of Abu Bakr.'” Abu Bakr wept and said: ‘O Messenger of Allah,I and my wealth areONLYfor you, O Messenger of Allah.'”Grade: Da’if(Darussalam)Reference: Sunan Ibn Majah 94In-book reference: Introduction, Hadith 94English translation: Vol. 1, Book 1, Hadith 94 (sunnah.comhttps://sunnah.com/ibnmajah:94)And:Abu Huraira reported: The Messenger of Allah said, “The wealth of no one has benefited me as much as the wealth of Abu Bakr.” Abu Bakr wept and he said, “My life and my wealth areONLYfor you, O Messenger of Allah.”Source: Musnad Aḥmad 7397Grade:Sahih(authentic) according to Ahmad ShakirAbu Bakr does for Muhammad what the Muslim scripture commands Muhammadans do for Allah, namely, devote their entire lives and wealth for their idol:Say: Lo! my worship and my sacrifice and my living and my dying are for Allah, Lord of the Worlds. S. 6:162 PickthallIn case the readers are unaware who Abu Bakr was, he is the one who gave his 6 or 7-year-old daughter Aisha to a 51-year-old Muhammad, who then physically consummated the marriage three years later when the minor had just turned 9!Aisha said: The Apostle of Allah married me when I was seven years old. The narrator Sulaiman said: Or six years.He had intercourse with mewhen I was nine years old.Grade: Sahih(Al-Albani) (Sunan Abu Dawud, Book 11, Number 2116https://sunnah.com/abudawud:2121)26 The Book of Marriage(29) Chapter: A Man Marrying Off HIS YOUNG DAUGHTERIt was narrated that ‘Aishah said: “The Messenger of Allah married me when I was seven years old, and he consummated the marriage with me when I was nine.”Grade: SAHIH(Darussalam)Reference: Sunan an-Nasa’i 3256In-book reference: Book 26, Hadith 61English translation: Vol. 4, Book 26, Hadith 3258 (sunnah.comhttps://sunnah.com/nasai:3256; capital emphasis mine)Hence, not only did Abu Bakr give his premature, prepubescent child to a 54-year-old man to sexually ravish, someone old enough to be Aisha’s grandfather, during a time when the premature girl was still playing on swings and with her dolls,Narrated Aisha:The Prophet engaged me when I was a girl of six (years). We went to Medina and stayed at the home of Bani-al-Harith bin Khazraj. Then I got ill and my hair fell down. Later on my hair grew (again) and my mother, Um Ruman, came to mewhile I was playing in a swing with some of my girl friends. She called me, and I went to her, not knowing what she wanted to do to me. She caught me by the hand and made me stand at the door of the house. I was breathless then, and when my breathing became all right, she took some water and rubbed my face and head with it. Then she took me into the house. There in the house I saw some Ansari women who said, “Best wishes and Allah’s Blessing and a good luck.” Then she entrusted me to them and they prepared me (for the marriage). Unexpectedly Allah’s Apostle came to me in the forenoon and my mother handed me over to him,and at that time I was a girl of nine years of age. (Sahih Al-Bukhari, Volume 5, Book 58, Number 234https://www.searchtruth.com/book_display.php?book=58&translator=1&start=0&number=234)‘A’isha reported that Allah’s Apostle married her when she was seven years old, and he was taken to his house as a bridewhen she was nine, and her dolls were with her; and when he (the Holy Prophet) diedshe was eighteen years old. (Sahih Muslim, Book 008, Number 3311https://www.searchtruth.com/book_display.php?book=008&translator=2&start=0&number=3311)He also sacrificed his whole life and wealth for this same man.In other words, Abu Bakr gave Muhammad the exact same service and devotion which the Quran exhorts Muslims to render unto Allah.Putting it simply, Abu Bakr took Muhammad as a god to be worshiped alongside Allah, with the express approval of the Islamic deity and his so-called messenger!",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 1445,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.178581"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/more-proof-that-muslims-worship-muhammad.html",
    "title": "MORE PROOF THAT MUSLIMS WORSHIP MUHAMMAD",
    "content_preview": "MORE PROOF THAT MUSLIMS WORSHIP MUHAMMADIn this short post I will provide additional evidence from theahadiththat Muslims are in reality Muhammadans that worship Muhammad, a man who was an imperfect, fallible, immoral sexual deviant and false prophet.The Quran exhorts Muhammad and his followers to devote their whole lives, wealth and sacrifices entirely to Allah:Say (O Muhammad): “Verily, mySalat(prayer),my sacrifice,my living, and my dying are for Allah, the Lord of the‘Alamin(mankind, jinns an",
    "full_content": "MORE PROOF THAT MUSLIMS WORSHIP MUHAMMADIn this short post I will provide additional evidence from theahadiththat Muslims are in reality Muhammadans that worship Muhammad, a man who was an imperfect, fallible, immoral sexual deviant and false prophet.The Quran exhorts Muhammad and his followers to devote their whole lives, wealth and sacrifices entirely to Allah:Say (O Muhammad): “Verily, mySalat(prayer),my sacrifice,my living, and my dying are for Allah, the Lord of the‘Alamin(mankind, jinns and all that exists). S. 6:162 Hilali-KhanMarch forth, whether you are light (being healthy, young and wealthy) or heavy (being ill, old and poor),strive hard with your wealth and your lives in the Cause of Allah. This is better for you, if you but knew. S. 9:41 Hilali-KhanAnd who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam? And Allah guides not the people who areZalimun(polytheists, wrong-doers and disbelievers) folk. They intend to put out the Light of Allah (i.e. the religion of Islam, this Qur’an, and Prophet Muhammad) with their mouths. But Allah will complete His Light even though the disbelievers hate (it). He it is Who has sent His Messenger (Muhammad) with guidance and the religion of truth (Islamic Monotheism) to make it victorious over all (other) religions even though theMushrikun(polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammed) hate (it). O You who believe! Shall I guide you to a commerce that will save you from a painful torment. That you believe in Allah and His Messenger (Muhammad),and that you strive hard and fight in the Cause of Allah with your wealth and your lives, that will be better for you, if you but know! (If you do so) He will forgive you your sins, and admit you into Gardens under which rivers flow, and pleasant dwelling in Gardens of‘AdnEternity [‘Adn(Edn) Paradise], that is indeed the great success. And also (He will give you) another (blessing) which you love, help from Allah (against your enemies) and a near victory. And give glad tidings (O Muhammad) to the believers. S. 61:7-11 Hilali-KhanAnd yet according to the hadiths, Muhammad’s best friend and father-in-law, the very man who married off his 9 year old premature, prepubescent manner to his 54 year old prophet,‘A’isha reported:Allah’s Messenger married me when I was six years old,and I was admitted to his house at the age of nine. She further said: We went to Medina and I had an attack of fever for a month, and my hair had come down to the earlobes. Umm Ruman (my mother) came to meand I was at that time on a swing along with my playmates. She called me loudly and I went to her and I did not know what she had wanted of me. She took hold of my hand and took me to the door,and I was saying: Ha, ha (as if I was gasping), until the agitation of my heart was over. She took me to a house, where had gathered the women of the Ansar. They all blessed me and wished me good luck and said: May you have share in good. She (my mother) entrusted me to them. They washed my head and embellished me and nothing frightened me. Allah’s Messenger came there in the morning,and I was entrusted to him. (Sahih Muslim,Book 008, Number 3309https://www.searchtruth.com/book_display.php?book=008&number=3309&start=0&translator=2)‘A’isha reported that Allah’s Apostle married her when she was seven years old,and she was taken to his house as a bride when she was nine, and her dolls were with her; and when he (the Holy Prophet) diedshe was eighteen years old. (Sahih Muslim, Book 008, Number 3311)Aisha said: The Apostle of Allah married me when I was seven years old. The narrator Sulaiman said: Or six years.He had intercourse with me when I was nine years old. (Sunan Abu Dawud, Book 11, Number 2116https://sunnah.com/abudawud/12/76)Yunus b. Bukayr stated, from Hisham b. ‘Urwa, from his father who said, “The Messenger of God married ‘A’isha three years after (the death of) Khadija. At that time (of the contract) ‘A’isha had been a girl of six. When he married her she was nine. The Messenger of God died when ‘A’isha was a girl of eighteen.”This tradition is consideredgharib(unique in this line).Al-Bukhari had related, from ‘Ubayd b. Isma‘il, from Abu Usama, from Hisham b. ‘Urwa, from his father, who said, “Khadija died three years before the emigration of the Prophet. He allowed a couple of years or so to pass after that, and then he contracted marriage with ‘A’isha when she was six, thereafter consummating marriage with her when she was nine years old.”What ‘Urwah stated here ismursal, incomplete, as we mentioned above, but in its content it must be judged asmuttasil, uninterrupted.His statement, “He contracted marriage with ‘A’isha when she was six, thereafter consummating marriage with her when she was nine”IS NOT DISPUTED BY ANYONE, and is well established in thesahihcollections of traditions and elsewhere. (Ibn Kathir,The Life of the Prophet Muhammad (Al-Sira al-Nabawiyya), translated by professor Trevor Le Gassick, reviewed by Dr. Muneer Fareed [Garnet Publishing Limited, 8 Southern Court, south Street Reading RG1 4QS, UK; The Center for Muslim Contribution to Civilization, first paperback edition, 2000], Volume II, pp. 93-94; bold and capital emphasis mine)And who was the first caliph, Abu Bakr, is reported to have stated that he devoted his entire life and wealth for Muhammad alone:The Book of the Sunnah(11a) Chapter: The Virtue of Abu Bakr SiddiqIt was narrated that Abu Hurairah said:“The Messenger of Allah said: ‘The wealth of none of you has benefited me as much as the wealth of Abu Bakr.'” Abu Bakr wept and said: ‘O Messenger of Allah, I and my wealth are ONLY for you, O Messenger of Allah.'”Grade: Da’if(Darussalam)Reference: Sunan Ibn Majah 94In-book reference: Introduction, Hadith 94English translation: Vol. 1, Book 1, Hadith 94 (sunnah.comhttps://sunnah.com/ibnmajah:94; capital and italicized emphasis mine)And:Abu Huraira reported: The Messenger of Allah said, “The wealth of no one has benefited me as much as the wealth of Abu Bakr.” Abu Bakr wept and he said, “My life and my wealth are ONLY for you, O Messenger of Allah.”Source: Musnad Aḥmad 7397Grade:Sahih(authentic) according to Ahmad ShakirThe foregoing proves that Muhammad turned himself into another deity alongside his god, since he expected Muslims to love him just as much as Allah, and to perfectly submit to him as they submit to the Islamic deity:Say (O Muhammad to mankind): “If you (really) love Allah then follow me (i.e. accept Islamic Monotheism, follow the Qur’an and the Sunnah),Allah will love you and forgive you of your sins. And Allah is Oft-Forgiving, Most Merciful.” Say (O Muhammad): “Obey Allah and the Messenger (Muhammad).” But if they turn away,then Allah does not like the disbelievers. S. 3:31-32 Hilali-KhanBut no, by your Lord, they can have no Faith, until they make you (O Muhammad) judge in all disputes between them, and find in themselvesno resistance against your decisions, and accept (them) with full submission. S. 4:65 Hilali-KhanHe who obeys the Messenger (Muhammad),has indeed obeyed Allah, but he who turns away, then we have not sent you (O Muhammad) as a watcher over them. S. 4:80 Hilali-KhanSay: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight …are dearer to you than AllahANDHis Messenger, and striving hard and fighting in His Causethen wait until Allah brings about His Decision (torment). And Allah guides not the people who areAl-Fasiqun(the rebellious, disobedient to Allah). S. 9:24 Hilali-KhanThis proves that Islam is a blasphemously idolatrous religion, which elevates a wicked, vile, immoral false prophet to the status of godhood.",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muslim",
    "word_count": 1284,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.128749"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/how-islam-transformed-muhammad-into.html",
    "title": "HOW ISLAM TRANSFORMED MUHAMMAD INTO A CHRIST FIGURE",
    "content_preview": "MUHAMMAD’S ENTHRONEMENT AND MEDIATIONHOW ISLAM TRANSFORMED MUHAMMAD INTO A CHRIST FIGUREAccording to God’s true Word, the Holy Bible, the Lord Jesus sits enthroned with God the Father andintercedes for believers in order to procure their everlasting redemption:“But He kept silent and answered nothing. Again the high priest asked Him, saying to Him, ‘Are You the Christ, the Son of the Blessed?’ Jesus said, ‘I am. And you will see the Son of Mansitting at the right hand of the Power, and coming wi",
    "full_content": "MUHAMMAD’S ENTHRONEMENT AND MEDIATIONHOW ISLAM TRANSFORMED MUHAMMAD INTO A CHRIST FIGUREAccording to God’s true Word, the Holy Bible, the Lord Jesus sits enthroned with God the Father andintercedes for believers in order to procure their everlasting redemption:“But He kept silent and answered nothing. Again the high priest asked Him, saying to Him, ‘Are You the Christ, the Son of the Blessed?’ Jesus said, ‘I am. And you will see the Son of Mansitting at the right hand of the Power, and coming with the clouds of heaven.’” Mark 14:61-62“Now if we died with Christ, we believe that we shall also live with Him, knowing that Christ, having been raised from the dead,dies no more. Death no longer has dominion over Him. For the death that He died, He died to sin once for all;but the life that He lives, He lives to God.” Romans 6:8-10“What then shall we say to these things? If God is for us, who can be against us? He who did not spare His own Son, but delivered Him up for us all, how shall He not with Him also freely give us all things? Who shall bring a charge against God’s elect? It is God who justifies. Who is he who condemns? It is Christ who died, and furthermore is also risen,who is even at the right hand of God, who also makes intercession for us.” Romans 8:31-34“Seeing then that we have a great High Priestwho has passed through the heavens, Jesus the Son of God, let us hold fast our confession. For we do not have a High Priest who cannot sympathize with our weaknesses, but was in all points tempted as we are,yet without sin. Let us therefore comeboldlyto the throne of grace, that we may obtain mercy and find grace to help in time of need.” Hebrews 4:14-16“This hope we have as an anchor of the soul, both sure and steadfast, and which enters the Presence behind the veil, where the forerunnerhas entered for us, even Jesus, having become High Priest forever according to the order of Melchizedek.” Hebrews 6:19-20“who has come, not according to the law of a fleshly commandment,but according to the power of an endless life… But He,because He continues forever, has an unchangeable priesthood.Therefore He is also able to save to the uttermostthose who come to God through Him,since He always lives to make intercession for them. For such a High Priest was fitting for us,who is holy, harmless, undefiled, separate from sinners, and has become higher than the heavens;” Hebrews 7:16, 24-26“Now this is the main point of the things we are saying: We have such a High Priest,who is seated at the right hand of the throne of the Majesty in the heavens, a Minister of the sanctuary and of the true tabernacle which the Lord erected,and not man.” Hebrews 8:1-2“Not with the blood of goats and calves, but with His own bloodHe entered the Most Holy Place once for all, having obtained eternal redemption… Therefore it was necessary that the copies of the things in the heavens should be purified with these, but the heavenly things themselves with better sacrifices than these. For Christ has not entered the holy places made with hands, which are copies of the true,but into heaven itself, now to appear in the presence of God for us; not that He should offer Himself often, as the high priest enters the Most Holy Place every year with blood of another—He then would have had to suffer often since the foundation of the world; but now, once at the end of the ages,He has appeared to put away sin by the sacrifice of Himself. And as it is appointed for men to die once, but after this the judgment, so Christ was offered once to bear the sins of many. To those who eagerly wait for Him He will appear a second time, apart from sin, for salvation.” Hebrews 9:12, 23-28“But this Man, after He had offered one sacrifice for sins forever,sat down at the right hand of God, from that time waiting till His enemies are made His footstool.For by one offering He has perfected foreverthose who are being sanctified.” Hebrews 10:12-14“looking unto Jesus, the author and finisher of our faith, who for the joy that was set before Him endured the cross, despising the shame,and has sat down at the right hand of the throne of God.” Hebrews 12:2“But you have come to Mount Zion and to the city of the living God,the heavenly Jerusalem, to an innumerable company of angels, to the general assembly and church of the firstborn who are registeredin heaven, to God the Judge of all, to the spirits of just men made perfect,to Jesus the Mediator of the new covenant, and to the blood of sprinkling that speaks better things than that of Abel. Hebrews 12:22-24“To him who overcomes I will grant to sit with Me on My throne, as I also overcameand sat down with My Father on His throne.” Revelation 3:21“Now a great sign appeared in heaven: a woman clothed with the sun, with the moon under her feet, and on her head a garland of twelve stars. Thenbeing with child, she cried out in labor and in pain to give birth… His tail drew a third of the stars of heaven and threw them to the earth. And the dragon stood before the woman who was ready to give birth, to devourher Childas soon as it was born. She borea male Child who was to rule all nations with a rod of iron. And her Child was caught up to God and His throne… Then I heard a loud voice saying in heaven, “Now salvation, and strength, and the kingdom of our God, and the power of His Christ have come, for the accuser of our brethren, who accused them before our God day and night, has been cast down.’” Revelation 12:1-2, 4-5, 10Here’s where we see Satan working in and through Muhammad.Sunni Islam has taken these unique roles of Christ and attributed them to the Muslim “prophet.” This was obviously done for the purpose of steering Muslims away from the real Jesus by having them place their trust and hope in Allah’s “messenger.”According to specific Islamic narrations Allah will actually seat Muhammad on his own throne on the day of judgment and permit him to intercede for Muslims:“Even though the traditions we have mentioned on the authority of the Prophet and his Companions and the Followers indicate the correct interpretation ofmaqaman mahmudanin Qur. 17:79 (as referringto Muhammad’s role as intercessor on the Day of Resurrection),Mujahid’s statement that God will seat Muhammad on His Throne remains one whose soundness CANNOT BE REJECTED either on the basis of traditions (khabar) or on the basis of speculation (nazar). This is so because there is no tradition from the Messenger of God or anyone of his Companions or the Followers that declares it to be impossible…From what we have said, it has become clear that, it is not impossible for an adherent of Islam to say what Mujahid had said, namely, that God will seat Muhammad on His Throne. If someone says: We do not disapprove of God’s seating Muhammad on His Throne (in view of the following tradition transmitted by) ‘Abbas b. ‘Abd al-‘Azim–Yahya b. Kathir–al-Jurayri –Sayf al-Sadusi –‘Abdallah b. Salam: ‘On the Day of Resurrection, Muhammad will be on the Lord’s footstool (kursi),’ but we disapprove of God’s seating himtogether with Him, it should be said: Is it then permissible in your opinion that He seat him on it but not together with him? If he permits this, he is led to affirming that either he is together with Him, or God seats him (on the Throne) while being Himself either separate from it or neither contiguous with nor separate from it. Whatever alternative he chooses, he thereby enters into something that he disapproves. If he says that it is not permissible, he deviates from the statements of all the groups we have reported. This means diverging from the views of all adherents of Islam, since there is no other possible statement than those three,according to each of which Mujahid’s statement in this sense is not impossible.” (The History of Al-Tabari – General Introduction and From Creation to the Flood, translated by Franz Rosenthal [State University of New York Press (SUNY), Albany, NY 1989], Volume I, Appendix A: A Partial Translation of Tafsir on Qur. 17:79 (Above, pp. 75 f.), pp. 149, 151; bold and capital emphasis mine)Tabari wasn’t the only reputable scholar to narrate and/or comment this tradition:10. Al-Qurtubi’s CommentaryImam al-Qurtubi commented thus on the verse of the Exalted Station in hisTafsir:The third explanation of this verse is what al-Tabari reported from a party of scholars – among them Mujahid – whereby “the Exalted Station is the seating by Allah of the Prophet with Him on His Throne(kursiyyih).” They narrated a hadith to that effect, and al-Tabari backed up the possibility(jawâz)of such a thing with some extravagant statements(shatatin min al-qawl). However, what he said cannot be inferred [from the verse] except with over-subtlety as to meaning(al-talattuf bi al-ma‘nâ), and it is far-fetched(fîhi bu‘d).This is not to say that there is no such narration; only that [one endowed with] knowledge interprets it figuratively(al-‘ilmu yata’awwaluhu).Abu Sa‘id al-Naqqash[68]mentioned from Abu Dawud al-Sijistani:[69]“Whoever denies this hadith, WE STRONGLY CONDEMN HIM. The scholars of knowledge never stopped narrating this hadith. Who among them ever denied its possibility, even as he interpreted it?” (G. F. Haddad, The Prophet’s Seating on the Throne (Iq‘âd al-Nabî ‘alâ al-‘Arsh);https://sunnah.org/2008/07/18/the-prophets-s-seating-on-the-throne-2/; bold and capital emphasis mine)[67]Here al-Qurtubi proceeds to interpret as he had alluded that it should be done when he said: “This is not to say that there is no such narration; only that knowledge demands that it be interpreted figuratively.” (Ibid., bold emphasis mine)And:13.  Al-Barbahari’sIdée FixeIbn Abi Ya‘la relates in hisTabaqatthat the Hanbali shaykh Abu Muhammad al-Barbahari never sat to teachexcept he mentioned that the Prophet sits next to Allah on the Throne.[114][114]Ibn Abi Ya‘la,Tabaqat al-Hanabila(2:43).14.  Al-Najjad’s Attack on “Anyone That Contradicts Us”Ibn Abi Ya‘la wrote the following in his chapter on Abu Bakr al-Najjad inTabaqat al-Hanabila:‘Ali[115]narrated to me from Ibn Batta: Abu Bakr al-Najjad told us: Harun ibn al-‘Abbas[116]told us: Muhammad ibn Bishr[117]told us: ‘Abd al-Rahman ibn Sharik[118]told us: My father[119]told me: Abu Yahya al-Qattat[120]told us, From Mujahid:– Also –(2)Mu‘adh ibn al-Muthanna[121]told us: Khallad ibn Aslam[122]said: Muhammad ibn Fadl[123]told us, From Layth, From Mujahid:Concerning the verse: “It may be that thy Lord will raise you to an Exalted Station”: “He will seat him with Him on the Throne”(yujlisuhu ma‘ahu ‘alâ al-‘arsh).[124]Al-Najjad said: “I also asked [about it] Abu Yahya al-Naqid,[125]Ya‘qub al-Mutawwa‘i,[126]‘Abd Allah ibn Ahmad ibn Hanbal, and a group of our shaykhs, and they narrated to me the hadith of Muham­mad ibn Fudayl from Layth from Mujahid.“I also asked Abu al-Hasan al-‘Attar[127]about it, and he narrated to me the hadith of Mujahid. Then he said: ‘I heard Muhammad ibn Mus‘ab al-‘Abid say: “[The Prophet’s seating on the Throne will take place] in order for all creation to see his station before his Lord, and his Lord’s generosity towards him. Then the Prophet shall retire to his apartments and gardens and wives, and alone shall remain Allah in His Lordship(yanfaridu ‘azza wa jalla bi rubûbiyyatihi).”’“I also looked into the book of Ahmad ibn al-Hajjaj al-Marwazi, who is our imam and guide and proof in this. In that book I found what he mentioned concerning the rejection of the hadiths of ‘Abd Allah ibn Salam[128]and Mujahid,and he listed the names of the shaykhs WHO CRITICIZED THOSE WHO REJECTED THESE HADITHS OR OBJECTED TO THEM.“Therefore, what we declare and believe before Allah Almighty is what we have just described and made clear concerning the meanings of the hadithsquoted from the Prophet WITH AN UNINTERRUPTED CHAIN(al-ahadith al-musnada ‘an rasul Allah),—[129]and what was said by ‘Abd Allah ibn ‘Abbas—[130]and the scholars after him, which was handed down from elder to elder and from age to age until our shaykhs’ time concerning the saying of Allah: [It may be that your Lord will raise you to an Exalted Station]: the Exalted Station consists IN THE SEATING OF THE PROPHET WITH HIS LORD ON THE THRONE. WHOEVER DENIES THIS OR CONTRADICTS IT IS ONLY ATTEMPTING TO PROMOTE THE SAYINGS OF THE JAHMIS. HE SHOULD BE AVOIDED, EXPOSED, AND WARNED AGAINST.[131]“Similarly, I was told by Abu Bakr the writer,[132]from Abu Dawud al-Sijistani, that the latter said: ‘Whoever rejects the hadith of Mujahid is a Jahmi.’[133]“Furthermore, Muhammad ibn Suhayb[134]and a group of our shaykhs narrated to us from Muhammad ibn ‘Abd al-Malik al-Daqiqi[135]that he said: ‘I first heard this hadith fifty years ago,AND I NEVER HEARD ANYONE DENY IT. ONLY THE JAHMI HERETICS REJECT IT.’“Abu Isma‘il al-Sulami[136]mentioned to us the case of al-Tirmidhi who rejected the pre-eminence of the Prophet and belittled him.[137]Of such a man he said: ‘He does not believe in the Day of Judgment.’ I have seen our shaykhs among the friends of Ahmad ibn Muhammad ibn Hanbal give the same verdict.They condemned whoever rejected such pre-eminence. Allah has made this condemnation clear in the words of the scholars as far back as one can see. The people have all met this with approval, and no-one denies this nor disputes it.“Such is also my position. And should one swear a triple divorceby the seating by Allah of the Prophet on the Throne with Him, then consult me on the validity of his oath, I would say: Your words are true, your oath binding, and the divorce stands.“That is our doctrine, our religion, our belief upon which we were raised and upon which we shall die if Allah wills. We categorically condemn whoever rejects this pre-eminence to which the scholars referred and which they met with acceptance. Whoever rejects it is from the sects that are bound for destruction.”[138][131]Here al-Najjad moves from an apologetic and descriptive stance concerned primar­ily with the evidence at hand to an aggressive stance aiming at the persons of those who question it. Towards the end of the passage he once more modifies his attack so as to represent any disputation of Mujahid’s narration as an attack on the Prophet himself.[138]Abu Bakr al-Najjad in Ibn Abi Ya‘la’sTabaqat al-Hanabila(2:9-12). (Haddad; bold and capital emphasis mine)Specific Muslim scholars even went as far as to condemn those that would deny Muhammad’s enthronement as heretics who must be avoided, exposed and warned against:15. Ibn Batta’s DoctrineIbn Batta stated in his bookal-Sharh wa al-Ibana ‘ala Usul al-Sunna wa al-Diyana(“Elaboration of the Principles of Sunni Doctrine”):The Prophet shall be seated on the Throne with his Lord(yujlas ma‘a rabbihi ‘alâ al-‘arsh), and this privilege belongs to no-one else. Thus did Nafi‘ narrate it from Ibn ‘Umarfrom the Prophet concerning the verse: “It may be that thy Lord will raise you to an Exalted Station” – he said that He shall seat him with Him on the Throne. Thus also did Mujahid explain it, as narrated by Muhammad ibn Fudayl, from al-Layth, from Mujahid. (Ibid.; bold emphasis mine)Even the renowned scholar Ibn Taymiyyah and his star pupil Ibn Qayyim believed and embraced the veracity of this tradition!12. Ibn al-Qayyim’s List of SupportersIbn Qayyim al-Jawziyya[78]said in hisBada’i‘ al-Fawa’id:Al-Qadi [Ibn Abi Ya‘la][79]said: “Al-Marwazi[80]compiled a book on the superlative merits of the Prophet in which he mentioned his seating(iq‘âduhu)on the Throne(al-‘arsh).”Al-Qadi further said: “This is the position of Abu Dawud, Ahmad ibn Asram,[81]Yahya ibn Abi Talib,[82]Abu Bakr ibn Hammad,[83]Abu Ja‘far al-Dimashqi,[84]‘Abbas al-Duri,[85]Ishaq ibn Rahuyah (or Rahawayh),[86]‘Abd al-Wahhab al-Warraq,[87]Ibrahim al-Asbahani,[88]Ibrahim al-Harbi,[89]Harun ibn Ma‘ruf,[90]Muhammad ibn Isma‘il al-Sulami,[91]Muhammad ibn Mus‘ab al-‘Abid,[92]Abu Bakr ibn Sadaqa,[93]Muhammad ibn Bishr ibn Sharik,[94]Abu Qilaba,[95]‘Ali ibn Sahl,[96]Abu ‘Abd Allah ibn ‘Abd al-Nur,[97]Abu ‘Ubayd,[98]al-Husayn ibn Fadl,[99]Harun ibn al-‘Abbas al-Hashimi,[100]Isma‘il ibn Ibrahim al-Hashimi,[101]Muham­mad ibn ‘Imran al-Farisi al-Zahid,[102]Muhammad ibn Yunus al-Basri,[103]‘Abd Allah ibn Ahmad ibn Hanbal,[104]al-Marwazi, and Bishr al-Hafi.”[105]I say: It is also the position of Ibn Jarir al-Tabari,[106]and the leader of all the above in this is Mujahid, the imam of Qur’anic commentary. It is also Abu al-Hasan al-Daraqutni’s[107]who said:The hadith of Intercession narrated by AhmadIs traced back to the Elect, Ahmad.Also known to us is the hadith of his seatingOn the Throne,THEREFORE DO NOT DENY IT.Let the hadith pass exactly as narrated,And do not enter into false notions.Neither deny that the Prophet sits on the Throne,Nor deny that Allah makes him sit there![108][108]Ibn Qayyim al-Jawziyya,Bada’i‘ al-Fawa’id(1900 ed. 4:39-40, 1994 ed. 2:328-329). (Ibid.; bold and capital emphasis mine)And:16.  Ibn Taymiyya’s InheritanceIbn Taymiyya wrote:The scholars recognized by Allah and His accepted Friends have narrated that Muhammad the Messenger of Allahwill be seated by His Lord on the Throne next to Him.Muhammad ibn Fudayl narrated this from Layth from Mujahid in the commentary of the verse: “It may be that your Lord will raise you to an Exalted Station.” This was also mentioned through other chains, some traced back to the Prophet and some not.Ibn Jarir [al-Tabari] said: “This does not contradict the nearly-mass-narrated narrations(ma istafâdat bihi al-ahâdith)whereby the Exalted Station is the Intercession as agreed upon by the Imams of all Muslims.”He does not say that the Prophet’s seating on the Throne is denounced as false; ONLY SOME JAHMIS HELD IT SO. Nor is it objectionable to mention it in the context of a commentary on the verse.[141][141]Ibn Taymiyya,Majmu‘ al-Fatawa(Mufassal al-I‘tiqad– “Specifics of Belief” – 4:374). (Ibid.; bold and capital emphasis mine)In case Muhammadans argue that this narration is weak orda’eefhere is a report which is deemed to be reliable or sound:8. Another Narration From ‘Abd Allah ibn SalamFrom ‘Abd Allah ibn Salam, in a long hadith on the Day of Judgment: “A seat(kursî)will be placed for the Prophet on the right of Allah.”[38][38]Al-Hakim narrated it in hisMustadrak(4:568-569)and declared its chain sound(sahîh), as confirmed by al-Dhahabi. (Ibid.; bold and capital emphasis mine)Islamic scholar Livnat Holtzman mentions the controversy this hadith of Muhajid’s caused for the Muslim community:… According to Q. 17:79, God promised Muhammad ‘an honourable station’ (maqāman mahmūdan). Mujahid explained this phrase: ‘[God] will make [Muhammad] sit down with Him on His throne’.9Previous scholarship that discussed thishadīthfocused on its authenticity and its connection to the hardships that the illustrious historian and Quran exegete, Abu Jaʿfar Muhammad ibn Jarir al-Tabari (d. 923), suffered from the Hanbalites of Baghdad.10…When Abu Bakr al-Najjad completed his thorough investigations about thishadīth, he issued a creed (ʿaqīda pl.ʿaqāʾid), a profession of faith which reflected the feelings of the Hanbalites on this matter:This is our profession of faith before God: We believe in the content of theahādīththat are attributed to the Messenger of God, but also to ʿAbd Allah ibn ʿAbbas (d. 687–8), and the scholars who succeeded him. Theseahādīthwere transmitted from one great scholar to another, from one generation to the next generation, until the times of our great teachers. We wrote theseahādīth, and meticulously investigated their content. Theseahādīthinterpret the meaning of the Quranic verse [Q. 17:79] ‘your Lord may exalt you to an honourable station’.According to theseahādīth, ‘the honourable station’ means that Muhammad will sit with His Lord on His throne. Whoever rejects this interpretation and refutes it, expresses the views of the Jahmiyya (the Muʿtazilites). One must avoid this person, turn away from him, and beware of him. Abu Bakr al-Khatib (d. 933) informed me that Abu Dawud al-Sijistani told him: ‘Whoever rejects thehadīthattributed to Mujahid is a Jahmite (Muʿtazilite)’.11Al-Najjad concluded that the belief in Muhammad’s noble virtue (fadīla) of sitting with God on the throne was one of the cornerstones of the Hanbalite creed. To illustrate the strength of this belief, al-Najjad explained that hypothetically, a man who declared that God would make Muhammad sit down with Him on the throne and thereafter took the oath on pain of triple divorce12to strengthen his declaration, should have never feared that he needed to divorce his wife. If this man came to al-Najjad to seek his legal advice whether he should divorce his wife or not, the scholar would tell him:You declared the truth, your oath is valid, and your wife should remain safely in her position. Because this is our way, our religion, and our creed. This is the root of our conviction from which we emerged. We will adhere to this conviction until the day we die.13Written in the middle of the tenth century, al-Najjad’s creed paraphrased thehadīthon Mujahid’s interpretation of ‘an honourable station’and elevated it to the degree of an article of faith for the Hanbalites. By doing so, al-Najjad sealed the turbulent history of thishadīthand silenced all the voices that spoke against thishadīthor merely doubted its veracity. Al-Najjad’s creed concluded the continuous controversy about thishadīthwith a smashing victory over the middle-of-the-road traditionalists.14To correctly evaluate al-Najjad’s creed, we need to examine the meaning of thishadīthand its history.Thehadīthon Mujahid’s interpretation of ‘an honourable station’ was one of the conspicuousahādīth al-sifāt, the traditions on the divine attributes that included anthropomorphic descriptions of God. Thishadīthwas controversial in spite of the fact that it did not describe God in any physical way or form.When read literally, thishadīthimplies that ‘an honourable station’ is an actual, physical place, and that God’s sitting on the throne (with Muhammad next to Him) is accordingly an actual sitting of a physical body. This reading obviously led totashbīh, namely comparing God to His creation and anthropomorphising Him. Laymen who heard thishadīthmight have been led to visualise a majestic human figure on a throne, sitting next to a much smaller human figure. The implied description of God in thishadīthwas unmistakably an anthropomorphic description… (Holtzman,Anthropomorphism in Islam: The Challenge of Traditionalism (700-1350) (Edinburgh Studies in Classical Islamic History and Culture)[Edinburg University Press, Ltd. 2019], Introduction, 1. The Narrator and Narrative: A Literary Analysis ofAhadith al-Sifat, pp. 4-5; bold emphasis mine)The ninth-century ultra-traditionalists who defended thishadīthand studied it,toiled a great deal to prove the antiquity of the text. Thus, a marginalmuhaddithby the name of Muhammad ibn ʿAbd al-Malik al-Daqiqi (d. 876) declared: ‘I heard thishadīthfor the last fifty years, and I never heard anyone rejecting it. Only the heretics and the Jahmites deny its veracity.’23The traditionalists also decorated thehadīthwith further details during their study sessions. The Hanbalite Abu ’l-Hasan ibn al-ʿAttar (d. 881) reminisced about such a study session, conducted by themuhaddithMuhammad ibn Musʿab al-ʿAbid al-Daʿʿaʾ (d. 843) from Baghdad:Once I heard Muhammad ibn Musʿab al-ʿAbid recount thishadīthwhich is attributed to Mujahid,namely ‘[God] will make [Muhammad] sit down with Him on His throne’. After transmitting thishadīth, Muhammad ibn Musʿab al-ʿAbid added: ‘So all the creatures will see Muhammad’s position at His Lord, and the respect that His Lord has for him. Thereafter, Muhammad will retire to his chambers, gardens and wives in Paradise, so God will remain alone in His ruling of the world.’24(Ibid., pp. 7-8; bold emphasis mine)Holtzman further notes how Muslims resorted to violence over this hadith, with some Hanbalites physically attacking the great Muslim exegete and historian al-Tabari for daring to question its veracity:The Hanbalite scholarship in defence of the anthropomorphic version included enthusiastic declarations supporting thishadīthand crowning it as authentic and valuable. Some Hanbalites went further and declared that thishadīthreflected the absolute truth, and should it be refuted, they would immediately divorce their wives.40The more reserved Hanbalites searched for Ahmad ibn Hanbal’s opinion on thishadīth. We found evidence of his supposed opinion inIbtāl al-Taʾwīlāt, a thematic Hadith compilation authored by the Hanbalite theologian and qadi Abu Yaʿla ibn al-Farraʾ (d. 1066; he was also the father of the biographer Ibn Abi Yaʿla). Abu Yaʿla dedicated a lengthy chapter in his book to the efforts of the Hanbalitemuhaddithūnto validate thehadīthattributed to Mujahid.Thus, the Hanbalites claimed that Ahmad ibn Hanbal himself ordered his disciples to transmit the anthropomorphic version attributed to Mujahid in the exact wording as it was received. The Hanbalites further claimed that Ahmad ibn Hanbal believed that the anthropomorphicversion should have been attributed to Mujahid’s teacher, thesahābīIbnʿAbbas.41These two claims do not correspond with the fact that thehadīthattributed to Mujahid was not included in theMusnadof Ahmad ibn Hanbal, the canonical Hadith compilation of the Hanbalites. Furthermore, Ahmad ibn Hanbal is not mentioned in the list of some thirty early Hanbalite scholars who professed their support for the anthropomorphic version attributed to Mujahid. These names were assembled by Abu Bakr al-Marwazi himself.42It is reasonable to assume that if al-Marawzi thought that Ahmad ibn Hanbal had supported thishadīth, or merely acknowledged its existence, he would have mentioned Ahmad ibn Hanbal at the top of the list.43The debate about the anthropomorphic version did not remain a theoretical issue. Thehadīthbecame a major component in the political agenda of the Hanbalites. In the year 922 (this is an approximate chronology, as the historical sources do not provide specific details about the following occurrence),a group of Hanbalites attacked the illustrious historian and Quran exegete Abu Jaʿfar Muhammad ibn Jarir al-Tabari (d. 923) in Baghdad. Al-Tabari, as one of the sources claimed,refused to accept the anthropomorphic version attributed to Mujahid and had the audacity to reject thishadīthin public.44In his great exegesis of the Quran, al-Tabari implanted subtle references to his rejection of thehadīthattributed to Mujahid: he first established that ‘the majority of the scholars’ (akthar ahl al-ʿilm) believed that the ‘honourable station’ was Muhammad’s intercession for the people on the Day of Resurrection,45by quoting a dozenahādīthto prove his point.46In the next phase, al-Tabari remarked that ‘others’ (ākharūn) claimed that the ‘honourable station’ meant that God promised the Prophet that He would make the Prophet sit on the throne, next to God.47Thereafter, al-Tabari quoted ten anthropomorphic variants of thehadīthattributed to Mujahid.48As a rule, al-Tabari did not hesitate throughout his work of exegesis to accept certainahādīthas authentic and reject others. Nonetheless, he was extremely cautious in the case of thehadīthattributed to Mujahid: Al-Tabari declared that there is no way to refute the authenticity of thehadīthattributed to Mujahid, neither by locating some textual evidence (khabar) nor by applying rational reasoning (nazar).49This saying is far from the enthusiastic declarations of the Hanbalites support for thishadīth’s veracity. We note that the Hanbalites declared that the sceptics who did not accept thishadīthwere heretics. However, in the severe circumstances in which al-Tabari lived in Baghdad (he was forced to stay at home, while visitors were prevented from visiting him),50al-Tabari seemed to have no other choice but to issue his lukewarm support of thishadīth’s authenticity.In 929, strife arose between the Hanbalite supporters of Abu Bakr al-Marwazi and ‘a group of commoners’ (tāʾifa min ’l-ʿāmma) in Baghdad. This strife,which soon escalated into riots (fitna)was ignited because of an argument about Q. 17:79, and ‘an honourable station’. Relying on earlier sources,the Damascene historian Ibn Kathir (d. 1373) reported on these riotsin his monumental chronicleal-Bidāya wa’l-Nihāya. Ibn Kathir’s report is quite odd, because in it the ‘commoners’ claimed that ‘an honourable station’ was ‘the great intercession’,while the Hanbalites held their traditional position about Muhammad’s sitting on the throne. According to Ibn Kathir,the riots resulted in the deaths of an unspecified number of rioters. Ibn Kathir adds his opinion that according toSahīh al-Bukhāri, the canonical Hadith compilation, ‘an honourable station’ was indeed the great intercession.51It seems that by determining that there was only one possible interpretation of ‘an honourable station’, and that this interpretation was not the one favoured by the Hanbalites, Ibn Kathir (who was considered an indirect disciple of the Hanbalite Ibn Qayyim al-Jawziyya) expressed his reservation about the behaviour of the tenth-century Hanbalites and their choice of texts to venerate. Other authors of the Mamluk period,like the Shafiʿite Ibn Hajar al-ʿAsqalani (d. 1449), who in fact was inclined towards Ashʿarite theology,accepted thehadīthattributed to Mujahid.52Ibn Hajar even harshly condemned a later rationalistic scholar who refuted this hadīth.53The admission of the anthropomorphic version to the traditionalistic canon was therefore fully accomplished in the fifteenth century. (Ibid., pp. 12-14; bold emphasis mine)9. Ibn Abī Yaʿlā,Tabaqāt al-Fuqahāʾal-Hanābila, vol. 2, p. 14.10. Ignaz Goldziher was the first scholar to address thishadīthand its consequences in both the public sphere (the 929 riots, al-Tabari’s ordeals, etc.), and the role that Mujahid played in shaping thishadīth: Goldziher,Die Richtungen der islamischen Koranauslesung, pp. 101–11. Franz Rosenthal’s informative introduction to his translation of al-Tabari’sKitāb al-Rusul wa’l-Mulūkfocuses on al-Tabari’s interpretation of Q. 17:79, and provides an interpretation of al-Tabari’s discussion on thehadīthattributed to Mujahid: Rosenthal, ‘General Introduction’, pp. 57–8, 69–78. Another illuminating discussion on al-Tabari’s interpretation of Q. 17:79 is Claude Gilliot’s. Gilliot also analyses a parallel passage authored by the Quran exegete Abu ʿAbd Allah al-Qurtubi (d. 1272): Gilliot,Exégèse, langue, et théologie, pp. 249–54. Two indispensable discussions are Swartz,A Medieval Critique of Anthropomorphism, p. 249, footnote 358; and Ramadān,Usūl al-Dīnʿinda ’l-Imām al-Tabarī, pp. 23–33. The confrontations between the Hanbalites and al-Tabari are briefly described in Turner, Inquisition in Early Islam, pp. 145–8. Turner determines that ‘[t]he violent Hanbalī response to al-Tabarī is most clearly understood if theirmadhhabis seen as a new player competing with al-Tabarī’smadhhab, which was equally new’: Turner,Inquisition in Early Islam, p. 146. A comprehensive study on the relationships between al-Tabari and the Hanbalites, including an illuminating discussion on al-Tabari’s treatment of Q. 17:79, including a reference to the prominent Hanbalite sources, is Shah, ‘Al-Tabarī and the Dynamics of the Tafsīr’, pp. 105–10.11. Ibn Abī Yaʿlā,Tabaqāt al-Fuqahāʾal-Hanābila, vol. 2, pp. 16–17.12. On the oath on pain of triple divorce (hilf bi’l-talāq thalāthan), see Rapoport, Marriage,Money and Divorce, p. 92.13. Ibn Abī Yaʿlā,Tabaqāt al-Fuqahāʾal-Hanābila, vol. 2, pp. 17–18.14. Al-Najjad’s disciple, the influentialmuhaddithand Hanbalite jurisprudent Ibn Batta (d. 997), also issued a creed.In this creed he clarified that Mujahid’shadīthis one of the cornerstones of the Hanbalite creed: Laoust,La profession de foi d’Ibn Batta, pp. 60–1, 113…23. Ibn Abī Yaʿlā,Tabaqāt al-Fuqahāʾal-Hanābila, vol. 2, pp. 16–17. See similar declarations by ninth-century traditionalists in al-Khallāl,al-Sunna, vol. 1, pp. 217–18, anecdote 250; p. 219, anecdote 253.24. Ibn Abī Yaʿlā,Tabaqāt al-Fuqahāʾal-Hanābila, vol. 2, p. 14…40. Al-Khallāl,al-Sunna, vol. 1, pp. 256–7, anecdotes 307–8; pp. 258–9, anecdote 312.41. Abū Yaʿlā,Ibtāl al-Taʾwīlāt, p. 480, anecdotes 447–8; van Ess,TG, vol. 2, pp. 642–3.42. Ibn Qayyim al-Jawziyya,Badāʾiʿal-Fawāʾid, vol. 4, p. 1380.43. See the illuminating analysis of Tāhā Muhammad Najjār Ramādān,Usūl al-Dīnʿinda ’l-Imām al-Tabarī, pp. 29–30, and the precise remark of Shah, ‘Al-Tabarī and the Dynamics of the Tafsīr’, p. 136, note 153.44. Yāqūt,Muʿjam al-Udabā’, vol. 1, p. 2450.45. Al-Tabarī,Jāmiʿal-Bayān, vol. 15, p. 43 (the interpretation of Q. 17:79).46. Al-Tabarī,Jāmiʿal-Bayān, vol. 15, pp. 43–7 (the interpretation of Q. 17:79); Gilliot,Exégèse, langue, et théologie, pp. 249–51; Shah, ‘Al-Tabarī and the Dynamics of the Tafsīr’, pp. 108–9.47. Al-Tabarī,Jāmiʿal-Bayān, vol. 15, p. 47 (the interpretation of Q. 17:79).48. Al-Tabarī,Jāmiʿal-Bayān, vol. 15, pp. 47–51 (the interpretation of Q. 17:79).49. Al-Tabarī,Jāmiʿal-Bayān, vol. 15, p. 51 (the interpretation of Q. 17:79). Al-Tabari developed his implied rejection of thehadīthin a convoluted discussion on God’s transcendence that he wisely inserted in other passages in his discussion of Q. 17:79: al-Tabarī,Jāmiʿal-Bayān, vol. 15, pp. 51–4. This discussion remains for another time.50. Al-Khatīb al-Baghdādī,Tārīkh Madīnat al-Salām, vol. 2, p. 551 (the biography of Abu Jaʿfar Ibn Jarir al-Tabari).51. Ibn Kathīr,al-Bidāya wa’l-Nihāya, vol. 15, pp. 42–3 (the events of Hijri year 317). Cf. the reports of the historians Ibn al-Athir (d. 1233) and Shams al-Din al-Dhahabi (d. 1348): Ibn al-Athīr,al-Kāmil fī ’l-Tārīkh, vol. 8, p. 57 (the events of Hijri year 317); al-Dhahabī,Tārīkh al-Islām, vol. 23, p. 384 (the events of Hijri year 317).52. Ibn Hajar al-ʿAsqalānī,Fath al-Bārī, vol. 8, p. 259,hadīth4534 (Kitāb Tafsīr al-Qurʾān, bāb qawlihi taʿālāʿasā an yabʿathaka rabbuka maqāman mahmūdan).53. Ibn Hajar al-ʿAsqalānī,Fath al-Bārī, vol. 11, pp. 433–7,hadīth6344 (Kitāb al-riqāq, bāb sifat al-janna wa’l-nār). (Ibid., pp. 17-20; bold emphasis mine)Hence, Muhammad will be given a seat at the right side of Allah!Since the throne represents Allah’s lordship over creation (rububiyyah),Verily your Lord is Allah, who created the heavens and the earth in six days,and is firmly established on the throne (of authority), regulating and governing all things. No intercessor (can plead with Him) except after His leave (hath been obtained). This is Allah your Lord; Him therefore serve ye: will ye not receive admonition? S. 10:3 Yusuf AliSay: “Allah knows best how long they stayed. With Him is (the knowledge of) the unseen of the heavens and the earth. How clearly He sees, and hears (everything)! They have noWali(Helper, Disposer of affairs, Protector, etc.) other than Him,and He makes NONE to share in His Decision and His Rule.” S. 18:26 Hilali-KhanBlessed be He who has sent down the Salvation upon His servant, that he may be a warner to all beings; to whom belongs the Kingdom of the heavens and the earth; and He has not taken to Him a son,and He has no associate in the Kingdom; and He created every thing, then He ordained it very exactly. S. 25:1-2 ArberryThis means that Allah shall take Muhammad as a partner in his exclusive rule over the heavens and earth, making his so-called prophet into another sovereign lord besides himself!As if Islam’s blasphemy couldn’t get any worse, other supposedauthentic narrations assert that the names of Allah and Muhammad are written on the pillars of Allah’s throne, and that Adam was forgiven because he invoked Muhammad’s name!Al-Bayhaqi cited the following hadith in his book “Dala’il an-Nubuwwah” (Signs of Prophethood): Narrated ‘Umar Ibn al-Khattab: the Prophet said: “When Adam committed the sin, he said to Allah, ‘O My Lord,I ask You with reference to Muhammad to forgive me‘. Allah said: ‘O Adam! How did you know about Muhammad, for I have not yet created him?’ Adam replied, ‘O My Lord, when You created me,I looked up and saw inscribed on the legs of the Throne the words: There is no God worthy of worship except Allah and Muhammad is His Messenger. I knew that you do not attach to Your name but the name of the dearest of Your Creation.’ Allah said to Adam, ‘You have spoken rightly, Adam. Muhammad is the dearest of My Creation. I have forgiven youbecause you asked by Muhammad. AND HAD IT NOT BEEN FOR HIM, I WOULD NOT HAVE CREATED YOU.'” This hadith was narrated by al-Hakim who also classified it AS SAHIH (AUTHENTIC). Among the transmitters of this hadith is ‘Abd ar-Rahman Ibn Zayd Ibn Aslam. Al-Haythami said: “This hadith was reported by at-Dabarani and in its chain of transmitters are people I do not know. Al-Hakim was therefore mistaken in classifying this hadith as sahih because he himself criticised ‘Abd ar-Rahman Ibn Zayd Ibn Aslam in his bookad-Du’afa, so how can he state the authenticity of the hadith after he had criticised him?!!” (Tafsir Ibn Kathir, Part 1, Surah Al-Fatiah Surah Al-Baqarah, ayat 1 to 141, Abridged by Sheikh Nasib Ar-Rafa’i [Al-Firdous Ltd., London: Second Edition 1998], p. 107, fn 10; bold and capital emphasis mine)And:Abu Muhammad al-Makki, Abu’l-Layth as-Samarqandi and others related that when Adam rebelled, he said, “O Allah, forgive me my error BY THE RIGHT OF MUHAMMAD!” Allah said to him, “How do you know Muhammad?” He said, “I saw written in every place in the Garden, ‘There is no god but Allah, Muhammad is the Messenger of Allah.’ So I knew that he was the most honoured creation in Your eyes.” SO ALLAH TURNED TO HIM AND FORGAVE HIM. It is said that this is the interpretation of the words of Allah,“Adam learned some words from his Lord.”(2:27)Another variant has that Adam said, “When you created me, I lifted my gaze to Your Throne AND WRITTEN ON IT WAS: ‘There is no god but Allah, Muhammad is the Messenger of Allah,’ so I knew there would be no one held in greater esteem by You THAN THE ONE WHOSE NAME YOU PLACED ALONGSIDE YOUR OWN NAME.” Allah then revealed to him, “By My might and majesty, he is the last of the prophets among your descendants. IF IT HAD NOT BEEN FOR HIM, I WOULD HAVE NOT CREATED YOU.” It is said that Adam was given thekunya, Abu Muhammad. Some people say that it was Abu’l-Bashar (the father of mankind). (Qadi ‘Iyad Musa al-Yahsubi,Muhammad Messenger of Allah (Ash-Shifa of Qadi ‘Iyad), translated by Aisha Abdarrahman Bewley [Madinah Press, Inverness, Scotland, U.K. 1991; third reprint, paperback], Chapter Three: On the Sound And Well-Known Traditions Related About the Immense Value Placed On Him By His Lord, His Exalted Position And His Nobility In This World And The Next, Section 1: His place, p. 89; capital emphasis mine)Gibril Haddad mentions similar reports:– The hadith of Adam’stawassulthrough the Prophet is related by the Companions – Maysara, Ibn ‘Abbas, and Ibn ‘Umar – with chains varying in strength from strong to very weak:I. Ibn al-Jawzi narrated inal-Wafawith his chain through al-Bayhaqi’s and al-Khatib’s shaykh, the trustworthyhafizAbu al-Husayn ‘Ali ibn Muhammad ibn ‘Abd Allah, known as Ibn Bishran al-‘Adl al-Umawi al-Baghdadi al-Mu‘addal (d. 411 or 415) in hisFawa’id, from the trustworthyhafizandMusnidof Baghdad Abu Ja‘far Muhammad ibn ‘Amr ibn al-Bakhtari al-Razzaz, from Ahmad ibn Ishaq ibn Salih al-Wazzan al-Jurjani (d. 281“la ba’sa bihi”according to al-Daraqutni), from Muhammad ibn Sinan al-‘Awqi (d. 223, al-Bukhari’s shaykh in theSahih), from Ibrahim ibn Tahmn (one of the narrators of theSahihayn), from Budayl ibn Maysara (one of the narrators inSahih Muslim), from ‘Abd Allah ibn Shaqiq (one of the narrators inSahih Muslim), from the Companion Maysarat al-Fajr:I said: “Messenger of Allah, when were you made a Prophet?” He replied: “When Allah created the earth and turned to the heavens, arranging them into seven heavens, and He created the Throne,He wrote on the leg of the Throne: MUHAMMAD IS THE MESSENGER OF ALLAH AND THE SEAL OF PROPHETS. And Allah created Paradise in which He made Adam and Hawwa’ dwell,then He wrote my name [there] on the gates, the tree-leaves, the houses and tents, while Adam was still between the spirit and the body. When Allah Most High brought him to life,he looked at the Throne and saw my name, whereupon Allah Most High informed him: ‘He is the liege-lord of your offspring.’ When shaytan deceived them, they repented and sought intercessionwith my name from Him.”The hadith master al-Salihi cited it inSubul al-Huda wal-Rashad(Beirut ed. 1:86=Cairo ed. 1:104) and said “Its chain is good and there is no harm in it.”1Al-Halabi also cited it in hisSira(1:355)…II. Al-Khallal narrated inal-Sunna(1:261): Al Fadl ibn Muslim al-Muharibi narrated to us: Muhammad ibn ‘Isma narrated to us: Jundul [ibn Waliq,thiqaper al-Haythami] narrated to us: ‘Amr ibn Aws al-Ansari [masturper al-Dhahabi] narrated to us: from Sa‘id ibn Abi ‘Aruba: from Qatada: from Sa‘id ibn al-Musayyab: from Ibn ‘Abbas: Allah Most High revealed to ‘Isa: ‘O ‘Isa, Believe in Muhammad and command whosoever reaches his time among your Community that they believe in him.Were it not for Muhammad, I would not have created Adam, and were it not for Muhammad, I would not have created Paradise or Hellfire. Indeed, I created the Throne on top of the water and it shook, so I inscribed upon it LA ILAHA ILLA ALLAH MUHAMMADAN RASULULLAH, where upon it stood still.’” Al-Khallal said: “I read it to Abu ‘Abd Allah Muhammad ibn Bishr ibn Sharik and he concurred with it,”i.e.with its being authentic.Al-Hakim similarly narrated in theMustadrak(2:614-615=2:271): ‘Ali ibn Hamshadh al-‘Adl (258-338) [Abu al-Hasan al-Naysaburi, a major trustworthyhafiz] narrated to us by dictation: Harun ibn al-‘Abbas al-Hashimi (208-275) [thiqaper al-Khatib] narrated to us: Jundul ibn Waliq narrated to us, to the end of the above chain and text. Al-Hakim said: “This is a sound-chained hadithbut Al-Bukhari and Muslim did not narrate it.”2Al-Dhahabi in hisTalkhis al-MustadrakandMizan al-I‘tidal(s.v.‘Amr ibn Aws) conjectures that Ibn ‘Abbas’s narration is forged (“azunnuhu mawdu‘an”)but brings no proof, as its chain contains neither a liar nor a forger and is a fair chain by theSalafs criteria forfada’ilhadiths.1A grading confirmed by ‘Abd Allah al-Ghumari inMurshid al-Ha’ir(p. 37) andal-Radd al-Muhkam(p. 138-139) as well as his student Mahmud Mamduh inRaf‘ al-Minara(p. 247-249).2Also Abu al-Shaykh inTabaqat al-Asfahaniyyinaccording to al-Lacknawi inal-Athar al-Marfu‘a(p. 44), and Abu Sa‘d al-Naysaburi in (1:163-165 §15). (Hadith of Adam’s tawassul through the Prophet; bold and capital emphasis mine)The foregoing makes it abundantly clear that Satan raised up Muhammad to become a Christ figure in order to mislead people from turning to the true Jesus, mankind’s only hope of salvation:“‘Let not your heart be troubled; you believe in God,believe also in Me. In My Father’s house are many mansions; if it were not so, I would have told you.I go to prepare a place for you. And if I go and prepare a place for you,I will come again and receive you to Myself; that where I am, there you may be also. And where I go you know, and the way you know.’ Thomas said to Him, ‘Lord, we do not know where You are going, and how can we know the way?’ Jesus said to him, ‘I am the way, the truth,and the life. No one comes to the Fatherexcept through Me.’” John 14:1-6“Then Peter,filled with the Holy Spirit, said to them, ‘Rulers of the people and elders of Israel: If we this day are judged for a good deed done to a helpless man, by what means he has been made well, let it be known to you all, and to all the people of Israel, that by the name of Jesus Christ of Nazareth, whom you crucified, whom God raised from the dead, by Him this man stands here before you whole. This is the “stone which was rejected by you builders, which has become the chief cornerstone.”Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved.’ Now when they saw the boldness of Peter and John, and perceived that they were uneducated and untrained men, they marveled.And they realized that they had been with Jesus. And seeing the man who had been healed standing with them,they could say nothing against it.” Acts 4:8-14It also proves that Islam is not a monotheistic faith since it has turned Muhammad into a demigod who shares in Allah’s exclusive traits.May the risen Lord of glory, God’s beloved Son, the Lord Jesus Christ, deliver Muslims from this antichrist figure, saving them from Allah and his so-called messenger, and bring them to his glorious feet in order to experience the everlasting love and peace that comes from him alone:All things have been delivered to Me by My Father, and no one knows the Son except the Father. Nor does anyone know the Father except the Son, and the one to whom the Son wills to reveal Him.Come to Me, all you who labor and are heavy laden, and I will give you rest. Take My yoke upon you and learn from Me, for I am gentle and lowly in heart, and you will find rest for your souls. For My yoke is easy and My burden is light.” Matthew 11:27-30“Peace I leave with you, My peace I give to you; not as the world gives do I give to you. Let not your heart be troubled, neither let it be afraid.” John 14:27“These things I have spoken to you,that in Me you may have peace. In the world you will have tribulation; but be of good cheer,I have overcome the world.” John 16:33All biblical references taken from the New King James Version (NKJV).FURTHER READINGMuhammad on the Throne – More on Islam’s Other GodQuran Difficulty: Is Allah the only ruler?APPENDIXThe belief in Muhammad’s enthronement led to strife and violence among the Muslims, which even resulted in al-Tabari being viciously opposed by a group of Hanbali Muslims. These Muslims went as far as to destroy al-Tabari’s very own home, and having him barred from speaking in certain places:Qur’an 17:79 was generally explained as eschatological274and the “praiseworthy position” as referring to Muhammad’s role as intercessor with the Deity on the Last Day. There was, however, a tradition reported from Mujahid (but not found in the preserved recension of his commentary on Qur. 17:79) which reached Tabari by way of ‘Abbad b. Ya’qub al-Asadi–Muhammad b. Fudayl–Layth b. Abi Sulaym.It states that the “praiseworthy position” means that Muhammad will be seated by God on his divine Throne.275Hanbalite championship of the tradition produced vehement outpourings of hatred against those who opposed it, allegedly with equal immoderation. They were called by every conceivable epithet; they were branded as innovators, liars, ignoramuses, heretics (zindiq), and unbelievers. Above all, they were seen as Jahmis, that is, speculative theologians (Mu’tazilites). Their nefarious intent–or, at any rate, the result of their attitude–was to deny a singular distinction to the Prophet, and, in the process, they defamed the exemplary Muslim that was Mujahid. Already Ibn Hanbal’s principal successor as spokesman for his legal school, Abu Bakr al-Marrudhi (d. 275/888),276was strongly partial to Mujahid’s tradition and appears to have employed the “praiseworthy position” question as a sort of shibboleth. Abu Bakr al-Marrudhi’s student and successor as the principal Hanbalite scholar of his time, Abu Bakr al-Khallal (d. 311/923), took up the subject. He reproduced his teacher’ s arguments at length and thus preserved them for posterity.277His younger contemporary, al-Barbahari (d. 329/941),278then made the most of it.He missed no opportunity to proclaim Qur. 17:79 as referring to the Prophet’s being seated on the divine Throne. Although al-Barbahari’s name is not mentioned in connectionwith Tabari’s Hanbalite trouble, he probably must be seen as the person behind much of it.The actual course of the events affecting Tabari can be reconstructed only with difficulty, because supporters on both sides apparently circulated conflicting reports. Matters appear to have come to a head after the year 290/903. In that year, Tabari returned to his home town in Tabaristan on a second, and apparently last, visit. He no doubt used the Khurasan Road that took him through such large cities as Dinawar and Hamadhan. In Dinawar, he stopped to meet with scholars there and to give lectures; he may very well have done the same in other towns along the road, thus making his journey profitable intellectually and, possibly, economically. On his return to Baghdad,three Hanbalites, who do not seem further identifiable,279asked Tabari about his views on Mujahid’s tradition. Tabari is said to have declared bluntly that it was absurd. Moreover, he added a flippant jingle ridiculing it:Praised be the One Who has no confidant and has no one to sit on His Throne.Enraged Hanbalites thereupon stoned his residenceand caused a serious disturbance which had to be subdued by force.Trouble with the Hanbalites that took a similar form is also reported at the time of Tabari’s death. In connection with it, Nazuk is mentioned as chief of police. He was appointed to this position only in 310/922[3], the year Tabari died, but he appears to have held high positions in the police before and may already have been in charge of Tabari ‘s protection against potential Hanbalite violence. In 309/921121, the wazir ‘Ali b. ‘Isa had offered Tabari the opportunity to debate the matter with the Hanbalites in his residence. Tabari agreed, but the Hanbalites did not show up.280However, shortly before his death, Hanbalite rioters supposedly pelted his house with stones so numerous that they formed a large wall in front of it. The verse just quoted was discovered written on the wall of Tabari’s house. After the riot subsided, someone wrote underneath it:Ahmad281will no doubt have a high position when he comes to the Merciful One,Who will draw him near and seat him nobly to spite an(y) envier,Upon a throne enveloping him282with perfume to make livid an(y) obnoxious liar.(He has) truly this unique position (al-maqam).This has been transmitted by Layth from Mujahid.Inscriptions in verse or prose on the walls of houses are a standard device of the Arabic literary imagination. It seems most unlikely that a man in Tabari’s position and at his advanced age would have beenso childish as to write inflammatory verses on the walls of his house. Someone else might have done itin order to provoke the Hanbalite mob. Presumably, however, the mural poetry was a literary embellishment invented by Hanbalites which crept into the vague reports about the event.283The fact that historiansreport another bloody incident aboutmaqaman mahmudaninvolving followers of the late Abu Bakr al-Marrudhi for the year 317/929284neither confirms nor invalidates the historicity of the event involving Tabari.The circumstances surrounding the debate about the “praiseworthy position” deserve some more clarification. In hisMusnad, Ibn Hanbal includes no traditions that supportthe interpretation of the phrase as referring to the Prophet’s being seated on the divine Throne.285One might argue that the very fact that Ibn Hanbal has nothing to say about the impossibility of Mujahid’s interpretationcould indicate that it could not be ruled out, using a type of argument employed by Tabari in his discussion of the matter. This, however, is very unlikely. Ibn Hanbal may have simply disregarded Mujahid’s tradition as irrelevant or objectionable. After all, it had noisnadgoing back to more ancient authorities or the Prophet, while there were traditions having the Prophet’s seal of approval that referred to intercession. Clearly,this made it necessary to invent an appropriate Prophetical tradition for Muhammad’s place on the divine Throne, AND THIS WAS DONE. Ibn Battah (d. 387/997) listed one such tradition with theisnadNafi’–’Abdallah b. ‘Umar–the Prophet.286He is certain not to have invented it himself. When it made its first appearance is hard to say; evidently, Abu Bakr al-Khallal in the early years of the century did not yet know it.InTafsir, Tabari has a long and interesting discussion of the “praiseworthy position.”287It again shows him to be the great compromiser. He admits that intercession is the interpretation that is solidly documented and which therefore has the best claim to being correct. However, he says, the other interpretation cannot entirely be ruled out. As the composition ofTafsirantedates the events described, it might be argued that Tabari interpolated the discussion inTafsirafter publication when Hanbalite hostility took such a truly ugly turn.288This cannot be proved. It might be assumed that he took at first a conciliatory attitude such as is displayed inTafsirand renounced it at some later date when he got disgusted with Hanbalite violence. This seems more likely, but again there is no hard evidence for it. Whatever it was, the view expressed inTafsirdid nothing to assuage Hanbalite opposition to him which appears to have had deeper roots than merely disagreement about a catchy slogan.The arguments marshalled by Tabarifor the purpose of making Mujahid’s tradition admissiblewere derived from speculative theology and show him adept in its ways of thinking and debating. The basic issue, as he sees it, is the problem of contiguity (mumassah). It had its proper place in physics but was transferred to theology by religious thinkers289Al-Ash’ari (ca 260324/873(41-935(6)), who lived most of his life in al-Basrah and was but a generation removed from Tabari, considered the matter important enough to refer to it in his discussion of anthropomorphism (tajsim).God is not upon the Throne, except in the sense that He is above it but does not touch it. According to Hisham b. al-Hakam,God’s location is in one specific place (fi makan dun makan). His place is the Throne, and He is in touch with it. The Throne encompasses and delimits Him. Another view holds that the Creator fills the Throne and is in touch with it. At this point,al-Ash’ari adds that some hadith scholars hold that the Throne is not filled by Him and that He (is thus able to) SEAT HIS PROPHET WITH HIMSELF ON THE THRONE.290Tabari considers the problem of God completely filling the Throne. He remarks on His contiguity and finds that only three possibilities apply to it. For him, however,the crucial point that must be made is that God’s seating of Muhammad on the Throne, with or without Himself, does not imply divinity (“lordship”rububiyyah) for the Prophet or deny his status as a human being (“servantship”‘ubudiyyah). In fact,the implied hint at Muhammadan divinitywould appear to be the most objectionable feature of Mujahid’s tradition. In touching upon this aspect,Tabari comes close to the possible reason why Mujahid might have made this seemingly un-Islamic statement. Christianity speaks of the Son not only as sitting on a throne but also of some mysterious being as sitting together with the Father in His Throne (Rev. 3:21). Even in remote Mecca, Mujahid could have heard about these viewsor seen one of the many representations of the Trinity or the enthroned Christ.291He may very well have felt that Muhammad should be similarly distinguished as was the prophet of Christianity. (Rosenthal,The History of Al-Tabari, Introduction, pp. 71-77)276. For Abu Bakr Ahmad b. Muhammad b. al-Haljaj al-Marrudhi, see Ibn Abi Yaia,Tabaqat, I, 56-63; Sam’ani,Ansab, XII, 201 f.; Yaqut,Mu’jam, IV, 506, s. v. Marty al-Rudh. According to Dhahabi,‘Uluww, 125, 1. 2, he wrote in defense of Mujahid’s tradition (see below, n. 277). Ibn Abi Ya’la,Tabaqat, 6o, states that al-Marrudhi was asked about the Jahmiyyah’s rejection of the “story of the Throne.” This may refer to alleged Mu’tazilah views on the location of the Throne, rather than, specifically, to the tradition of Mujahid.277. For Abu Bakr al-Khallal, see Sezgin,GAS, I, 511 f. I wish to thank J. van Ess for providing me with a xerox copy of Khallal,Musnad, 75-99.278. For al-Hasan b. ‘Ali b. Khalaf al-Barbahari, see Sezgin,GAS, 1, 512; Laoust, inMelanges Massignon, III, 22-5. Ibn Abi Ya’la,Tabaqat, II, 18-45, gives a good picture of his generally extremist positions. “Whenever al-Barbahari attended a meeting,he would mention that God seats Muhammad with Himself on the Throne.” In 323/935,he was in hiding and his followers were strictly forbidden to assemble. One of them was accusedof having set a disastrous fire in al-Karkh, see Hamadhani,Takmilah, 79 f., ed. Cairo, XI, 294-6. See further Brockelmann,GAL, Suppl. I, 344, and the indexes ofEclipseand Massignon,Passion2, as well as Allard,Attributs, 103 f.279. The three were Abu ‘Abdallah al-Jassas, Ja’far b. ‘Arafah, and al-Bayadi. The identification of al-Bayadi with Abu ‘Ali Muhammad b. ‘lsa al -Bayadi was proposed by the editor ofIrshid, VI, 436, n. 1, but requires confirmation. This individual, whose family claimed ‘Abbasid descent, wrote on Qur’an reading. He was killed by the Qarmatians in 294/906 on his return from the pilgrimage, seeTB, II, 401; Sam’ani,Ansab, 384.On the incident, see also Goldziher,Muslim Studies, II, 158 (II, 168, of the original German). Goldziher’s reference was to Suyuti,Tahdhir, 161, whose source scurrilously attributes this information to a storyteller in the streets of Baghdad. (Ibid., pp. 72-73)285. Sec Ibn Hanbal,Musnad, 1, 375 f., 398 f., III, 354, for traditions on intercession. Forthe tradition of Gabriel sitting “on a footstool” or “on the throne,” presumably the divine Throne, between heaven and earth, see Ibn Hanbal,Musnad, III, 306: Ibn Hajar,Fath, X, 305.286. See Laoust,Profession de foi d’Ibn Batta, text, 61, trans., 112 f., especially note I. In addition to Mujahid, al-Wahidi (d. 468/1075) refers to a tradition of Ibn Masud, see Razi,Tafsir, XXI, 32. He may have the same tradition in mind, mixing up, as it sometimes happens, ‘Abdallah b. Umar and ‘Abdallah b. Masud. A tradition of ‘A’ishah on the subject is discussed in Ibn al-Jawzi,Daf’, 81,hadithno. 39.287. SeeTafsir, XV, 97, 1. 10-100, 1. 22. See the translation below, Appendix A, below, pp. 149-51. For another partial translation, see Andrae,Person, 270-2. For Tabari’s real feelings about Mujahid and his tradition, it may be indicative that he rejects a view expressed by him with unusual harshness in connection with his commentary on the same verse of the Qur’an, seeTafsir, XV, 96, 11. 26-31. (Ibid., p. 75)291. Not much can be made in this connection of the allegation that Mujahid used material provided by Christians and Jews in his Qur’an commentary. See Ibn Sa’d,Tabaqat, V, 344, 1. 7, and the remark transmitted through Abu Bakr b. ‘Ayyash (below, translation, n. 72) in Dhahabi,Mizan, III, 439; Ibn Hajar,Tahdhib, X, 43; Sezgin,GAS, 1, 29. As one would expect, Dhahabi refers to Mujahid’s view ofmakaman mahmudanwith disapproval.On Mujahidand the vibrating of the divine Throne, see Goldziher,Richtungen, 108 f.A similar but different idea was already expressed in Khallil,Musnad, 82. The Muslims would be the laughing stock of Christiansif they denied to Muhammad the honor of sitting on the divine Throne, while granting semidivine status to Jesus. (Ibid., p. 277)",
    "publish_date": "September 28, 2025",
    "publish_date_parsed": "2025-09-28T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 9268,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:01.760573"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/why-is-palestine-not-mentioned-in-quran.html",
    "title": "Why is Palestine Not Mentioned in the Qur’an?",
    "content_preview": "Why is Palestine Not Mentioned in the Qur’an?By Dr. Maxwell ShimbaFor Max Shimba Ministries OrgIntroductionA close reading of the Qur’an reveals a striking omission: the namePalestineis never mentioned. Instead, the Qur’an consistently affirms the unique and divinely chosen status of Israel and the land granted to the children of Israel. This raises a significant theological and historical question: if Allah himself never sanctified or even acknowledged “Palestine” in the Qur’an, why do contempo",
    "full_content": "Why is Palestine Not Mentioned in the Qur’an?By Dr. Maxwell ShimbaFor Max Shimba Ministries OrgIntroductionA close reading of the Qur’an reveals a striking omission: the namePalestineis never mentioned. Instead, the Qur’an consistently affirms the unique and divinely chosen status of Israel and the land granted to the children of Israel. This raises a significant theological and historical question: if Allah himself never sanctified or even acknowledged “Palestine” in the Qur’an, why do contemporary Muslims advocate so strongly for Palestinian claims against Israel? This tension exposes both a religious and political paradox.The Qur’anic Recognition of IsraelInSurat al-Baqara 2:40, Allah addresses the Israelites directly:“O Children of Israel! Remember My favor which I bestowed upon you, and fulfill My covenant upon you, and I will fulfill your covenant from Me, and fear only Me.”This verse highlights that Israel—not the Arab nations—was the recipient of divine favor. The Qur’an does not record a parallel address to the Arabs, nor does it affirm that Palestine, as a geographical or theological entity, holds any divine sanctity.Israel’s Superiority According to the Qur’anAllah’s words inSurat al-Baqara 2:47emphasize Israel’s exalted status:“O Children of Israel! Remember My favor which I bestowed upon you and that I preferred you over all peoples.”Here, the Qur’an explicitly affirms that the Israelites were divinely chosen and elevated above other nations—including the Arabs. This divine election becomes a source of envy and resentment, particularly among Arabs who are excluded from this covenantal privilege.Theological Implications of the Omission of PalestineWhile the Qur’an repeatedly acknowledges Israel as a blessed nation, it is silent on the existence or significance of Palestine. There is no verse declaring Palestine as a sacred land, nor any recognition that the Arab peoples inherited the divine covenant. Consequently, the Muslim claim to Palestine rests not on scriptural authority, but on political and ideological constructs that developed much later.Israel as the Recipient of Revelation and ProphecyFurther evidence is found inSurat al-Jaathiya 45:16:“And indeed We gave the Children of Israel the Scripture and judgment and prophethood, and We provided them with good things, and We preferred them over all the worlds.”The Qur’an acknowledges that Israel was entrusted with Scripture (Kitab), divine law (hukm), and prophecy (nubuwwa). These privileges are not attributed to Arabs or Palestinians. Thus, the very text that Muslims hold as divine testimony reinforces Israel’s unique role in salvation history.Historical and Contemporary EnvyThis recognition helps explain the persistent animosity of many Arab nations toward Israel. According to the Qur’an itself, Israel is chosen and divinely favored, while the Arabs are not. Such exclusion breeds theological jealousy and political hostility, fueling centuries of conflict and attempts to delegitimize Israel’s existence.ConclusionThe Qur’an itself provides the foundation for understanding why the modern concept of “Palestine” lacks divine legitimacy. By consistently affirming Israel’s chosen status and entirely omitting Palestine, the Qur’an inadvertently supports the biblical truth that Israel is God’s covenant people. For Christians, this serves as yet another confirmation that God’s promises to Israel remain unshaken. No matter the political manipulations or hostilities, Israel continues to stand as a nation blessed by God, both biblically and—ironically—even according to the Qur’an.Author’s NoteThis reflection is presented as part of the theological mission ofMax Shimba Ministries Org, which is dedicated to proclaiming the truth of the gospel and defending the authority of Scripture against distortions.Maxwell Shimba, Th.D.Servant of Jesus ChristMax Shimba Ministries Org ©2016. All Rights Reserved",
    "publish_date": "September 23, 2025",
    "publish_date_parsed": "2025-09-23T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "allah",
    "word_count": 558,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:09.406205"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/muhammad-alifia-kifuani-kwa-aisha_23.html",
    "title": "Muhammad Alifia Kifuani Kwa Aisha: Uchambuzi wa Kisomi, Kihistoria, na Majadiliano",
    "content_preview": "Muhammad Alifia Kifuani Kwa Aisha: Uchambuzi wa Kisomi, Kihistoria, na MajadilianoNa: Dr. Maxwell ShimbaUtanguliziTukichambua historia ya maisha ya Mtume Muhammad, mojawapo ya taarifa zinazozua mjadala mkubwa ni hadithi inayosema kwamba Mtume alifariki akiwa mikononi mwa mke wake Aisha. Hadithi hii inapatikana katika tafsiri ya Ibn Ishaq yaSirat Rasul Allah, ambapo Aisha anasema:\"Mtume alifia kifuani pangu wakati wa zamu yangu: Sijamkosea mtu yoyote yule kuhusiana naye. Ilikuwa ni kwa sababu ya ",
    "full_content": "Muhammad Alifia Kifuani Kwa Aisha: Uchambuzi wa Kisomi, Kihistoria, na MajadilianoNa: Dr. Maxwell ShimbaUtanguliziTukichambua historia ya maisha ya Mtume Muhammad, mojawapo ya taarifa zinazozua mjadala mkubwa ni hadithi inayosema kwamba Mtume alifariki akiwa mikononi mwa mke wake Aisha. Hadithi hii inapatikana katika tafsiri ya Ibn Ishaq yaSirat Rasul Allah, ambapo Aisha anasema:\"Mtume alifia kifuani pangu wakati wa zamu yangu: Sijamkosea mtu yoyote yule kuhusiana naye. Ilikuwa ni kwa sababu ya kutokujua kwangu na udogo uliozidi kiasi hata Mtume akanifia mikononi mwangu.\"(Guillaume, A., 1955, The Life of Muhammad, Oxford University Press, Karachi, Pakistan, p. 682)Hadithi hii inatolewa kama ushahidi wa kihistoria kwamba Aisha alikuwa na umri mdogo wakati wa ndoa na kifo cha Mtume Muhammad. Hata hivyo, taarifa hizi zimekuwa msingi wa mjadala mkubwa wa kisomi, kihistoria, na kimaadili.Umri wa Aisha na Ndoa ya Mtume MuhammadTaarifa nyingi za kihistoria zinadai kuwa Aisha aliolewa akiwa na umri wa miaka sita na ndoa yao ilikamilika akiwa na miaka tisa. Hadithi hizi zinapatikana katika baadhi ya vyanzo vya msingi vya Kiislamu kama Sahih al-Bukhari na Sahih Muslim.\"Aisha alisema: Mtume alikamilisha ndoa yake nami nilipokuwa na miaka tisa.\"(Sahih al-Bukhari, Hadithi 5133; Sahih Muslim, Hadithi 1422)Hata hivyo, baadhi ya wataalamu wa kisasa wanahoji uhalali wa taarifa hizi za umri mdogo. Wana hoja kwamba rekodi hizi zinaweza kuwa zimeongezwa baadaye kwa sababu za kisiasa au za kidini, au kwa sababu za makosa ya tafsiri ya historia. Kwa mfano, Muhammad Hamidullah na Jonathan A. C. Brown wanasema kuwa muktadha wa kihistoria unaweza kuashiria kwamba Aisha alikua mkubwa zaidi kuliko ilivyoelezwa katika baadhi ya hadithi.\"The age of Aisha at marriage is widely debated. Some early sources suggest she was very young, but contextual evidence may point to a higher age at consummation.\"(Brown, J.A.C., 2009,Misquoting Muhammad, Harvard University Press)Hii inasababisha mjadala wa kihistoria na kimaadili: Je, historia hii inapaswa kutafsiriwa kisawa na kwa wingi wa vyanzo, au je, taarifa za hadithi zinasalia kuwa chanzo cha msingi cha ushahidi wa umri wa Aisha?Mchango wa Aisha katika Historia ya KiislamuHaijalishi umri wake, Aisha aliwahi kuwa mmoja wa wake wa Mtume Muhammad wenye ushawishi mkubwa. Alijulikana kwa ujuzi wake katika:Sharia (Sheria za Kiislamu)– Aisha alichangia kwa kiasi kikubwa katika tafsiri za fiqh na masuala ya kisheria.Hadithi (Ufunuo wa Mtume)– Alieleza mamia ya hadithi ambazo zimekuwa msingi wa mafunzo ya Kiislamu.Siasa na Historia– Aisha alihusika katika matukio ya kihistoria, ikiwemo vita vya sipi baada ya kifo cha Mtume Muhammad (Vita ya Jamal).Hii inathibitisha kuwa nafasi yake haikupunguzwa kwa umri, bali alichangia kwa kiwango kikubwa katika jamii ya Kiislamu.Mjadala wa Kisomi na MaadiliUchunguzi wa hadithi hizi umekua na mjadala mkubwa kimaadili. Wanaochunguza historia ya Kiislamu na hadithi za Mtume wanahoji kama ndoa ya umri mdogo inafaa kutumika kama kielelezo cha maadili leo. Wana hoja kwamba muktadha wa kihistoria ulikuwa tofauti na wa leo, na utamaduni wa wakati huo ulikuwa unakubaliana na ndoa za mapacha wachanga.Hii inapelekea mjadala wa kisomi:Wanaosema umri mdogo:Wanasema hadithi ni ya kihistoria na inapaswa kuaminiwa kama ilivyoandikwa.Wanaosema umri mkubwa:Wanasema muktadha, mashahidi wa nyongeza, na rekodi za kihistoria zinaonyesha kuwa Aisha alikua mkubwa zaidi.Hii inatoa nafasi ya kujadili kwa kina muktadha wa kihistoria na kimaadili wa ndoa ya Mtume Muhammad.HitimishoKwa kumalizia, hadithi inayosema Mtume Muhammad alifariki mikononi mwa Aisha ni muhimu katika uelewa wa historia ya Kiislamu. Ingawa taarifa za umri wa Aisha zinatofautiana, ni wazi kwamba alichangia kwa kiasi kikubwa katika jamii ya Kiislamu. Uchambuzi wa kisomi unahimiza kuzingatia vyanzo vingi, muktadha wa kihistoria, na mjadala wa kimaadili.Mjadala huu unadhihirisha umuhimu wakusoma historia kwa makinina kuzingatia tafsiri za kisasa na za jadi, bila kupuuzia ushahidi wa kihistoria.MarejeoGuillaume, A. (1955).The Life of Muhammad: A Translation of Ibn Ishaq's Sirat Rasul Allah. Oxford University Press, Karachi, Pakistan.Sahih al-Bukhari, Hadithi 5133.Sahih Muslim, Hadithi 1422.Brown, J.A.C. (2009).Misquoting Muhammad: The Challenge and Choices of Interpreting the Prophet’s Legacy. Harvard University Press.Hamidullah, M. (1974).The Life and Character of the Prophet Muhammad. Islamic Book Service.",
    "publish_date": "September 23, 2025",
    "publish_date_parsed": "2025-09-23T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 636,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:04.520553"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/eastern-orthodox-on-islam-judaism-other.html",
    "title": "Eastern Orthodox on Islam, Judaism & Other Churches",
    "content_preview": "Eastern Orthodox on Islam, Judaism & Other ChurchesThe statements cited here are taken fromFor the Life of the World: Toward A Social Ethos of the Orthodox Church, published by Holy Cross Orthodox Press in 2020. The document can be accessed at the Greek Orthodox Archdiocese of America website:Social Ethos Document. Here is thePDF Version.The readers will see that according to this document the Greek or Eastern Orthodox (EO) do believe and affirm that Muslims and Jews are worshiping the same God ",
    "full_content": "Eastern Orthodox on Islam, Judaism & Other ChurchesThe statements cited here are taken fromFor the Life of the World: Toward A Social Ethos of the Orthodox Church, published by Holy Cross Orthodox Press in 2020. The document can be accessed at the Greek Orthodox Archdiocese of America website:Social Ethos Document. Here is thePDF Version.The readers will see that according to this document the Greek or Eastern Orthodox (EO) do believe and affirm that Muslims and Jews are worshiping the same God as acknowledged by the EO. In fact, the document goes so far as to say that all the people of the world are worshiping the same God and that there are truths in all these religions including those from India and China, which most definitely include Hinduism and Buddhism!These references all come from the section titled,I. Ecumenical Relations and Relations with Other FaithsLet us pray for the unity of allAll emphasis will be mine.§55 God is Father of all the families of the heavens and the earth. God’s Logos pervades all things, and all things were created through his Logos. God’s Spirit is everywhere, enlightening and enlivening all of reality. Thus creation universally declares the power, wisdom, and grace of its maker, while at all times and in all places God is present to those who seek the truth. The Orthodox Church exists as the concrete reality of Christ’s mystical body in time,  always bearing witness tothe light of the knowledge of the glory of God in the face of Christ. It is for this reason that the Church not only reaches out and witnesses to Orthodoxy to various Christian confessions, with whom the Orthodox Church enjoys historic dialogue, but also reaches outward to meet non-Christian religions and faith communities that are open to the truth and the call of God.In this regard, it also affirms,and has done so since the earliest centuries of the faith, that God’s Logos shines forth in the whole frame of the created world and speaks to all hearts in the still small voice of conscience, and that wherever truth is revered the Spirit of God is at work. St. Justin Martyr, for instance, declared that knowledge of God’s Logos had been imparted by God not only to the children of Israel,but to the Greek philosophers who had never known Christ, and to all peoples, inasmuch as seeds of the eternal Logos have been planted in all human beings; thus, he says, all who have lived in harmony with this Logosare already in some sense Christians, while Christians may claim as their own any and every truth known to the nations of the earth by God’s inspiration.50According to St. Maximus the Confessor, the primordiallogoiunderlying and indwelling all things reside in the one Logos of God, and find their historical center in Christ.51The Church knows, moreover, that the full mystery of God’s Logos transcends human comprehension,and communicates itself in ways too numerous and wonderful to calculate or conceive. The Church thus seeks dialogue with other religious traditions not out of any desire to alter the deposit of its faith, much less out of any anxiety regarding that deposit’s sufficiency, but out of a reverent love for all who seek God and his goodness, and in a firm certitudethat God has left no people without a share in the knowledge of his glory and grace. This is not to deny, of course, that there are many irreconcilable differences between the Church’s understanding of the truth and that of other religious traditions, and it certainly has no desire to obscure this reality. It seeks neither to make compromises regarding her own essential beliefsnor condescendingly to treat those of other faiths as inconsequential. At the same time, knowing that God reveals himself in countless ways and with boundless inventiveness,the Church enters into dialogue with other faiths prepared to be amazed and delighted by the variety and beauty of God’s generous manifestations of divine goodness, grace, and wisdom among all peoples.§56 Though the Orthodox Church seeks deeper bonds of amity with all faiths, it recognizes her unique responsibility with regard to the other two “peoples of the book,” the Abrahamic traditions of Islam and Judaism, with which it has longstanding dialogues and alongside which it has lived for millennia. Therefore,the Church can and does engage the beauty and spiritual truths of Islam in all its multiple traditions, acknowledging points of contact with it especially in its affirmation of the Virgin Birth (Quran 3:47, 19:16-21, 21:91) and its recognition of Jesus as the Messiah, Messenger, Word, and Spirit of God (4:171). Although Orthodoxy cannot agree with Islam in its rejection of the Incarnation and of God as Trinity, it is nevertheless able to pursue meaningful dialogue with all parts of the Islamic Ummah regarding the proper understanding of these central Christian teachings. It believes that the common roots of Christianity and Islam in the Middle East,the common affirmation of the message of the unity of God, as well as the common recognition of the holiness and truth of God’s Word and his Prophets, the importance of prayer and ascesis, as well as the struggle to discern the will of God in all things, invite Islam and Orthodoxy to enter into an intimate conversation for the advancement of peace and understanding among all peoples.§57 As to Judaism, when the eternal Son of God became human he became incarnate as a Jew, born within the body of Israel, an heir to God’s covenants with his chosen people. He came in fulfillment of God’s saving promises to his people, as the Messiah of Israel. The first blood he shed for the redemption of the world was exacted on the day of his circumcision; his first confession before the world concerning the justice of God was in the synagogue, as was the first declaration of his mission to the world (Luke 4:18–21); his ministry resumed the language of the great prophets of Israel; and he was executed by a pagan authority under the title “King of the Jews.” It was to Israel that God declared himself as The One Who Is, to Israel that God gave the Law as a language of love and communion, with Israel that God established an everlasting covenant, and to Israel that he proclaimed, “I will bless those who bless you and curse those who curse you, and in you shall all the families of the earth be blessed” (Genesis 12:3). As the Apostle Paul emphasized, Christians are saved in Christ only in being grafted like wild olive branches into the cultivated olive tree of Israel, and the branches do not support—but rather are supported by—the root (Romans 11:16–24). Orthodox Christians look to the Jewish communities throughout the world not merely as to practitioners of another creed,but as to, in some sense, their spiritual elders in the history of God’s saving revelations, and as to the guardians of that precious inheritance that is the first full manifestation of God’s saving presence in history. It is, sadly, necessary to state these things with a special emphasis at this moment. In recent years, we have witnessed a revival in many quarters of the Western world of the most insidious ideologies of national, religious, and even racial identity in general, and of anti-Semitic movements in particular. Bigotry and violence against Jews have long been a conspicuous evil of the cultures of Christendom; the greatest systematic campaign of mass murder and attempted genocide in European history was undertaken against the Jews of Europe; and—while some Orthodox clergy and laity demonstrated exceptional generosity and even sacrificial compassion to their Jewish brothers and sisters, earning from them the honorific “righteous among the nations”—other historically Orthodox nations have dark histories of anti-Semitic violence and oppression. For all these evils, Christians must seek God’s forgiveness. In expiation for those crimes against the Jewish peoplespecifically committed in Orthodox lands, the Church seeks both God’s forgiveness as well as a deeper relation of love and regard with Jewish communities and the Jewish faith.§58 The story of other non-Orthodox Christian religious traditions is not yet finished, and Orthodoxy affirms that like other non-Orthodox Christian bodies they only find their coherence and clarity within the Orthodox Church.As for other religions, the Orthodox Church takes encouragement from the words of the Apostle Paul to the Athenians at the Areopagus: “What therefore you worship as unknown, this I proclaim to you”(Acts 17:23). From this the Church is given license to proclaimthat the true God in whom all humanity lives and moves and has its beingis worshipped by peoples everywhere, Christian and non-Christian alike. And this makes her only more eager to make all persons and peoples aware that the face of this one true God shines forth unobscured in the face of Jesus Christ. Moreover, the Church—illumined by that radiance—enters into dialogue with other faiths fully prepared to be instructed by many of their own speculative, cultural, and spiritual achievements. It may be that, just as the Church of the early centuries profited fromand in time baptized many of the philosophical, religious, and cultural riches of pre-Christian Europe, Asia Minor, and the Near East, so too may it now discover new ways of articulating the deposit of faith or new ways of thinking about its cultural expressions and conceptual formsby exposure to, say, the great philosophies and faiths OF INDIA, or to the traditions OF CHINA and the greater FAR EAST, or to the spiritual experiences of tribal peoples throughout the world, and so on. Again, as Justin Martyr insisted, whatsoever is true and godly is welcome to us, for the Logos is everywhere and shines forth in all places.50 Justin, FirstApology46. PG6.397B. AndSecond Apology8, 10, and 13. PG 6.457A, 460B, and 465B.51 Maximus,Ambiguum7. PG 91.1081C. SeeOn Difficulties in the Church Fathers, vol. 1, 75–141.And this is what the document states in respect to the other ancient Apostolic Churches:§52 Though visible sacramental unity among all Christians is at present only a remote hope, nothing lies beyond the power of God’s Spirit, and the Church cannot relent in her labors to achieve a final reunion of all who come together in Christ’s name. Until that day, so long as their hearts and minds are open to the promptings of God’s Word and Spirit, Christians of all communions can meet together in love and work together for the transformation of the world. In particular, they can cooperate with one another in works of charity, thereby making God’s love manifest to the world, and in efforts to advance social and civil justice, thereby proclaiming God’s righteousness and peace to all peoples. Moreover, even if they cannot as yet enjoy perfect communion in the full sacramental life of the Church, all Christians are called by their baptism in the Holy Trinity to gather together in prayer, to repent of past misunderstandings and offences against their brothers and sisters, and to love one another as fellow servants and heirs of the Kingdom of God.By this, all shall know that you are my disciples: if you have love for one another(John 13:35).§53 The Orthodox Church enjoys especially close relationswith thosecommunions that are directly descended from the ancient Apostolic Churchand that share something like her understanding of the apostolic charism of episcopal succession and something like her sacramental theology: the ancient churches of Egypt and Ethiopia, of Armenia,of the Assyrian tradition, of Canterbury, and of Rome. Thus, the Church has important bilateral dialogues with the Roman Catholic Church and the Anglican Communion, and it prays that these dialogues may bear fruit in a complete unity with the Church.But all Christian communions are her kin and her love for all is equally unqualified. For more than a century, then, the Orthodox Church has played a leading role in the movement towards Christian unity,out of obedience to our Lord’s supplication and exhortationthat all may be one(John 17:21).The Ecumenical Patriarchate, in particular, has been at the forefront of the Orthodox engagement with Christians of other communions, and has remained a steadfast participant in numerous bilateral and multi-lateral dialogues with other major Christian churches.The Ecumenical Patriarchate was, in fact, one of the founding members of the World Council of Churches, and has continuously maintained an official representative presence at that council’s central offices.§54 In short, the Church is dedicated to a sustained dialogue with other Christians. Dialogue, in the Orthodox understanding, is essentially and primordially a reflection of the dialogue between God and humanity: it is initiated by God and conducted through the divine Logos (dia-logos), our Lord and Savior Jesus Christ. Pervading all human life, dialogue takes place in all our encounters, personal, social, or political, and must always be extended to those who adhere to religions different from ours. And in all our connections and relationships, the Word of God is mystically present, ever guiding our exchange of words and ideas towards a spiritual union of hearts in him. Naturally, the Orthodox Church considers itself responsible always to interpret other traditions and perspectives in terms of what was revealed to it by God. In so doing, it is open towhatever is true, whatever is honorable, whatever is pleasing, whatever is commendable(Philippians 4:8), and is ready to rejoice whenever it discovers these in her partners of dialogue. Our commitment to ecumenical relations with other Christian confessions reflects this openness to all who sincerely seek the truth as the incarnate Logos, Jesus Christ, and who remain true to their conscience, even while we continue to bear witness to the fullness of the Christian faith in the Orthodox Church. Moreover, the Church can stand with other Christians in this way not only out of solidarity in light of a shared history and moral vision,but also because such Christian groups, through their Trinitarian baptism and confession of the faith of the Councils, profess and share many aspects of Orthodox teaching and tradition.The readers should pay careful attention to the document unashamedly highlighting the fact that the Ecumenical Patriarchate of the EO was one of the founding members of the World Council of Churches!",
    "publish_date": "September 21, 2025",
    "publish_date_parsed": "2025-09-21T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 2337,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:09.811118"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/patriarch-bartholomew-on-muslims.html",
    "title": "Patriarch Bartholomew on Muslims",
    "content_preview": "Patriarch Bartholomew on MuslimsI cite what Ecumenical Patriarch Bartholomew stated in respect to Muslims and Islam. All emphasis will be mine.Address by His All-Holiness Ecumenical PatriarchBartholomewEsteemed religious leaders, venerable scholars, beloved brothers and sisters,As the golden sun rises over this ancient city, a place where history paints an intricate tableau of religious, cultural, and ethnic pluralism, we gather with purpose and hope. With each exchange of dialogue and every ges",
    "full_content": "Patriarch Bartholomew on MuslimsI cite what Ecumenical Patriarch Bartholomew stated in respect to Muslims and Islam. All emphasis will be mine.Address by His All-Holiness Ecumenical PatriarchBartholomewEsteemed religious leaders, venerable scholars, beloved brothers and sisters,As the golden sun rises over this ancient city, a place where history paints an intricate tableau of religious, cultural, and ethnic pluralism, we gather with purpose and hope. With each exchange of dialogue and every gesture of partnership, we lay down a foundation, connecting centuries of shared history, culture, and values.Historically, the intertwining threads of Christianity and Islam have woven stories of shared existence, bearing testimony to ages of coexistence. As inheritors of this rich legacy, we are summoned today to not only reminisce about our shared past, but to forge ahead, uniting in the face of present-day challenges.At the monumental Holy and Great Council of the Orthodox Church on the island of Crete in 2016, we were reminded: “The Church lives not for herself. She offers herself for the whole of humanity in order to raise up and renew the world into new heavens and a new earth” (Holy and Great Council, 2016). This profound message transcends boundaries, beckoning all of humankind to unite for the greater good.Both Christianity and Islam, SPIRITUAL LEGACIES OF ABRAHAM, provide a reservoir of teachings that advocate peace, mutual respect, and stewardship of God’s creation. The sacred Psalmist beautifully captures the spirit of unity, expressing, “Behold, how good and pleasant it is when brothers dwell in unity!” (Psalms 133:1). Complementing this sentiment, the poetic genius Al-Mutanabbi professes, “He who does not have forbearance, has nothing.” These words shine as guiding stars, leading us on a path to shared comprehension.St. Augustine of Hippo stated that “Peace is the tranquility of order.”This understanding finds echoes in the philosophical depths of Islamic tradition, with Al-Farabi asserting that a truly virtuous society fosters inner peace and common good. Such sagacious teachings offer a foundation upon which we can build a shared future.Now, more than ever, our world stands at a pivotal crossroads. Our Earth, which has cradled civilizations and nurtured cultures, is beset with unprecedented perils. Environmental crises, from escalating climate events to the diminishing diversity of life, issue a pressing call to arms for united action. We have consistently reiterated, “The earth does not belong to us. It is a gift, and we have the moral obligation to respect and preserve it for future generations” (Bartholomew, 2018).As faith leaders and communities, we are uniquely positioned to respond to this call. Our scriptures, traditions, and histories are replete with teachings that emphasize our duty toward the environment. It’s time we plunged deep into these repositories of wisdom to spearhead a collective, faith-based environmental movement.Moreover, dialogue must manifest in concrete actions. Words are but the beginning; the real testament of our commitment will be the projects we initiate, the communities we uplift, and the environment we safeguard. Through initiatives grounded in our shared values, we can inspire transformation on both individual and collective levels.To realize the vision of “One Earth, One Family, One Future,” we must transcend mere tolerance. True dialogue entails deep respect, mutual understanding, and collective action. Our scriptures offer countless narratives that champion unity, respect, and cooperation. By immersing ourselves in these narratives, we can draw inspiration for our common journey.Our Earth, a shared sanctuary, has sheltered countless generations, each adding its own unique chapter to the saga of humanity. Our generation stands at an epochal moment, endowed with the responsibility to chart a course that guarantees peace, prosperity, and ecological balance for those yet to come.As we navigate the challenges of the present, let our actions be guided by the timeless wisdom of our faith traditions. Let this conference be more than a mere congregation of individuals. Let it be a symphony of voices, ideas, and aspirations in order to create a transformative global movement. A movement that, guided by the words of St. Paul, embodies the spirit of “God has called us to peace” (1 Corinthians 7:15).Let us march forth with a renewed sense of purpose, unity, and determination. Let the echoes of our dialogue reverberate through time, inspiring future generations to further strengthen and advance our fellowship. Let this historical city of myriad cultures bear witness to our pledge today: a pledge to work together, shoulder to shoulder, in shaping a world that celebrates diversity, fosters unity, and safeguards our shared Earthlyoikos.May God’s infinite blessings be a guiding light on our path, fortifying our endeavors and filling our hearts with love, compassion, and hope!Works Cited:Bartholomew. “Message for the Day of Prayer for the Protection of Creation.”Ecumenical Patriarchate, 2018.Holy and Great Council of the Orthodox Church. “The Mission of the Orthodox Church in Today’s World.” Crete, 2016.The Holy Bible, English Standard Version (ESV). Crossway Bibles, 2016.Al-Mutanabbi.Selected Poems. Translated by A.J. Arberry, Cambridge University Press, 1967.Augustine of Hippo.Confessions. Translated by Henry Chadwick, Oxford University Press, 1991.Al-Farabi.Alfarabi’s Philosophy of Plato and Aristotle. Translated by Muhsin Mahdi, Free Press, 1962.",
    "publish_date": "September 21, 2025",
    "publish_date_parsed": "2025-09-21T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "islam",
    "word_count": 827,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:09.750881"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/patriarch-timothy-i-on-muhammad.html",
    "title": "Patriarch Timothy I on Muhammad",
    "content_preview": "Patriarch Timothy I on MuhammadThe following excerpt is taken fromThe apology of Timothy the Patriarch before the Caliph Mahdi, translated by Alphonse Mingana, published by Manchester University Press, England, 1928, pp. 196-198. Timothy I (AD 780-823) was the Patriarch of the Assyrian Church of the East who made an apology for the Christian faith to the third Abbasid Caliph Mahdi.The brilliance of the Patriarch can be seen from the fact that though he praises Muhammad before the caliph, he made",
    "full_content": "Patriarch Timothy I on MuhammadThe following excerpt is taken fromThe apology of Timothy the Patriarch before the Caliph Mahdi, translated by Alphonse Mingana, published by Manchester University Press, England, 1928, pp. 196-198. Timothy I (AD 780-823) was the Patriarch of the Assyrian Church of the East who made an apology for the Christian faith to the third Abbasid Caliph Mahdi.The brilliance of the Patriarch can be seen from the fact that though he praises Muhammad before the caliph, he made sure to never call him a prophet. Instead, he simply affirmed that Muhammad walked in the path of the prophets. All emphasis will be mineThe Questions and Answers of the Second Day.The next1day I had an audience of his Majesty. Such audiences had constantly taken place previously, sometimes for the affairs of the State, and some other times for the love of wisdom and learning which was burning in the soul of his Majesty. He is a lovable man, and loves also learning when he finds it in other people, and on this account he directed against me the weight of his objections, whenever necessary. After I had paid to him my usual respects as King of Kings, he began to address me and converse with me not in a harsh and haughty tone, since harshness and haughtiness are remote from his soul, but in a sweet and benevolent way.And our King of Kings said to me: “O Catholicos, did you bring a Gospel with you, as 1 had asked you?” — And I replied to his exalted Majesty: “1 have brought one, O our victorious and God-loving King.” — And our victorious Sovereign said to me: “Who gave you this Book?” — And I replied to him: “It is the Word of God that gave us the Gospel, O our God-loving King.” — And our King said: “Was it not written -by four Apostles?”2And I replied to him: “It was written by four Apostles, as our King has said, but not out of their own heads, but out of what they heard and learned from the Word-God. If then the Gospel was written by the Apostles, and if the Apostles simply wrote what they heard and learned from the Word-God, the Gospel has, therefore, been given in reality by the Word-God. Similarly, the Torah was written by Moses, but since Moses heard and learned it from an angel, and the angel heard and learned it from God, we assert that the Torah was given by God and not by Moses.“In the same way also the Muslims say that they have received the Kur’an from Muhammad, but since Muhammad received knowledge and writing from an angel, they, therefore, affirm that the Book that was divulged through him was not Muhammad’s or the angel’s but God’s. So also we Christians believe that although the Gospel was given to us by the Apostles, it was not given as from them but as from God, His Word and His Spirit. Further, the letters and official documents1of your Majesty are written by the hands of scribes and clerks, but they are not said to be those of scribes, but those of your Majesty, and of the Commander of the Faithful.”And our gracious and wise King said to me: “What do you say about Muhammad?” — And I replied to his Majesty: “Muhammad is worthy of all praise, by all reasonable people, O my Sovereign.He walked in the path of the prophets, and trod in the track of the lovers of God. All the prophets taught the doctrine of one God,and since Muhammad taught the doctrine of the unity of God, he walked, therefore, in the path of the prophets. Further, all the prophets drove men away from bad works, and brought them nearer to good works, and since Muhammad drove his people away from bad works and brought them nearer to the good ones,he walked, therefore, in the path of the prophets. Again, all the prophets separated men from idolatry and polytheism, and attached them to God and to His cult, and since Muhammad separated his people from idolatry and polytheism,and attached them to the cult and the knowledge of one God, beside whom there is no other God, it is obvious that he walked in the path of the prophets. Finally Muhammad taught, about God, His Word and His Spirit, and since all the prophets had prophesied about God, His Word and His Spirit,Muhammad walked, therefore, in the path of all the prophets.“Who will not praise, honour and exalt the one who not only fought for God in words, but showed also his zeal for Him in the sword?As Moses did with the Children of Israel when he saw that they had fashioned a golden calf which they worshipped, and killed all of those who were worshipping it,so also Muhammad evinced an ardent zeal towards God, and loved and honoured Him more than his own soul, his people and his relatives. He praised, honoured and exalted those who worshipped God with him, and promised them kingdom, praise and honour from God, both in this world and in the world to come in the Garden.2But those who worshipped idols and not God he fought and opposed, and showed to them the torments of hell and of the fire which is never quenched and in which all evildoers burn eternally.“And what Abraham, that friend and beloved of God, did in turning his face from idols and from his kinsmen, and looking only towards one God and becoming the preacher of one God to other peoples,this also Muhammad did. He turned his face from idols and their worshippers, whether those idols were those of his own kinsmen or of strangers, and he honoured and worshipped only one God. Because of this God honoured him exceedingly and brought low1before his feet two powerful kingdoms which roared in the world like a lion and made the voice of their authority heard in all the earth that is below heaven like thunder, viz: the Kingdom of the Persians and that of the Romans. The former kingdom, that is to say the Kingdom of the Persians, worshipped the creatures instead of the Creator, and the latter,that is to say the Kingdom of the Romans, attributed suffering and death in the flesh to the one who cannot suffer and die in any way and through any process.2He further extended the power of his authority through the Commander of the Faithful and his children from east to west, and from north to south. Who will not praise, O our victorious King, the one whom God has praised, and will not weave a crown of glory and majesty to the one whom God has glorified and exalted?These and similar things I and all God-lovers utter about Muhammad, O my sovereign.”And our King said to me: “You should, therefore, accept the words of the Prophet.” — And I replied to his gracious Majesty: “Which words of his our victorious King believes that I must accept?” — And our King said to me: “That God is one and that there is no other one besides Him.” — And I replied: “This belief in one God, O my Sovereign, I have learned from the Torah, from the Prophets and from the Gospel. I stand by it and shall die in it.” — And our victorious King said to me: “You believe in one God, as you said, but one in three.” — And I answered his sentence: “I do not deny that I believe in one God in three, and three in one, but not in three different Godheads, however, but in the persons of God’s Word and His Spirit. I believe that these three constitute one God, not in their person but in their nature. 1 have shown how in my previous words.”",
    "publish_date": "September 21, 2025",
    "publish_date_parsed": "2025-09-21T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muhammad",
    "word_count": 1308,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:09.703795"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/09/gregory-palamas-on-muslim-god.html",
    "title": "Gregory Palamas on the Muslim God",
    "content_preview": "Gregory Palamas on the Muslim GodSt. Gregory mentions a dialogue he had with a group of Turkish Muslims. What makes his comments rather amazing is that he affirms that both the Muslims and himself are calling upon one and the same God, even though these Turks are ignorant of the fact that this God whom they worship is inseparable from Christ:“He, rising up his hands, let out a cry and they responded even louder. He did this three times.Then those who were set to do the burying take the box up on",
    "full_content": "Gregory Palamas on the Muslim GodSt. Gregory mentions a dialogue he had with a group of Turkish Muslims. What makes his comments rather amazing is that he affirms that both the Muslims and himself are calling upon one and the same God, even though these Turks are ignorant of the fact that this God whom they worship is inseparable from Christ:“He, rising up his hands, let out a cry and they responded even louder. He did this three times.Then those who were set to do the burying take the box up on their arms and walk further down. All the rest of them, with the Tasimanes, returned home. As I was sitting there I asked whether anyone could speak both languages that I needed. There was somebody, whom I asked to say TO THE TURKS [Muslims] on my behalf that what they had performed outside there I thought it was good, “for you addressed yourselves to God – to whom else? – for the deceased one. I wanted, however, to know what was that you exclaimed to God?” Tasimanes using the same interpreter said that he would explain: “We asked for forgiveness from God for the deceased, for his own sins committed in his soul.” Retorting myself I said, “Very well, but the judge is merciful, indeed, and dispenses mercy; and he who will come as judge of every race of men, even according to you, is Christ. You must be addressing, therefore, the prayers and the exclamations to Him. Thus you, too, invoke him as God, as we do, who believe that as an inborn Word of His he is indivisible from the Father; for there was no time when God was without reason or without the natural word.” (Source: Saint Gregory Palamas,Littera & Dialexis Patrologia Migne–PG, CL, COL. DCCCVIII)Notice how this great saint argues that the Muslims do indeed believe in the same God, and not different one. He then sets forth to prove that Jesus is indivisible from this God whom the Turks worship since is the Word of the Father. St. Gregory could not argue this way if he actually thought that the Muslim god was different from the God he professed and worshiped.",
    "publish_date": "September 21, 2025",
    "publish_date_parsed": "2025-09-21T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muslim",
    "word_count": 368,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:09.605736"
  },
  {
    "url": "https://www.maxshimbaministries.org/2025/10/muslims-awaken-from-slumber-to-realize.html",
    "title": "“MUSLIMS, AWAKEN FROM SLUMBER TO REALIZE THAT CHRISTIANS ARE NOT INFIDELS”",
    "content_preview": "Tuesday, January 10, 2017“MUSLIMS, AWAKEN FROM SLUMBER TO REALIZE THAT CHRISTIANS ARE NOT INFIDELS”I know you may be surprised and wonder how a Muslim can awaken when you believe that your eyes are already open. When I say this, I mean that although you think you are fully aware, your belief about Christians—that they are infidels—is based solely on what you have been taught. You accepted it because the Quran says so:“And the Jews say, ‘Uzair is the son of God,’ and the Christians say, ‘The Mess",
    "full_content": "Tuesday, January 10, 2017“MUSLIMS, AWAKEN FROM SLUMBER TO REALIZE THAT CHRISTIANS ARE NOT INFIDELS”I know you may be surprised and wonder how a Muslim can awaken when you believe that your eyes are already open. When I say this, I mean that although you think you are fully aware, your belief about Christians—that they are infidels—is based solely on what you have been taught. You accepted it because the Quran says so:“And the Jews say, ‘Uzair is the son of God,’ and the Christians say, ‘The Messiah is the son of God.’ That is their statement from their mouths; they imitate the saying of those who disbelieved before. May Allah destroy them; how they are deluded!”—Al-Tawba (9:30)Upon reading this verse, a Muslim is led to believe that Christians are infidels simply because they claim that Jesus is the Son of God. You believe that these words—Jesus being the Son of God—are invented by Christians themselves, and therefore, you consider us infidels. You rejoice that the Quran came to warn against this:“And to warn those who say, ‘Allah has taken a son.’”—Al-Kahf (18:4)“They have no knowledge of it, nor do their forefathers. Grave is the word that comes out of their mouths; they speak not except a lie.”—Al-Kahf (18:5)You accept without reflection that the Quran came to warn Christians for claiming that God has a son. But before you jump to labeling Christians as infidels, awaken and examine the truth. Today, I want to awaken you so that if you desire to enter the Kingdom of God, you may join me in understanding.Do Christians Truly Say That Jesus Is the Son of God?This is a crucial question to ask before accepting that Christians speak falsely or that calling them infidels is justified. Before Christians existed, and before Jesus—the origin of Christianity—was born, the angel announced to Mary:Luke 1:30–35: “Do not be afraid, Mary, for you have found favor with God. You will conceive and give birth to a son, and you shall name him Jesus. He will be great, and will be called the Son of the Most High; the Lord God will give him the throne of his father David. His kingdom will have no end. The Holy Spirit will come upon you, and the power of the Most High will overshadow you; therefore, the child to be born will be holy, the Son of God.”It was the angel who proclaimed that Jesus would be called the Son of God, not the Christians themselves. Even God affirmed this truth:Matthew 17:1–6: Jesus took Peter, James, and John up a high mountain. There, his face shone like the sun, and his clothes became white as light. Suddenly, Moses and Elijah appeared and spoke with him. A bright cloud overshadowed them, and a voice from the cloud said: “This is my Son, whom I love; with him I am well pleased. Listen to him.”Ask yourself, Muslim reader: Were the angel and God themselves Christians? Can God or His angels be infidels? Even Jesus confirmed his identity as the Son of God:John 9:35–38: “Do you believe in the Son of God?” Jesus asked. The man replied, “Who is he, Lord, that I may believe?” Jesus said, “You have seen him; he is speaking to you.” The man said, “I believe, Lord,” and worshiped him.Could Jesus truly be an infidel? He is the one revealing to Christians that he is the Son of God, and Peter acknowledged this truth (Matthew 16:13–17).Christians Are Not InfidelsSaying Jesus is the Son of God is a divine revelation. So why do Muslims believe that Christians are infidels for acknowledging this truth? Muhammad framed it as a test, suggesting that acknowledging Jesus as the Son of God makes one a disbeliever—but the Scriptures themselves (Nehemiah 5:8–9; Galatians 3:26–29) show otherwise. Christians did not become infidels merely by believing in Jesus; rather, true infidelity was opposed to the Jewish people, the enemies of God’s chosen people.Moreover, the Quran itself shows the context:“You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah; and you will find the nearest in affection to the believers to be those who say, ‘We are Christians.’ That is because among them are priests and monks, and because they are not arrogant.”—Al-Maaida (5:82)Thus, Muslims are told that Jews are their primary enemies. Friendship with Jews is prohibited (Al-Maaida 5:51). True awakening requires understanding that you are not justified in labeling Christians as infidels merely for acknowledging Jesus as the Son of God.Faith and SalvationBelief in Jesus as the Son of God brings eternal life:John 3:16–17: “For God so loved the world that He gave His one and only Son, that whoever believes in him shall not perish but have eternal life. For God did not send His Son into the world to condemn the world, but to save the world through him.”John 3:36: “Whoever believes in the Son has eternal life; whoever does not believe the Son shall not see life, but the wrath of God remains on him.”Muhammad warned of God’s wrath because he did not know the fate of his own soul regarding the Kingdom of God. But the Bible clearly teaches that acknowledging Jesus as the Son of God is the path to salvation, not disbelief:Maryam 19:88–90: The Quran exaggerates the reaction to this truth as if the heavens would split and the mountains collapse. This hyperbole demonstrates that calling Jesus the Son of God is not truly infidelity.Therefore, awaken today, Muslim reader, and recognize that believing Jesus is the Son of God does not make one an infidel.Max Shimba Ministries Org",
    "publish_date": "January 10, 2017",
    "publish_date_parsed": "2017-01-10T00:00:00",
    "date_source": "content_regex",
    "matching_keyword": "muslim",
    "word_count": 943,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:19:59.150268"
  },
  {
    "url": "https://maxshimbaministries.org#user-content-fn-1",
    "title": "Ukristo ni Bora Kuliko Uislamu",
    "content_preview": "Vizuri kabisa 🙏. Hapa nimeandika tena makala yako kwamtindo wa kitaaluma, nikiongezamaelezo ya chini (footnotes)naorodha ya marejeomwisho. Hii inafanya iendane na viwango vya uchapishaji wa kisomi.Ukristo ni Bora Kuliko UislamuNa: Dr. Maxwell Shimba1. UtanguliziUkristo na Uislamu mara nyingi hutajwa kama dini mbili kuu za Kimonotheisti (zinazomwamini Mungu mmoja). Hata hivyo, uchambuzi wa kina wa maandiko ya msingi, historia, na theolojia zao unaonyesha tofauti kubwa zinazoweka Ukristo juu kulik",
    "full_content": "Vizuri kabisa 🙏. Hapa nimeandika tena makala yako kwamtindo wa kitaaluma, nikiongezamaelezo ya chini (footnotes)naorodha ya marejeomwisho. Hii inafanya iendane na viwango vya uchapishaji wa kisomi.Ukristo ni Bora Kuliko UislamuNa: Dr. Maxwell Shimba1. UtanguliziUkristo na Uislamu mara nyingi hutajwa kama dini mbili kuu za Kimonotheisti (zinazomwamini Mungu mmoja). Hata hivyo, uchambuzi wa kina wa maandiko ya msingi, historia, na theolojia zao unaonyesha tofauti kubwa zinazoweka Ukristo juu kuliko Uislamu. Biblia ni mkusanyiko wa maandiko yaliyohifadhiwa kwa karne nyingi, yaliyoandikwa kati ya karne ya 15 K.K. hadi karne ya kwanza B.K., wakati Qur’an iliibuka karne ya 7 B.K., karne nyingi baadaye.12. Yesu Kristo na Utimilifu wa UnabiiYesu Kristo ndiye kiini cha Ukristo. Alitabiriwa na manabii wa Agano la Kale (Isaya 7:14; Mika 5:2), na maisha yake yameandikwa na mashahidi wa macho katika Injili. Hata wanahistoria wasio Wakristo kamaFlavius Josephus(Antiquities of the Jews, 18.3.3) naTacitus(Annals, 15.44) walithibitisha kuwepo kwa Yesu na kifo chake chini ya Pontio Pilato.2Qur’an yenyewe inakiri kuzaliwa kwa muujiza kwa Yesu (Qur’an 3:45-47).3. Uhakika wa Maandiko ya BibliaBiblia inajulikana kwa uhifadhi wake wa kipekee.Dead Sea Scrolls(karne ya 2 K.K.–1 B.K.) ziligunduliwa mwaka 1947 na kuthibitisha uaminifu wa maandiko ya Agano la Kale yaliyopo sasa.3Biblia yenyewe inashuhudia kudumu kwake:“Majani yakauka, ua likanyauka; bali neno la Mungu wetu litadumu milele”(Isaya 40:8). Qur’an pia inakubali uhalali wa Taurati na Injili (Qur’an 5:46).4. Upendo wa Mungu na Uhakika wa WokovuMsingi wa Ukristo ni upendo wa Mungu:“Kwa maana jinsi hii Mungu aliupenda ulimwengu, hata akamtoa Mwana wake pekee”(Yohana 3:16). Wokovu unatolewa bure kupitia imani (Waefeso 2:8-9). Kwa upande mwingine, Uislamu unaweka msisitizo juu ya matendo na utiifu wa sharia, bila uhakika wa wokovu (Qur’an 45:28).5. Kifo na Ufufuo wa Yesu: Ushahidi KihistoriaUkristo unasimama juu ya kifo na ufufuo wa Yesu. Mtume Paulo anaeleza:“Kristo alikufa kwa ajili ya dhambi zetu… akazikwa, akafufuka siku ya tatu”(1 Wakorintho 15:3-4). Ushahidi wa kaburi tupu na mashahidi wa macho ni wa kihistoria. Hata wanahistoria wa Kiyahudi na Warumi walithibitisha tukio hili.4Qur’an (Sura 4:157) inakataa msalaba, lakini ushahidi wa kihistoria na wa kimaandiko unapingana na madai hayo.6. Mifano ya Kihistoria ya Karne za KatiHistoria inathibitisha tofauti kati ya dini hizi mbili:Katika Ukristo, vyuo vikuu vya kwanza Ulaya (Oxford, Cambridge, Sorbonne) vilianzishwa kutokana na hamu ya kutafuta maarifa ya Mungu.5Wanasayansi kamaGalileo Galilei,Johannes Kepler, naIsaac Newtonwaliongozwa na imani ya Kikristo kwamba ulimwengu una mpangilio wa Kimungu.Katika Uislamu, upanuzi mkubwa ulifanyika kupitiavita vya jihadi. Waarabu walivamia Afrika Kaskazini, Mashariki ya Kati, na Uhispania. Wakristo wa Hispania waliishi chini ya utawala wa Kiislamu hadiReconquista(1492).67. Tofauti ya TheolojiaTofauti ya msingi iko wazi: Mungu wa Biblia ni Mungu wa upendo na wokovu, wakati Qur’an inamchora Allah kama mtawala mkali asiye na uhakika wa kutoa wokovu. Yohane 8:36 inasema:“Basi Mwana atakapowaweka huru, mtakuwa huru kweli kweli.”Qur’an 5:68 inakiri kuwa Wayahudi na Wakristo lazima washikamane na Taurati na Injili, lakini Waislamu wanakana. Hii inaleta kile kinachoitwa “Dilema ya Kiislamu.”78. HitimishoUlinganisho wa kihistoria na kimaandiko unaonyesha wazi kwamba Ukristo ni bora kuliko Uislamu. Biblia ina ushahidi wa kihistoria, upendo wa Mungu, unabii ulio timilika, na uhakika wa wokovu. Uislamu una misingi dhaifu ya kihistoria, unakanusha ukweli wa kifo cha Yesu na hutegemea matendo bila neema. Qur’an yenyewe inasema:“Neno la Mungu haliwezi kubadilishwa”(Qur’an 10:64). Kwa hivyo, Biblia inabaki kuwa Neno la Mungu lisiloharibika, na Ukristo unathibitisha ukuu wake juu ya Uislamu.Maelezo ya ChiniMarejeoBiblia TakatifuQur’an Tukufu (tafsiri ya Yusuf Ali na Pickthall)Vitabu vya kihistoria vilivyotajwa hapo juuJe ungependa nifanyemuundo wa kitabu (chapters + subchapters)ili makala hii iwe sehemu ya kitabu kipya chako cha apologetics, au iendelee kubaki kama makala ya kitaaluma ya kujitegemea?FootnotesPhilip Jenkins,The Lost History of Christianity(HarperOne, 2008), uk. 34.↩Flavius Josephus,Antiquities of the Jews, 18.3.3; Tacitus,Annals, 15.44.↩Geza Vermes,The Complete Dead Sea Scrolls in English(Penguin, 2011).↩Gary Habermas & Michael Licona,The Case for the Resurrection of Jesus(Kregel, 2004).↩Hastings Rashdall,The Universities of Europe in the Middle Ages(Oxford, 1895).↩Thomas F. Glick,Islamic and Christian Spain in the Early Middle Ages(Brill, 2005).↩Norman Geisler & Abdul Saleeb,Answering Islam(Baker Academic, 2002).↩",
    "publish_date": "No date found",
    "publish_date_parsed": null,
    "date_source": "unknown",
    "matching_keyword": "islam",
    "word_count": 643,
    "html_file_path": null,
    "markdown_file_path": null,
    "scraped_at": "2025-11-20T06:20:07.025800"
  }
]